def @main(%input_1: Tensor[(1, 96, 96, 1), float32] /* ty=Tensor[(1, 96, 96, 1), float32] span=Reshape_1.input_1:0:0 */) -> Tensor[(1, 2), float32] {
  %0 = reshape(%input_1, newshape=[-1, 1, 96, 96]) /* ty=Tensor[(1, 1, 96, 96), float32] span=Reshape_1:0:0 */;
  %1 = qnn.quantize(%0, 1f /* ty=float32 span=QuantizeLinear_1.model/Conv1/Conv2D__620:0_scale:0:0 */, 0 /* ty=int32 span=QuantizeLinear_1:0:0 */, out_dtype="int8", axis=1) /* ty=Tensor[(1, 1, 96, 96), int8] span=QuantizeLinear_1:0:0 */;
  %2 = layout_transform(%1, src_layout="NCHW", dst_layout="NHWC") /* ty=Tensor[(1, 96, 96, 1), int8] */;
  %3 = qnn.conv2d(%2, meta[relay.Constant][0] /* ty=Tensor[(3, 3, 1, 8), int8] */, 0 /* ty=int32 span=QLinearConv_1:0:0 */, 0 /* ty=int32 span=QLinearConv_1:0:0 */, 1f /* ty=float32 span=QLinearConv_1:0:0 */, 0.00390625f /* ty=float32 span=QLinearConv_1:0:0 */, strides=[2, 2], padding=[0, 0, 1, 1], channels=8, kernel_size=[3, 3], data_layout="NHWC", kernel_layout="HWIO", out_dtype="int32") /* ty=Tensor[(1, 48, 48, 8), int32] span=QLinearConv_1:0:0 */;
  %4 = qnn.requantize(%3, 0.00390625f /* ty=float32 span=QLinearConv_1:0:0 */, 0 /* ty=int32 span=QLinearConv_1:0:0 */, 1f /* ty=float32 span=QLinearConv_1:0:0 */, 0 /* ty=int32 span=QLinearConv_1:0:0 */, axis=3, rounding="UPWARD", compute_dtype="int64", out_dtype="int8") /* ty=Tensor[(1, 48, 48, 8), int8] span=QLinearConv_1:0:0 */;
  %5 = add(%4, meta[relay.Constant][1] /* ty=Tensor[(1, 1, 1, 8), int8] */) /* ty=Tensor[(1, 48, 48, 8), int8] span=Add_1:0:0 */;
  %6 = qnn.dequantize(%5, 1f /* ty=float32 span=QLinearConv_1.model/bn_Conv1/FusedBatchNormV3:0_scale:0:0 */, 0 /* ty=int32 span=DequantizeLinear_1:0:0 */, out_dtype="float32", axis=3) /* ty=Tensor[(1, 48, 48, 8), float32] span=DequantizeLinear_1:0:0 */;
  %7 = clip(%6, a_min=0f, a_max=6f) /* ty=Tensor[(1, 48, 48, 8), float32] span=Clip_1:0:0 */;
  %8 = qnn.quantize(%7, 1f /* ty=float32 span=QuantizeLinear_2.model/Conv1_relu/Relu6:0_scale:0:0 */, 0 /* ty=int32 span=QuantizeLinear_2:0:0 */, out_dtype="int8", axis=3) /* ty=Tensor[(1, 48, 48, 8), int8] span=QuantizeLinear_2:0:0 */;
  %9 = @tvmgen_default_esp_main_0(%8, meta[relay.Constant][2] /* ty=Tensor[(3, 3, 8, 1), int8] */, meta[relay.Constant][3] /* ty=Tensor[(1, 1, 1, 8), int8] */) /* ty=Tensor[(1, 48, 48, 8), int8] */;
  %10 = qnn.dequantize(%9, 1f /* ty=float32 span=QLinearConv_2.model/expanded_conv_depthwise_BN/FusedBatchNormV3:0_scale:0:0 */, 0 /* ty=int32 span=DequantizeLinear_2:0:0 */, out_dtype="float32", axis=3) /* ty=Tensor[(1, 48, 48, 8), float32] span=DequantizeLinear_2:0:0 */;
  %11 = clip(%10, a_min=0f, a_max=6f) /* ty=Tensor[(1, 48, 48, 8), float32] span=Clip_2:0:0 */;
  %12 = qnn.quantize(%11, 1f /* ty=float32 span=QuantizeLinear_3.model/expanded_conv_depthwise_relu/Relu6:0_scale:0:0 */, 0 /* ty=int32 span=QuantizeLinear_3:0:0 */, out_dtype="int8", axis=3) /* ty=Tensor[(1, 48, 48, 8), int8] span=QuantizeLinear_3:0:0 */;
  %13 = @tvmgen_default_esp_main_1(%12, meta[relay.Constant][4] /* ty=Tensor[(8, 1, 1, 8), int8] */, meta[relay.Constant][5] /* ty=Tensor[(1, 1, 1, 8), int8] */) /* ty=Tensor[(1, 48, 48, 8), int8] */;
  %14 = qnn.dequantize(%8, 1f /* ty=float32 span=QLinearAdd_1:0:0 */, 0 /* ty=int32 span=QLinearAdd_1:0:0 */, out_dtype="float32", axis=2) /* ty=Tensor[(1, 48, 48, 8), float32] span=QLinearAdd_1:0:0 */;
  %15 = qnn.dequantize(%13, 1f /* ty=float32 span=QLinearAdd_1:0:0 */, 0 /* ty=int32 span=QLinearAdd_1:0:0 */, out_dtype="float32", axis=2) /* ty=Tensor[(1, 48, 48, 8), float32] span=QLinearAdd_1:0:0 */;
  %16 = add(%14, %15) /* ty=Tensor[(1, 48, 48, 8), float32] span=QLinearAdd_1:0:0 */;
  %17 = qnn.quantize(%16, 1f /* ty=float32 span=QLinearAdd_1:0:0 */, 0 /* ty=int32 span=QLinearAdd_1:0:0 */, out_dtype="int8", axis=2) /* ty=Tensor[(1, 48, 48, 8), int8] span=QLinearAdd_1:0:0 */;
  %18 = @tvmgen_default_esp_main_2(%17, meta[relay.Constant][6] /* ty=Tensor[(48, 1, 1, 8), int8] */, meta[relay.Constant][7] /* ty=Tensor[(1, 1, 1, 48), int8] */) /* ty=Tensor[(1, 48, 48, 48), int8] */;
  %19 = qnn.dequantize(%18, 1f /* ty=float32 span=QLinearConv_4.model/block_1_expand_BN/FusedBatchNormV3:0_scale:0:0 */, 0 /* ty=int32 span=DequantizeLinear_3:0:0 */, out_dtype="float32", axis=3) /* ty=Tensor[(1, 48, 48, 48), float32] span=DequantizeLinear_3:0:0 */;
  %20 = clip(%19, a_min=0f, a_max=6f) /* ty=Tensor[(1, 48, 48, 48), float32] span=Clip_3:0:0 */;
  %21 = nn.pad(%20, 0f /* ty=float32 span=Pad_1:0:0 */, pad_width=[[0i64, 0i64], [0i64, 1i64], [0i64, 1i64], [0i64, 0i64]]) /* ty=Tensor[(1, 49, 49, 48), float32] span=Pad_1:0:0 */;
  %22 = qnn.quantize(%21, 1f /* ty=float32 span=QuantizeLinear_4.model/block_1_pad/Pad:0_scale:0:0 */, 0 /* ty=int32 span=QuantizeLinear_4:0:0 */, out_dtype="int8", axis=3) /* ty=Tensor[(1, 49, 49, 48), int8] span=QuantizeLinear_4:0:0 */;
  %23 = @tvmgen_default_esp_main_3(%22, meta[relay.Constant][8] /* ty=Tensor[(3, 3, 48, 1), int8] */, meta[relay.Constant][9] /* ty=Tensor[(1, 1, 1, 48), int8] */) /* ty=Tensor[(1, 24, 24, 48), int8] */;
  %24 = qnn.dequantize(%23, 1f /* ty=float32 span=QLinearConv_5.model/block_1_depthwise_BN/FusedBatchNormV3:0_scale:0:0 */, 0 /* ty=int32 span=DequantizeLinear_4:0:0 */, out_dtype="float32", axis=3) /* ty=Tensor[(1, 24, 24, 48), float32] span=DequantizeLinear_4:0:0 */;
  %25 = clip(%24, a_min=0f, a_max=6f) /* ty=Tensor[(1, 24, 24, 48), float32] span=Clip_4:0:0 */;
  %26 = qnn.quantize(%25, 1f /* ty=float32 span=QuantizeLinear_5.model/block_1_depthwise_relu/Relu6:0_scale:0:0 */, 0 /* ty=int32 span=QuantizeLinear_5:0:0 */, out_dtype="int8", axis=3) /* ty=Tensor[(1, 24, 24, 48), int8] span=QuantizeLinear_5:0:0 */;
  %27 = @tvmgen_default_esp_main_4(%26, meta[relay.Constant][10] /* ty=Tensor[(8, 1, 1, 48), int8] */, meta[relay.Constant][11] /* ty=Tensor[(1, 1, 1, 8), int8] */) /* ty=Tensor[(1, 24, 24, 8), int8] */;
  %28 = @tvmgen_default_esp_main_5(%27, meta[relay.Constant][12] /* ty=Tensor[(48, 1, 1, 8), int8] */, meta[relay.Constant][13] /* ty=Tensor[(1, 1, 1, 48), int8] */) /* ty=Tensor[(1, 24, 24, 48), int8] */;
  %29 = qnn.dequantize(%28, 1f /* ty=float32 span=QLinearConv_7.model/block_2_expand_BN/FusedBatchNormV3:0_scale:0:0 */, 0 /* ty=int32 span=DequantizeLinear_5:0:0 */, out_dtype="float32", axis=3) /* ty=Tensor[(1, 24, 24, 48), float32] span=DequantizeLinear_5:0:0 */;
  %30 = clip(%29, a_min=0f, a_max=6f) /* ty=Tensor[(1, 24, 24, 48), float32] span=Clip_5:0:0 */;
  %31 = qnn.quantize(%30, 1f /* ty=float32 span=QuantizeLinear_6.model/block_2_expand_relu/Relu6:0_scale:0:0 */, 0 /* ty=int32 span=QuantizeLinear_6:0:0 */, out_dtype="int8", axis=3) /* ty=Tensor[(1, 24, 24, 48), int8] span=QuantizeLinear_6:0:0 */;
  %32 = @tvmgen_default_esp_main_6(%31, meta[relay.Constant][14] /* ty=Tensor[(3, 3, 48, 1), int8] */, meta[relay.Constant][15] /* ty=Tensor[(1, 1, 1, 48), int8] */) /* ty=Tensor[(1, 24, 24, 48), int8] */;
  %33 = qnn.dequantize(%32, 1f /* ty=float32 span=QLinearConv_8.model/block_2_depthwise_BN/FusedBatchNormV3:0_scale:0:0 */, 0 /* ty=int32 span=DequantizeLinear_6:0:0 */, out_dtype="float32", axis=3) /* ty=Tensor[(1, 24, 24, 48), float32] span=DequantizeLinear_6:0:0 */;
  %34 = clip(%33, a_min=0f, a_max=6f) /* ty=Tensor[(1, 24, 24, 48), float32] span=Clip_6:0:0 */;
  %35 = qnn.quantize(%34, 1f /* ty=float32 span=QuantizeLinear_7.model/block_2_depthwise_relu/Relu6:0_scale:0:0 */, 0 /* ty=int32 span=QuantizeLinear_7:0:0 */, out_dtype="int8", axis=3) /* ty=Tensor[(1, 24, 24, 48), int8] span=QuantizeLinear_7:0:0 */;
  %36 = @tvmgen_default_esp_main_7(%35, meta[relay.Constant][16] /* ty=Tensor[(8, 1, 1, 48), int8] */, meta[relay.Constant][17] /* ty=Tensor[(1, 1, 1, 8), int8] */) /* ty=Tensor[(1, 24, 24, 8), int8] */;
  %37 = qnn.dequantize(%27, 1f /* ty=float32 span=QLinearAdd_2:0:0 */, 0 /* ty=int32 span=QLinearAdd_2:0:0 */, out_dtype="float32", axis=2) /* ty=Tensor[(1, 24, 24, 8), float32] span=QLinearAdd_2:0:0 */;
  %38 = qnn.dequantize(%36, 1f /* ty=float32 span=QLinearAdd_2:0:0 */, 0 /* ty=int32 span=QLinearAdd_2:0:0 */, out_dtype="float32", axis=2) /* ty=Tensor[(1, 24, 24, 8), float32] span=QLinearAdd_2:0:0 */;
  %39 = add(%37, %38) /* ty=Tensor[(1, 24, 24, 8), float32] span=QLinearAdd_2:0:0 */;
  %40 = qnn.quantize(%39, 1f /* ty=float32 span=QLinearAdd_2:0:0 */, 0 /* ty=int32 span=QLinearAdd_2:0:0 */, out_dtype="int8", axis=2) /* ty=Tensor[(1, 24, 24, 8), int8] span=QLinearAdd_2:0:0 */;
  %41 = @tvmgen_default_esp_main_8(%40, meta[relay.Constant][18] /* ty=Tensor[(48, 1, 1, 8), int8] */, meta[relay.Constant][19] /* ty=Tensor[(1, 1, 1, 48), int8] */) /* ty=Tensor[(1, 24, 24, 48), int8] */;
  %42 = qnn.dequantize(%41, 1f /* ty=float32 span=QLinearConv_10.model/block_3_expand_BN/FusedBatchNormV3:0_scale:0:0 */, 0 /* ty=int32 span=DequantizeLinear_7:0:0 */, out_dtype="float32", axis=3) /* ty=Tensor[(1, 24, 24, 48), float32] span=DequantizeLinear_7:0:0 */;
  %43 = clip(%42, a_min=0f, a_max=6f) /* ty=Tensor[(1, 24, 24, 48), float32] span=Clip_7:0:0 */;
  %44 = nn.pad(%43, 0f /* ty=float32 span=Pad_2:0:0 */, pad_width=[[0i64, 0i64], [0i64, 1i64], [0i64, 1i64], [0i64, 0i64]]) /* ty=Tensor[(1, 25, 25, 48), float32] span=Pad_2:0:0 */;
  %45 = qnn.quantize(%44, 1f /* ty=float32 span=QuantizeLinear_8.model/block_3_pad/Pad:0_scale:0:0 */, 0 /* ty=int32 span=QuantizeLinear_8:0:0 */, out_dtype="int8", axis=3) /* ty=Tensor[(1, 25, 25, 48), int8] span=QuantizeLinear_8:0:0 */;
  %46 = @tvmgen_default_esp_main_9(%45, meta[relay.Constant][20] /* ty=Tensor[(3, 3, 48, 1), int8] */, meta[relay.Constant][21] /* ty=Tensor[(1, 1, 1, 48), int8] */) /* ty=Tensor[(1, 12, 12, 48), int8] */;
  %47 = qnn.dequantize(%46, 1f /* ty=float32 span=QLinearConv_11.model/block_3_depthwise_BN/FusedBatchNormV3:0_scale:0:0 */, 0 /* ty=int32 span=DequantizeLinear_8:0:0 */, out_dtype="float32", axis=3) /* ty=Tensor[(1, 12, 12, 48), float32] span=DequantizeLinear_8:0:0 */;
  %48 = clip(%47, a_min=0f, a_max=6f) /* ty=Tensor[(1, 12, 12, 48), float32] span=Clip_8:0:0 */;
  %49 = qnn.quantize(%48, 1f /* ty=float32 span=QuantizeLinear_9.model/block_3_depthwise_relu/Relu6:0_scale:0:0 */, 0 /* ty=int32 span=QuantizeLinear_9:0:0 */, out_dtype="int8", axis=3) /* ty=Tensor[(1, 12, 12, 48), int8] span=QuantizeLinear_9:0:0 */;
  %50 = @tvmgen_default_esp_main_10(%49, meta[relay.Constant][22] /* ty=Tensor[(8, 1, 1, 48), int8] */, meta[relay.Constant][23] /* ty=Tensor[(1, 1, 1, 8), int8] */) /* ty=Tensor[(1, 12, 12, 8), int8] */;
  %51 = @tvmgen_default_esp_main_11(%50, meta[relay.Constant][24] /* ty=Tensor[(48, 1, 1, 8), int8] */, meta[relay.Constant][25] /* ty=Tensor[(1, 1, 1, 48), int8] */) /* ty=Tensor[(1, 12, 12, 48), int8] */;
  %52 = qnn.dequantize(%51, 1f /* ty=float32 span=QLinearConv_13.model/block_4_expand_BN/FusedBatchNormV3:0_scale:0:0 */, 0 /* ty=int32 span=DequantizeLinear_9:0:0 */, out_dtype="float32", axis=3) /* ty=Tensor[(1, 12, 12, 48), float32] span=DequantizeLinear_9:0:0 */;
  %53 = clip(%52, a_min=0f, a_max=6f) /* ty=Tensor[(1, 12, 12, 48), float32] span=Clip_9:0:0 */;
  %54 = qnn.quantize(%53, 1f /* ty=float32 span=QuantizeLinear_10.model/block_4_expand_relu/Relu6:0_scale:0:0 */, 0 /* ty=int32 span=QuantizeLinear_10:0:0 */, out_dtype="int8", axis=3) /* ty=Tensor[(1, 12, 12, 48), int8] span=QuantizeLinear_10:0:0 */;
  %55 = @tvmgen_default_esp_main_12(%54, meta[relay.Constant][26] /* ty=Tensor[(3, 3, 48, 1), int8] */, meta[relay.Constant][27] /* ty=Tensor[(1, 1, 1, 48), int8] */) /* ty=Tensor[(1, 12, 12, 48), int8] */;
  %56 = qnn.dequantize(%55, 1f /* ty=float32 span=QLinearConv_14.model/block_4_depthwise_BN/FusedBatchNormV3:0_scale:0:0 */, 0 /* ty=int32 span=DequantizeLinear_10:0:0 */, out_dtype="float32", axis=3) /* ty=Tensor[(1, 12, 12, 48), float32] span=DequantizeLinear_10:0:0 */;
  %57 = clip(%56, a_min=0f, a_max=6f) /* ty=Tensor[(1, 12, 12, 48), float32] span=Clip_10:0:0 */;
  %58 = qnn.quantize(%57, 1f /* ty=float32 span=QuantizeLinear_11.model/block_4_depthwise_relu/Relu6:0_scale:0:0 */, 0 /* ty=int32 span=QuantizeLinear_11:0:0 */, out_dtype="int8", axis=3) /* ty=Tensor[(1, 12, 12, 48), int8] span=QuantizeLinear_11:0:0 */;
  %59 = @tvmgen_default_esp_main_13(%58, meta[relay.Constant][28] /* ty=Tensor[(8, 1, 1, 48), int8] */, meta[relay.Constant][29] /* ty=Tensor[(1, 1, 1, 8), int8] */) /* ty=Tensor[(1, 12, 12, 8), int8] */;
  %60 = qnn.dequantize(%50, 1f /* ty=float32 span=QLinearAdd_3:0:0 */, 0 /* ty=int32 span=QLinearAdd_3:0:0 */, out_dtype="float32", axis=2) /* ty=Tensor[(1, 12, 12, 8), float32] span=QLinearAdd_3:0:0 */;
  %61 = qnn.dequantize(%59, 1f /* ty=float32 span=QLinearAdd_3:0:0 */, 0 /* ty=int32 span=QLinearAdd_3:0:0 */, out_dtype="float32", axis=2) /* ty=Tensor[(1, 12, 12, 8), float32] span=QLinearAdd_3:0:0 */;
  %62 = add(%60, %61) /* ty=Tensor[(1, 12, 12, 8), float32] span=QLinearAdd_3:0:0 */;
  %63 = qnn.quantize(%62, 1f /* ty=float32 span=QLinearAdd_3:0:0 */, 0 /* ty=int32 span=QLinearAdd_3:0:0 */, out_dtype="int8", axis=2) /* ty=Tensor[(1, 12, 12, 8), int8] span=QLinearAdd_3:0:0 */;
  %64 = @tvmgen_default_esp_main_14(%63, meta[relay.Constant][30] /* ty=Tensor[(48, 1, 1, 8), int8] */, meta[relay.Constant][31] /* ty=Tensor[(1, 1, 1, 48), int8] */) /* ty=Tensor[(1, 12, 12, 48), int8] */;
  %65 = qnn.dequantize(%64, 1f /* ty=float32 span=QLinearConv_16.model/block_5_expand_BN/FusedBatchNormV3:0_scale:0:0 */, 0 /* ty=int32 span=DequantizeLinear_11:0:0 */, out_dtype="float32", axis=3) /* ty=Tensor[(1, 12, 12, 48), float32] span=DequantizeLinear_11:0:0 */;
  %66 = clip(%65, a_min=0f, a_max=6f) /* ty=Tensor[(1, 12, 12, 48), float32] span=Clip_11:0:0 */;
  %67 = qnn.quantize(%66, 1f /* ty=float32 span=QuantizeLinear_12.model/block_5_expand_relu/Relu6:0_scale:0:0 */, 0 /* ty=int32 span=QuantizeLinear_12:0:0 */, out_dtype="int8", axis=3) /* ty=Tensor[(1, 12, 12, 48), int8] span=QuantizeLinear_12:0:0 */;
  %68 = @tvmgen_default_esp_main_15(%67, meta[relay.Constant][32] /* ty=Tensor[(3, 3, 48, 1), int8] */, meta[relay.Constant][33] /* ty=Tensor[(1, 1, 1, 48), int8] */) /* ty=Tensor[(1, 12, 12, 48), int8] */;
  %69 = qnn.dequantize(%68, 1f /* ty=float32 span=QLinearConv_17.model/block_5_depthwise_BN/FusedBatchNormV3:0_scale:0:0 */, 0 /* ty=int32 span=DequantizeLinear_12:0:0 */, out_dtype="float32", axis=3) /* ty=Tensor[(1, 12, 12, 48), float32] span=DequantizeLinear_12:0:0 */;
  %70 = clip(%69, a_min=0f, a_max=6f) /* ty=Tensor[(1, 12, 12, 48), float32] span=Clip_12:0:0 */;
  %71 = qnn.quantize(%70, 1f /* ty=float32 span=QuantizeLinear_13.model/block_5_depthwise_relu/Relu6:0_scale:0:0 */, 0 /* ty=int32 span=QuantizeLinear_13:0:0 */, out_dtype="int8", axis=3) /* ty=Tensor[(1, 12, 12, 48), int8] span=QuantizeLinear_13:0:0 */;
  %72 = @tvmgen_default_esp_main_16(%71, meta[relay.Constant][34] /* ty=Tensor[(8, 1, 1, 48), int8] */, meta[relay.Constant][35] /* ty=Tensor[(1, 1, 1, 8), int8] */) /* ty=Tensor[(1, 12, 12, 8), int8] */;
  %73 = qnn.dequantize(%63, 1f /* ty=float32 span=QLinearAdd_4:0:0 */, 0 /* ty=int32 span=QLinearAdd_4:0:0 */, out_dtype="float32", axis=2) /* ty=Tensor[(1, 12, 12, 8), float32] span=QLinearAdd_4:0:0 */;
  %74 = qnn.dequantize(%72, 1f /* ty=float32 span=QLinearAdd_4:0:0 */, 0 /* ty=int32 span=QLinearAdd_4:0:0 */, out_dtype="float32", axis=2) /* ty=Tensor[(1, 12, 12, 8), float32] span=QLinearAdd_4:0:0 */;
  %75 = add(%73, %74) /* ty=Tensor[(1, 12, 12, 8), float32] span=QLinearAdd_4:0:0 */;
  %76 = qnn.quantize(%75, 1f /* ty=float32 span=QLinearAdd_4:0:0 */, 0 /* ty=int32 span=QLinearAdd_4:0:0 */, out_dtype="int8", axis=2) /* ty=Tensor[(1, 12, 12, 8), int8] span=QLinearAdd_4:0:0 */;
  %77 = @tvmgen_default_esp_main_17(%76, meta[relay.Constant][36] /* ty=Tensor[(48, 1, 1, 8), int8] */, meta[relay.Constant][37] /* ty=Tensor[(1, 1, 1, 48), int8] */) /* ty=Tensor[(1, 12, 12, 48), int8] */;
  %78 = qnn.dequantize(%77, 1f /* ty=float32 span=QLinearConv_19.model/block_6_expand_BN/FusedBatchNormV3:0_scale:0:0 */, 0 /* ty=int32 span=DequantizeLinear_13:0:0 */, out_dtype="float32", axis=3) /* ty=Tensor[(1, 12, 12, 48), float32] span=DequantizeLinear_13:0:0 */;
  %79 = clip(%78, a_min=0f, a_max=6f) /* ty=Tensor[(1, 12, 12, 48), float32] span=Clip_13:0:0 */;
  %80 = nn.pad(%79, 0f /* ty=float32 span=Pad_3:0:0 */, pad_width=[[0i64, 0i64], [0i64, 1i64], [0i64, 1i64], [0i64, 0i64]]) /* ty=Tensor[(1, 13, 13, 48), float32] span=Pad_3:0:0 */;
  %81 = qnn.quantize(%80, 1f /* ty=float32 span=QuantizeLinear_14.model/block_6_pad/Pad:0_scale:0:0 */, 0 /* ty=int32 span=QuantizeLinear_14:0:0 */, out_dtype="int8", axis=3) /* ty=Tensor[(1, 13, 13, 48), int8] span=QuantizeLinear_14:0:0 */;
  %82 = @tvmgen_default_esp_main_18(%81, meta[relay.Constant][38] /* ty=Tensor[(3, 3, 48, 1), int8] */, meta[relay.Constant][39] /* ty=Tensor[(1, 1, 1, 48), int8] */) /* ty=Tensor[(1, 6, 6, 48), int8] */;
  %83 = qnn.dequantize(%82, 1f /* ty=float32 span=QLinearConv_20.model/block_6_depthwise_BN/FusedBatchNormV3:0_scale:0:0 */, 0 /* ty=int32 span=DequantizeLinear_14:0:0 */, out_dtype="float32", axis=3) /* ty=Tensor[(1, 6, 6, 48), float32] span=DequantizeLinear_14:0:0 */;
  %84 = clip(%83, a_min=0f, a_max=6f) /* ty=Tensor[(1, 6, 6, 48), float32] span=Clip_14:0:0 */;
  %85 = qnn.quantize(%84, 1f /* ty=float32 span=QuantizeLinear_15.model/block_6_depthwise_relu/Relu6:0_scale:0:0 */, 0 /* ty=int32 span=QuantizeLinear_15:0:0 */, out_dtype="int8", axis=3) /* ty=Tensor[(1, 6, 6, 48), int8] span=QuantizeLinear_15:0:0 */;
  %86 = @tvmgen_default_esp_main_19(%85, meta[relay.Constant][40] /* ty=Tensor[(8, 1, 1, 48), int8] */, meta[relay.Constant][41] /* ty=Tensor[(1, 1, 1, 8), int8] */) /* ty=Tensor[(1, 6, 6, 8), int8] */;
  %87 = @tvmgen_default_esp_main_20(%86, meta[relay.Constant][42] /* ty=Tensor[(48, 1, 1, 8), int8] */, meta[relay.Constant][43] /* ty=Tensor[(1, 1, 1, 48), int8] */) /* ty=Tensor[(1, 6, 6, 48), int8] */;
  %88 = qnn.dequantize(%87, 1f /* ty=float32 span=QLinearConv_22.model/block_7_expand_BN/FusedBatchNormV3:0_scale:0:0 */, 0 /* ty=int32 span=DequantizeLinear_15:0:0 */, out_dtype="float32", axis=3) /* ty=Tensor[(1, 6, 6, 48), float32] span=DequantizeLinear_15:0:0 */;
  %89 = clip(%88, a_min=0f, a_max=6f) /* ty=Tensor[(1, 6, 6, 48), float32] span=Clip_15:0:0 */;
  %90 = qnn.quantize(%89, 1f /* ty=float32 span=QuantizeLinear_16.model/block_7_expand_relu/Relu6:0_scale:0:0 */, 0 /* ty=int32 span=QuantizeLinear_16:0:0 */, out_dtype="int8", axis=3) /* ty=Tensor[(1, 6, 6, 48), int8] span=QuantizeLinear_16:0:0 */;
  %91 = @tvmgen_default_esp_main_21(%90, meta[relay.Constant][44] /* ty=Tensor[(3, 3, 48, 1), int8] */, meta[relay.Constant][45] /* ty=Tensor[(1, 1, 1, 48), int8] */) /* ty=Tensor[(1, 6, 6, 48), int8] */;
  %92 = qnn.dequantize(%91, 1f /* ty=float32 span=QLinearConv_23.model/block_7_depthwise_BN/FusedBatchNormV3:0_scale:0:0 */, 0 /* ty=int32 span=DequantizeLinear_16:0:0 */, out_dtype="float32", axis=3) /* ty=Tensor[(1, 6, 6, 48), float32] span=DequantizeLinear_16:0:0 */;
  %93 = clip(%92, a_min=0f, a_max=6f) /* ty=Tensor[(1, 6, 6, 48), float32] span=Clip_16:0:0 */;
  %94 = qnn.quantize(%93, 1f /* ty=float32 span=QuantizeLinear_17.model/block_7_depthwise_relu/Relu6:0_scale:0:0 */, 0 /* ty=int32 span=QuantizeLinear_17:0:0 */, out_dtype="int8", axis=3) /* ty=Tensor[(1, 6, 6, 48), int8] span=QuantizeLinear_17:0:0 */;
  %95 = @tvmgen_default_esp_main_22(%94, meta[relay.Constant][46] /* ty=Tensor[(8, 1, 1, 48), int8] */, meta[relay.Constant][47] /* ty=Tensor[(1, 1, 1, 8), int8] */) /* ty=Tensor[(1, 6, 6, 8), int8] */;
  %96 = qnn.dequantize(%86, 1f /* ty=float32 span=QLinearAdd_5:0:0 */, 0 /* ty=int32 span=QLinearAdd_5:0:0 */, out_dtype="float32", axis=2) /* ty=Tensor[(1, 6, 6, 8), float32] span=QLinearAdd_5:0:0 */;
  %97 = qnn.dequantize(%95, 1f /* ty=float32 span=QLinearAdd_5:0:0 */, 0 /* ty=int32 span=QLinearAdd_5:0:0 */, out_dtype="float32", axis=2) /* ty=Tensor[(1, 6, 6, 8), float32] span=QLinearAdd_5:0:0 */;
  %98 = add(%96, %97) /* ty=Tensor[(1, 6, 6, 8), float32] span=QLinearAdd_5:0:0 */;
  %99 = qnn.quantize(%98, 1f /* ty=float32 span=QLinearAdd_5:0:0 */, 0 /* ty=int32 span=QLinearAdd_5:0:0 */, out_dtype="int8", axis=2) /* ty=Tensor[(1, 6, 6, 8), int8] span=QLinearAdd_5:0:0 */;
  %100 = @tvmgen_default_esp_main_23(%99, meta[relay.Constant][48] /* ty=Tensor[(48, 1, 1, 8), int8] */, meta[relay.Constant][49] /* ty=Tensor[(1, 1, 1, 48), int8] */) /* ty=Tensor[(1, 6, 6, 48), int8] */;
  %101 = qnn.dequantize(%100, 1f /* ty=float32 span=QLinearConv_25.model/block_8_expand_BN/FusedBatchNormV3:0_scale:0:0 */, 0 /* ty=int32 span=DequantizeLinear_17:0:0 */, out_dtype="float32", axis=3) /* ty=Tensor[(1, 6, 6, 48), float32] span=DequantizeLinear_17:0:0 */;
  %102 = clip(%101, a_min=0f, a_max=6f) /* ty=Tensor[(1, 6, 6, 48), float32] span=Clip_17:0:0 */;
  %103 = qnn.quantize(%102, 1f /* ty=float32 span=QuantizeLinear_18.model/block_8_expand_relu/Relu6:0_scale:0:0 */, 0 /* ty=int32 span=QuantizeLinear_18:0:0 */, out_dtype="int8", axis=3) /* ty=Tensor[(1, 6, 6, 48), int8] span=QuantizeLinear_18:0:0 */;
  %104 = @tvmgen_default_esp_main_24(%103, meta[relay.Constant][50] /* ty=Tensor[(3, 3, 48, 1), int8] */, meta[relay.Constant][51] /* ty=Tensor[(1, 1, 1, 48), int8] */) /* ty=Tensor[(1, 6, 6, 48), int8] */;
  %105 = qnn.dequantize(%104, 1f /* ty=float32 span=QLinearConv_26.model/block_8_depthwise_BN/FusedBatchNormV3:0_scale:0:0 */, 0 /* ty=int32 span=DequantizeLinear_18:0:0 */, out_dtype="float32", axis=3) /* ty=Tensor[(1, 6, 6, 48), float32] span=DequantizeLinear_18:0:0 */;
  %106 = clip(%105, a_min=0f, a_max=6f) /* ty=Tensor[(1, 6, 6, 48), float32] span=Clip_18:0:0 */;
  %107 = qnn.quantize(%106, 1f /* ty=float32 span=QuantizeLinear_19.model/block_8_depthwise_relu/Relu6:0_scale:0:0 */, 0 /* ty=int32 span=QuantizeLinear_19:0:0 */, out_dtype="int8", axis=3) /* ty=Tensor[(1, 6, 6, 48), int8] span=QuantizeLinear_19:0:0 */;
  %108 = @tvmgen_default_esp_main_25(%107, meta[relay.Constant][52] /* ty=Tensor[(8, 1, 1, 48), int8] */, meta[relay.Constant][53] /* ty=Tensor[(1, 1, 1, 8), int8] */) /* ty=Tensor[(1, 6, 6, 8), int8] */;
  %109 = qnn.dequantize(%99, 1f /* ty=float32 span=QLinearAdd_6:0:0 */, 0 /* ty=int32 span=QLinearAdd_6:0:0 */, out_dtype="float32", axis=2) /* ty=Tensor[(1, 6, 6, 8), float32] span=QLinearAdd_6:0:0 */;
  %110 = qnn.dequantize(%108, 1f /* ty=float32 span=QLinearAdd_6:0:0 */, 0 /* ty=int32 span=QLinearAdd_6:0:0 */, out_dtype="float32", axis=2) /* ty=Tensor[(1, 6, 6, 8), float32] span=QLinearAdd_6:0:0 */;
  %111 = add(%109, %110) /* ty=Tensor[(1, 6, 6, 8), float32] span=QLinearAdd_6:0:0 */;
  %112 = qnn.quantize(%111, 1f /* ty=float32 span=QLinearAdd_6:0:0 */, 0 /* ty=int32 span=QLinearAdd_6:0:0 */, out_dtype="int8", axis=2) /* ty=Tensor[(1, 6, 6, 8), int8] span=QLinearAdd_6:0:0 */;
  %113 = @tvmgen_default_esp_main_26(%112, meta[relay.Constant][54] /* ty=Tensor[(48, 1, 1, 8), int8] */, meta[relay.Constant][55] /* ty=Tensor[(1, 1, 1, 48), int8] */) /* ty=Tensor[(1, 6, 6, 48), int8] */;
  %114 = qnn.dequantize(%113, 1f /* ty=float32 span=QLinearConv_28.model/block_9_expand_BN/FusedBatchNormV3:0_scale:0:0 */, 0 /* ty=int32 span=DequantizeLinear_19:0:0 */, out_dtype="float32", axis=3) /* ty=Tensor[(1, 6, 6, 48), float32] span=DequantizeLinear_19:0:0 */;
  %115 = clip(%114, a_min=0f, a_max=6f) /* ty=Tensor[(1, 6, 6, 48), float32] span=Clip_19:0:0 */;
  %116 = qnn.quantize(%115, 1f /* ty=float32 span=QuantizeLinear_20.model/block_9_expand_relu/Relu6:0_scale:0:0 */, 0 /* ty=int32 span=QuantizeLinear_20:0:0 */, out_dtype="int8", axis=3) /* ty=Tensor[(1, 6, 6, 48), int8] span=QuantizeLinear_20:0:0 */;
  %117 = @tvmgen_default_esp_main_27(%116, meta[relay.Constant][56] /* ty=Tensor[(3, 3, 48, 1), int8] */, meta[relay.Constant][57] /* ty=Tensor[(1, 1, 1, 48), int8] */) /* ty=Tensor[(1, 6, 6, 48), int8] */;
  %118 = qnn.dequantize(%117, 1f /* ty=float32 span=QLinearConv_29.model/block_9_depthwise_BN/FusedBatchNormV3:0_scale:0:0 */, 0 /* ty=int32 span=DequantizeLinear_20:0:0 */, out_dtype="float32", axis=3) /* ty=Tensor[(1, 6, 6, 48), float32] span=DequantizeLinear_20:0:0 */;
  %119 = clip(%118, a_min=0f, a_max=6f) /* ty=Tensor[(1, 6, 6, 48), float32] span=Clip_20:0:0 */;
  %120 = qnn.quantize(%119, 1f /* ty=float32 span=QuantizeLinear_21.model/block_9_depthwise_relu/Relu6:0_scale:0:0 */, 0 /* ty=int32 span=QuantizeLinear_21:0:0 */, out_dtype="int8", axis=3) /* ty=Tensor[(1, 6, 6, 48), int8] span=QuantizeLinear_21:0:0 */;
  %121 = @tvmgen_default_esp_main_28(%120, meta[relay.Constant][58] /* ty=Tensor[(8, 1, 1, 48), int8] */, meta[relay.Constant][59] /* ty=Tensor[(1, 1, 1, 8), int8] */) /* ty=Tensor[(1, 6, 6, 8), int8] */;
  %122 = qnn.dequantize(%112, 1f /* ty=float32 span=QLinearAdd_7:0:0 */, 0 /* ty=int32 span=QLinearAdd_7:0:0 */, out_dtype="float32", axis=2) /* ty=Tensor[(1, 6, 6, 8), float32] span=QLinearAdd_7:0:0 */;
  %123 = qnn.dequantize(%121, 1f /* ty=float32 span=QLinearAdd_7:0:0 */, 0 /* ty=int32 span=QLinearAdd_7:0:0 */, out_dtype="float32", axis=2) /* ty=Tensor[(1, 6, 6, 8), float32] span=QLinearAdd_7:0:0 */;
  %124 = add(%122, %123) /* ty=Tensor[(1, 6, 6, 8), float32] span=QLinearAdd_7:0:0 */;
  %125 = qnn.quantize(%124, 1f /* ty=float32 span=QLinearAdd_7:0:0 */, 0 /* ty=int32 span=QLinearAdd_7:0:0 */, out_dtype="int8", axis=2) /* ty=Tensor[(1, 6, 6, 8), int8] span=QLinearAdd_7:0:0 */;
  %126 = @tvmgen_default_esp_main_29(%125, meta[relay.Constant][60] /* ty=Tensor[(48, 1, 1, 8), int8] */, meta[relay.Constant][61] /* ty=Tensor[(1, 1, 1, 48), int8] */) /* ty=Tensor[(1, 6, 6, 48), int8] */;
  %127 = qnn.dequantize(%126, 1f /* ty=float32 span=QLinearConv_31.model/block_10_expand_BN/FusedBatchNormV3:0_scale:0:0 */, 0 /* ty=int32 span=DequantizeLinear_21:0:0 */, out_dtype="float32", axis=3) /* ty=Tensor[(1, 6, 6, 48), float32] span=DequantizeLinear_21:0:0 */;
  %128 = clip(%127, a_min=0f, a_max=6f) /* ty=Tensor[(1, 6, 6, 48), float32] span=Clip_21:0:0 */;
  %129 = qnn.quantize(%128, 1f /* ty=float32 span=QuantizeLinear_22.model/block_10_expand_relu/Relu6:0_scale:0:0 */, 0 /* ty=int32 span=QuantizeLinear_22:0:0 */, out_dtype="int8", axis=3) /* ty=Tensor[(1, 6, 6, 48), int8] span=QuantizeLinear_22:0:0 */;
  %130 = @tvmgen_default_esp_main_30(%129, meta[relay.Constant][62] /* ty=Tensor[(3, 3, 48, 1), int8] */, meta[relay.Constant][63] /* ty=Tensor[(1, 1, 1, 48), int8] */) /* ty=Tensor[(1, 6, 6, 48), int8] */;
  %131 = qnn.dequantize(%130, 1f /* ty=float32 span=QLinearConv_32.model/block_10_depthwise_BN/FusedBatchNormV3:0_scale:0:0 */, 0 /* ty=int32 span=DequantizeLinear_22:0:0 */, out_dtype="float32", axis=3) /* ty=Tensor[(1, 6, 6, 48), float32] span=DequantizeLinear_22:0:0 */;
  %132 = clip(%131, a_min=0f, a_max=6f) /* ty=Tensor[(1, 6, 6, 48), float32] span=Clip_22:0:0 */;
  %133 = qnn.quantize(%132, 1f /* ty=float32 span=QuantizeLinear_23.model/block_10_depthwise_relu/Relu6:0_scale:0:0 */, 0 /* ty=int32 span=QuantizeLinear_23:0:0 */, out_dtype="int8", axis=3) /* ty=Tensor[(1, 6, 6, 48), int8] span=QuantizeLinear_23:0:0 */;
  %134 = @tvmgen_default_esp_main_31(%133, meta[relay.Constant][64] /* ty=Tensor[(8, 1, 1, 48), int8] */, meta[relay.Constant][65] /* ty=Tensor[(1, 1, 1, 8), int8] */) /* ty=Tensor[(1, 6, 6, 8), int8] */;
  %135 = qnn.dequantize(%125, 1f /* ty=float32 span=QLinearAdd_8:0:0 */, 0 /* ty=int32 span=QLinearAdd_8:0:0 */, out_dtype="float32", axis=2) /* ty=Tensor[(1, 6, 6, 8), float32] span=QLinearAdd_8:0:0 */;
  %136 = qnn.dequantize(%134, 1f /* ty=float32 span=QLinearAdd_8:0:0 */, 0 /* ty=int32 span=QLinearAdd_8:0:0 */, out_dtype="float32", axis=2) /* ty=Tensor[(1, 6, 6, 8), float32] span=QLinearAdd_8:0:0 */;
  %137 = add(%135, %136) /* ty=Tensor[(1, 6, 6, 8), float32] span=QLinearAdd_8:0:0 */;
  %138 = qnn.quantize(%137, 1f /* ty=float32 span=QLinearAdd_8:0:0 */, 0 /* ty=int32 span=QLinearAdd_8:0:0 */, out_dtype="int8", axis=2) /* ty=Tensor[(1, 6, 6, 8), int8] span=QLinearAdd_8:0:0 */;
  %139 = @tvmgen_default_esp_main_32(%138, meta[relay.Constant][66] /* ty=Tensor[(48, 1, 1, 8), int8] */, meta[relay.Constant][67] /* ty=Tensor[(1, 1, 1, 48), int8] */) /* ty=Tensor[(1, 6, 6, 48), int8] */;
  %140 = qnn.dequantize(%139, 1f /* ty=float32 span=QLinearConv_34.model/block_11_expand_BN/FusedBatchNormV3:0_scale:0:0 */, 0 /* ty=int32 span=DequantizeLinear_23:0:0 */, out_dtype="float32", axis=3) /* ty=Tensor[(1, 6, 6, 48), float32] span=DequantizeLinear_23:0:0 */;
  %141 = clip(%140, a_min=0f, a_max=6f) /* ty=Tensor[(1, 6, 6, 48), float32] span=Clip_23:0:0 */;
  %142 = qnn.quantize(%141, 1f /* ty=float32 span=QuantizeLinear_24.model/block_11_expand_relu/Relu6:0_scale:0:0 */, 0 /* ty=int32 span=QuantizeLinear_24:0:0 */, out_dtype="int8", axis=3) /* ty=Tensor[(1, 6, 6, 48), int8] span=QuantizeLinear_24:0:0 */;
  %143 = @tvmgen_default_esp_main_33(%142, meta[relay.Constant][68] /* ty=Tensor[(3, 3, 48, 1), int8] */, meta[relay.Constant][69] /* ty=Tensor[(1, 1, 1, 48), int8] */) /* ty=Tensor[(1, 6, 6, 48), int8] */;
  %144 = qnn.dequantize(%143, 1f /* ty=float32 span=QLinearConv_35.model/block_11_depthwise_BN/FusedBatchNormV3:0_scale:0:0 */, 0 /* ty=int32 span=DequantizeLinear_24:0:0 */, out_dtype="float32", axis=3) /* ty=Tensor[(1, 6, 6, 48), float32] span=DequantizeLinear_24:0:0 */;
  %145 = clip(%144, a_min=0f, a_max=6f) /* ty=Tensor[(1, 6, 6, 48), float32] span=Clip_24:0:0 */;
  %146 = qnn.quantize(%145, 1f /* ty=float32 span=QuantizeLinear_25.model/block_11_depthwise_relu/Relu6:0_scale:0:0 */, 0 /* ty=int32 span=QuantizeLinear_25:0:0 */, out_dtype="int8", axis=3) /* ty=Tensor[(1, 6, 6, 48), int8] span=QuantizeLinear_25:0:0 */;
  %147 = @tvmgen_default_esp_main_34(%146, meta[relay.Constant][70] /* ty=Tensor[(8, 1, 1, 48), int8] */, meta[relay.Constant][71] /* ty=Tensor[(1, 1, 1, 8), int8] */) /* ty=Tensor[(1, 6, 6, 8), int8] */;
  %148 = qnn.dequantize(%138, 1f /* ty=float32 span=QLinearAdd_9:0:0 */, 0 /* ty=int32 span=QLinearAdd_9:0:0 */, out_dtype="float32", axis=2) /* ty=Tensor[(1, 6, 6, 8), float32] span=QLinearAdd_9:0:0 */;
  %149 = qnn.dequantize(%147, 1f /* ty=float32 span=QLinearAdd_9:0:0 */, 0 /* ty=int32 span=QLinearAdd_9:0:0 */, out_dtype="float32", axis=2) /* ty=Tensor[(1, 6, 6, 8), float32] span=QLinearAdd_9:0:0 */;
  %150 = add(%148, %149) /* ty=Tensor[(1, 6, 6, 8), float32] span=QLinearAdd_9:0:0 */;
  %151 = qnn.quantize(%150, 1f /* ty=float32 span=QLinearAdd_9:0:0 */, 0 /* ty=int32 span=QLinearAdd_9:0:0 */, out_dtype="int8", axis=2) /* ty=Tensor[(1, 6, 6, 8), int8] span=QLinearAdd_9:0:0 */;
  %152 = @tvmgen_default_esp_main_35(%151, meta[relay.Constant][72] /* ty=Tensor[(48, 1, 1, 8), int8] */, meta[relay.Constant][73] /* ty=Tensor[(1, 1, 1, 48), int8] */) /* ty=Tensor[(1, 6, 6, 48), int8] */;
  %153 = qnn.dequantize(%152, 1f /* ty=float32 span=QLinearConv_37.model/block_12_expand_BN/FusedBatchNormV3:0_scale:0:0 */, 0 /* ty=int32 span=DequantizeLinear_25:0:0 */, out_dtype="float32", axis=3) /* ty=Tensor[(1, 6, 6, 48), float32] span=DequantizeLinear_25:0:0 */;
  %154 = clip(%153, a_min=0f, a_max=6f) /* ty=Tensor[(1, 6, 6, 48), float32] span=Clip_25:0:0 */;
  %155 = qnn.quantize(%154, 1f /* ty=float32 span=QuantizeLinear_26.model/block_12_expand_relu/Relu6:0_scale:0:0 */, 0 /* ty=int32 span=QuantizeLinear_26:0:0 */, out_dtype="int8", axis=3) /* ty=Tensor[(1, 6, 6, 48), int8] span=QuantizeLinear_26:0:0 */;
  %156 = @tvmgen_default_esp_main_36(%155, meta[relay.Constant][74] /* ty=Tensor[(3, 3, 48, 1), int8] */, meta[relay.Constant][75] /* ty=Tensor[(1, 1, 1, 48), int8] */) /* ty=Tensor[(1, 6, 6, 48), int8] */;
  %157 = qnn.dequantize(%156, 1f /* ty=float32 span=QLinearConv_38.model/block_12_depthwise_BN/FusedBatchNormV3:0_scale:0:0 */, 0 /* ty=int32 span=DequantizeLinear_26:0:0 */, out_dtype="float32", axis=3) /* ty=Tensor[(1, 6, 6, 48), float32] span=DequantizeLinear_26:0:0 */;
  %158 = clip(%157, a_min=0f, a_max=6f) /* ty=Tensor[(1, 6, 6, 48), float32] span=Clip_26:0:0 */;
  %159 = qnn.quantize(%158, 1f /* ty=float32 span=QuantizeLinear_27.model/block_12_depthwise_relu/Relu6:0_scale:0:0 */, 0 /* ty=int32 span=QuantizeLinear_27:0:0 */, out_dtype="int8", axis=3) /* ty=Tensor[(1, 6, 6, 48), int8] span=QuantizeLinear_27:0:0 */;
  %160 = @tvmgen_default_esp_main_37(%159, meta[relay.Constant][76] /* ty=Tensor[(8, 1, 1, 48), int8] */, meta[relay.Constant][77] /* ty=Tensor[(1, 1, 1, 8), int8] */) /* ty=Tensor[(1, 6, 6, 8), int8] */;
  %161 = qnn.dequantize(%151, 1f /* ty=float32 span=QLinearAdd_10:0:0 */, 0 /* ty=int32 span=QLinearAdd_10:0:0 */, out_dtype="float32", axis=2) /* ty=Tensor[(1, 6, 6, 8), float32] span=QLinearAdd_10:0:0 */;
  %162 = qnn.dequantize(%160, 1f /* ty=float32 span=QLinearAdd_10:0:0 */, 0 /* ty=int32 span=QLinearAdd_10:0:0 */, out_dtype="float32", axis=2) /* ty=Tensor[(1, 6, 6, 8), float32] span=QLinearAdd_10:0:0 */;
  %163 = add(%161, %162) /* ty=Tensor[(1, 6, 6, 8), float32] span=QLinearAdd_10:0:0 */;
  %164 = qnn.quantize(%163, 1f /* ty=float32 span=QLinearAdd_10:0:0 */, 0 /* ty=int32 span=QLinearAdd_10:0:0 */, out_dtype="int8", axis=2) /* ty=Tensor[(1, 6, 6, 8), int8] span=QLinearAdd_10:0:0 */;
  %165 = @tvmgen_default_esp_main_38(%164, meta[relay.Constant][78] /* ty=Tensor[(48, 1, 1, 8), int8] */, meta[relay.Constant][79] /* ty=Tensor[(1, 1, 1, 48), int8] */) /* ty=Tensor[(1, 6, 6, 48), int8] */;
  %166 = qnn.dequantize(%165, 1f /* ty=float32 span=QLinearConv_40.model/block_13_expand_BN/FusedBatchNormV3:0_scale:0:0 */, 0 /* ty=int32 span=DequantizeLinear_27:0:0 */, out_dtype="float32", axis=3) /* ty=Tensor[(1, 6, 6, 48), float32] span=DequantizeLinear_27:0:0 */;
  %167 = clip(%166, a_min=0f, a_max=6f) /* ty=Tensor[(1, 6, 6, 48), float32] span=Clip_27:0:0 */;
  %168 = nn.pad(%167, 0f /* ty=float32 span=Pad_4:0:0 */, pad_width=[[0i64, 0i64], [0i64, 1i64], [0i64, 1i64], [0i64, 0i64]]) /* ty=Tensor[(1, 7, 7, 48), float32] span=Pad_4:0:0 */;
  %169 = qnn.quantize(%168, 1f /* ty=float32 span=QuantizeLinear_28.model/block_13_pad/Pad:0_scale:0:0 */, 0 /* ty=int32 span=QuantizeLinear_28:0:0 */, out_dtype="int8", axis=3) /* ty=Tensor[(1, 7, 7, 48), int8] span=QuantizeLinear_28:0:0 */;
  %170 = @tvmgen_default_esp_main_39(%169, meta[relay.Constant][80] /* ty=Tensor[(3, 3, 48, 1), int8] */, meta[relay.Constant][81] /* ty=Tensor[(1, 1, 1, 48), int8] */) /* ty=Tensor[(1, 3, 3, 48), int8] */;
  %171 = qnn.dequantize(%170, 1f /* ty=float32 span=QLinearConv_41.model/block_13_depthwise_BN/FusedBatchNormV3:0_scale:0:0 */, 0 /* ty=int32 span=DequantizeLinear_28:0:0 */, out_dtype="float32", axis=3) /* ty=Tensor[(1, 3, 3, 48), float32] span=DequantizeLinear_28:0:0 */;
  %172 = clip(%171, a_min=0f, a_max=6f) /* ty=Tensor[(1, 3, 3, 48), float32] span=Clip_28:0:0 */;
  %173 = qnn.quantize(%172, 1f /* ty=float32 span=QuantizeLinear_29.model/block_13_depthwise_relu/Relu6:0_scale:0:0 */, 0 /* ty=int32 span=QuantizeLinear_29:0:0 */, out_dtype="int8", axis=3) /* ty=Tensor[(1, 3, 3, 48), int8] span=QuantizeLinear_29:0:0 */;
  %174 = @tvmgen_default_esp_main_40(%173, meta[relay.Constant][82] /* ty=Tensor[(8, 1, 1, 48), int8] */, meta[relay.Constant][83] /* ty=Tensor[(1, 1, 1, 8), int8] */) /* ty=Tensor[(1, 3, 3, 8), int8] */;
  %175 = @tvmgen_default_esp_main_41(%174, meta[relay.Constant][84] /* ty=Tensor[(48, 1, 1, 8), int8] */, meta[relay.Constant][85] /* ty=Tensor[(1, 1, 1, 48), int8] */) /* ty=Tensor[(1, 3, 3, 48), int8] */;
  %176 = qnn.dequantize(%175, 1f /* ty=float32 span=QLinearConv_43.model/block_14_expand_BN/FusedBatchNormV3:0_scale:0:0 */, 0 /* ty=int32 span=DequantizeLinear_29:0:0 */, out_dtype="float32", axis=3) /* ty=Tensor[(1, 3, 3, 48), float32] span=DequantizeLinear_29:0:0 */;
  %177 = clip(%176, a_min=0f, a_max=6f) /* ty=Tensor[(1, 3, 3, 48), float32] span=Clip_29:0:0 */;
  %178 = qnn.quantize(%177, 1f /* ty=float32 span=QuantizeLinear_30.model/block_14_expand_relu/Relu6:0_scale:0:0 */, 0 /* ty=int32 span=QuantizeLinear_30:0:0 */, out_dtype="int8", axis=3) /* ty=Tensor[(1, 3, 3, 48), int8] span=QuantizeLinear_30:0:0 */;
  %179 = @tvmgen_default_esp_main_42(%178, meta[relay.Constant][86] /* ty=Tensor[(3, 3, 48, 1), int8] */, meta[relay.Constant][87] /* ty=Tensor[(1, 1, 1, 48), int8] */) /* ty=Tensor[(1, 3, 3, 48), int8] */;
  %180 = qnn.dequantize(%179, 1f /* ty=float32 span=QLinearConv_44.model/block_14_depthwise_BN/FusedBatchNormV3:0_scale:0:0 */, 0 /* ty=int32 span=DequantizeLinear_30:0:0 */, out_dtype="float32", axis=3) /* ty=Tensor[(1, 3, 3, 48), float32] span=DequantizeLinear_30:0:0 */;
  %181 = clip(%180, a_min=0f, a_max=6f) /* ty=Tensor[(1, 3, 3, 48), float32] span=Clip_30:0:0 */;
  %182 = qnn.quantize(%181, 1f /* ty=float32 span=QuantizeLinear_31.model/block_14_depthwise_relu/Relu6:0_scale:0:0 */, 0 /* ty=int32 span=QuantizeLinear_31:0:0 */, out_dtype="int8", axis=3) /* ty=Tensor[(1, 3, 3, 48), int8] span=QuantizeLinear_31:0:0 */;
  %183 = @tvmgen_default_esp_main_43(%182, meta[relay.Constant][88] /* ty=Tensor[(8, 1, 1, 48), int8] */, meta[relay.Constant][89] /* ty=Tensor[(1, 1, 1, 8), int8] */) /* ty=Tensor[(1, 3, 3, 8), int8] */;
  %184 = qnn.dequantize(%174, 1f /* ty=float32 span=QLinearAdd_11:0:0 */, 0 /* ty=int32 span=QLinearAdd_11:0:0 */, out_dtype="float32", axis=2) /* ty=Tensor[(1, 3, 3, 8), float32] span=QLinearAdd_11:0:0 */;
  %185 = qnn.dequantize(%183, 1f /* ty=float32 span=QLinearAdd_11:0:0 */, 0 /* ty=int32 span=QLinearAdd_11:0:0 */, out_dtype="float32", axis=2) /* ty=Tensor[(1, 3, 3, 8), float32] span=QLinearAdd_11:0:0 */;
  %186 = add(%184, %185) /* ty=Tensor[(1, 3, 3, 8), float32] span=QLinearAdd_11:0:0 */;
  %187 = qnn.quantize(%186, 1f /* ty=float32 span=QLinearAdd_11:0:0 */, 0 /* ty=int32 span=QLinearAdd_11:0:0 */, out_dtype="int8", axis=2) /* ty=Tensor[(1, 3, 3, 8), int8] span=QLinearAdd_11:0:0 */;
  %188 = @tvmgen_default_esp_main_44(%187, meta[relay.Constant][90] /* ty=Tensor[(48, 1, 1, 8), int8] */, meta[relay.Constant][91] /* ty=Tensor[(1, 1, 1, 48), int8] */) /* ty=Tensor[(1, 3, 3, 48), int8] */;
  %189 = qnn.dequantize(%188, 1f /* ty=float32 span=QLinearConv_46.model/block_15_expand_BN/FusedBatchNormV3:0_scale:0:0 */, 0 /* ty=int32 span=DequantizeLinear_31:0:0 */, out_dtype="float32", axis=3) /* ty=Tensor[(1, 3, 3, 48), float32] span=DequantizeLinear_31:0:0 */;
  %190 = clip(%189, a_min=0f, a_max=6f) /* ty=Tensor[(1, 3, 3, 48), float32] span=Clip_31:0:0 */;
  %191 = qnn.quantize(%190, 1f /* ty=float32 span=QuantizeLinear_32.model/block_15_expand_relu/Relu6:0_scale:0:0 */, 0 /* ty=int32 span=QuantizeLinear_32:0:0 */, out_dtype="int8", axis=3) /* ty=Tensor[(1, 3, 3, 48), int8] span=QuantizeLinear_32:0:0 */;
  %192 = @tvmgen_default_esp_main_45(%191, meta[relay.Constant][92] /* ty=Tensor[(3, 3, 48, 1), int8] */, meta[relay.Constant][93] /* ty=Tensor[(1, 1, 1, 48), int8] */) /* ty=Tensor[(1, 3, 3, 48), int8] */;
  %193 = qnn.dequantize(%192, 1f /* ty=float32 span=QLinearConv_47.model/block_15_depthwise_BN/FusedBatchNormV3:0_scale:0:0 */, 0 /* ty=int32 span=DequantizeLinear_32:0:0 */, out_dtype="float32", axis=3) /* ty=Tensor[(1, 3, 3, 48), float32] span=DequantizeLinear_32:0:0 */;
  %194 = clip(%193, a_min=0f, a_max=6f) /* ty=Tensor[(1, 3, 3, 48), float32] span=Clip_32:0:0 */;
  %195 = qnn.quantize(%194, 1f /* ty=float32 span=QuantizeLinear_33.model/block_15_depthwise_relu/Relu6:0_scale:0:0 */, 0 /* ty=int32 span=QuantizeLinear_33:0:0 */, out_dtype="int8", axis=3) /* ty=Tensor[(1, 3, 3, 48), int8] span=QuantizeLinear_33:0:0 */;
  %196 = @tvmgen_default_esp_main_46(%195, meta[relay.Constant][94] /* ty=Tensor[(8, 1, 1, 48), int8] */, meta[relay.Constant][95] /* ty=Tensor[(1, 1, 1, 8), int8] */) /* ty=Tensor[(1, 3, 3, 8), int8] */;
  %197 = qnn.dequantize(%187, 1f /* ty=float32 span=QLinearAdd_12:0:0 */, 0 /* ty=int32 span=QLinearAdd_12:0:0 */, out_dtype="float32", axis=2) /* ty=Tensor[(1, 3, 3, 8), float32] span=QLinearAdd_12:0:0 */;
  %198 = qnn.dequantize(%196, 1f /* ty=float32 span=QLinearAdd_12:0:0 */, 0 /* ty=int32 span=QLinearAdd_12:0:0 */, out_dtype="float32", axis=2) /* ty=Tensor[(1, 3, 3, 8), float32] span=QLinearAdd_12:0:0 */;
  %199 = add(%197, %198) /* ty=Tensor[(1, 3, 3, 8), float32] span=QLinearAdd_12:0:0 */;
  %200 = qnn.quantize(%199, 1f /* ty=float32 span=QLinearAdd_12:0:0 */, 0 /* ty=int32 span=QLinearAdd_12:0:0 */, out_dtype="int8", axis=2) /* ty=Tensor[(1, 3, 3, 8), int8] span=QLinearAdd_12:0:0 */;
  %201 = @tvmgen_default_esp_main_47(%200, meta[relay.Constant][96] /* ty=Tensor[(48, 1, 1, 8), int8] */, meta[relay.Constant][97] /* ty=Tensor[(1, 1, 1, 48), int8] */) /* ty=Tensor[(1, 3, 3, 48), int8] */;
  %202 = qnn.dequantize(%201, 1f /* ty=float32 span=QLinearConv_49.model/block_16_expand_BN/FusedBatchNormV3:0_scale:0:0 */, 0 /* ty=int32 span=DequantizeLinear_33:0:0 */, out_dtype="float32", axis=3) /* ty=Tensor[(1, 3, 3, 48), float32] span=DequantizeLinear_33:0:0 */;
  %203 = clip(%202, a_min=0f, a_max=6f) /* ty=Tensor[(1, 3, 3, 48), float32] span=Clip_33:0:0 */;
  %204 = qnn.quantize(%203, 1f /* ty=float32 span=QuantizeLinear_34.model/block_16_expand_relu/Relu6:0_scale:0:0 */, 0 /* ty=int32 span=QuantizeLinear_34:0:0 */, out_dtype="int8", axis=3) /* ty=Tensor[(1, 3, 3, 48), int8] span=QuantizeLinear_34:0:0 */;
  %205 = @tvmgen_default_esp_main_48(%204, meta[relay.Constant][98] /* ty=Tensor[(3, 3, 48, 1), int8] */, meta[relay.Constant][99] /* ty=Tensor[(1, 1, 1, 48), int8] */) /* ty=Tensor[(1, 3, 3, 48), int8] */;
  %206 = qnn.dequantize(%205, 1f /* ty=float32 span=QLinearConv_50.model/block_16_depthwise_BN/FusedBatchNormV3:0_scale:0:0 */, 0 /* ty=int32 span=DequantizeLinear_34:0:0 */, out_dtype="float32", axis=3) /* ty=Tensor[(1, 3, 3, 48), float32] span=DequantizeLinear_34:0:0 */;
  %207 = clip(%206, a_min=0f, a_max=6f) /* ty=Tensor[(1, 3, 3, 48), float32] span=Clip_34:0:0 */;
  %208 = qnn.quantize(%207, 1f /* ty=float32 span=QuantizeLinear_35.model/block_16_depthwise_relu/Relu6:0_scale:0:0 */, 0 /* ty=int32 span=QuantizeLinear_35:0:0 */, out_dtype="int8", axis=3) /* ty=Tensor[(1, 3, 3, 48), int8] span=QuantizeLinear_35:0:0 */;
  %209 = @tvmgen_default_esp_main_49(%208, meta[relay.Constant][100] /* ty=Tensor[(16, 1, 1, 48), int8] */, meta[relay.Constant][101] /* ty=Tensor[(1, 1, 1, 16), int8] */) /* ty=Tensor[(1, 3, 3, 16), int8] */;
  %210 = @tvmgen_default_esp_main_50(%209, meta[relay.Constant][102] /* ty=Tensor[(1280, 1, 1, 16), int8] */, meta[relay.Constant][103] /* ty=Tensor[(1, 1, 1, 1280), int8] */) /* ty=Tensor[(1, 3, 3, 1280), int8] */;
  %211 = qnn.dequantize(%210, 1f /* ty=float32 span=QLinearConv_52.model/Conv_1_bn/FusedBatchNormV3:0_scale:0:0 */, 0 /* ty=int32 span=DequantizeLinear_35:0:0 */, out_dtype="float32", axis=3) /* ty=Tensor[(1, 3, 3, 1280), float32] span=DequantizeLinear_35:0:0 */;
  %212 = clip(%211, a_min=0f, a_max=6f) /* ty=Tensor[(1, 3, 3, 1280), float32] span=Clip_35:0:0 */;
  %213 = nn.global_avg_pool2d(%212, layout="NHWC") /* ty=Tensor[(1, 1, 1, 1280), float32] span=GlobalAveragePool_1:0:0 */;
  %214 = squeeze(%213, axis=[1, 2]) /* ty=Tensor[(1, 1280), float32] span=Squeeze_1:0:0 */;
  %215 = qnn.quantize(%214, 1f /* ty=float32 span=QuantizeLinear_36.model/global_average_pooling2d/Mean_Squeeze__1228:0_scale:0:0 */, 0 /* ty=int32 span=QuantizeLinear_36:0:0 */, out_dtype="int8", axis=1) /* ty=Tensor[(1, 1280), int8] span=QuantizeLinear_36:0:0 */;
  %216 = qnn.dense(%215, meta[relay.Constant][104] /* ty=Tensor[(2, 1280), int8] span=QLinearMatMul_1:0:0 */, 0 /* ty=int32 span=QLinearMatMul_1:0:0 */, 0 /* ty=int32 span=QLinearMatMul_1:0:0 */, 1f /* ty=float32 span=QuantizeLinear_36.model/global_average_pooling2d/Mean_Squeeze__1228:0_scale:0:0 */, 0.000976562f /* ty=float32 span=QLinearMatMul_1.model/dense/MatMul/ReadVariableOp:0_scale:0:0 */, units=2, out_dtype="int32") /* ty=Tensor[(1, 2), int32] span=QLinearMatMul_1:0:0 */;
  %217 = qnn.requantize(%216, 0.000976562f /* ty=float32 span=QLinearMatMul_1:0:0 */, 0 /* ty=int32 span=QLinearMatMul_1:0:0 */, 1f /* ty=float32 span=QLinearMatMul_1.dense_scale:0:0 */, 0 /* ty=int32 span=QLinearMatMul_1:0:0 */, axis=1, rounding="TONEAREST", compute_dtype="int64", out_dtype="int8") /* ty=Tensor[(1, 2), int8] span=QLinearMatMul_1:0:0 */;
  qnn.dequantize(%217, 1f /* ty=float32 span=QLinearMatMul_1.dense_scale:0:0 */, 0 /* ty=int32 span=DequantizeLinear_36:0:0 */, out_dtype="float32", axis=1) /* ty=Tensor[(1, 2), float32] span=DequantizeLinear_36:0:0 */
}

def @tvmgen_default_esp_main_0(%esp_0_i0: Tensor[(1, 48, 48, 8), int8] /* ty=Tensor[(1, 48, 48, 8), int8] */, %esp_func_var_0: Tensor[(3, 3, 8, 1), int8] /* ty=Tensor[(3, 3, 8, 1), int8] */, %esp_func_var_1: Tensor[(1, 1, 1, 8), int8] /* ty=Tensor[(1, 1, 1, 8), int8] */, Compiler="esp", Primitive=1, Inline=1, global_symbol="tvmgen_default_esp_main_0") -> Tensor[(1, 48, 48, 8), int8] {
  %220 = fn (%FunctionVar_50_0: Tensor[(1, 48, 48, 8), int8] /* ty=Tensor[(1, 48, 48, 8), int8] */, %tvm_var_extract_const_0: Tensor[(3, 3, 8, 1), int8] /* ty=Tensor[(3, 3, 8, 1), int8] */, %tvm_var_extract_const_1: Tensor[(1, 1, 1, 8), int8] /* ty=Tensor[(1, 1, 1, 8), int8] */, PartitionedFromPattern="qnn.conv2d_qnn.requantize_add_", Composite="esp.qnn_conv2d_onnx") -> Tensor[(1, 48, 48, 8), int8] {
    %218 = qnn.conv2d(%FunctionVar_50_0, %tvm_var_extract_const_0, 0 /* ty=int32 span=QLinearConv_2:0:0 */, 0 /* ty=int32 span=QLinearConv_2:0:0 */, 0f /* ty=float32 */, -8f /* ty=float32 */, padding=[1, 1, 1, 1], groups=8, channels=8, kernel_size=[3, 3], data_layout="NHWC", kernel_layout="HWOI", out_dtype="int32") /* ty=Tensor[(1, 48, 48, 8), int32] */;
    %219 = qnn.requantize(%218, 0.00390625f /* ty=float32 span=QLinearConv_2:0:0 */, 0 /* ty=int32 span=QLinearConv_2:0:0 */, 0f /* ty=float32 */, 0 /* ty=int32 span=QLinearConv_2:0:0 */, axis=3, out_dtype="int8") /* ty=Tensor[(1, 48, 48, 8), int8] */;
    add(%219, %tvm_var_extract_const_1) /* ty=Tensor[(1, 48, 48, 8), int8] */
  } /* ty=fn (Tensor[(1, 48, 48, 8), int8], Tensor[(3, 3, 8, 1), int8], Tensor[(1, 1, 1, 8), int8]) -> Tensor[(1, 48, 48, 8), int8] */;
  %220(%esp_0_i0, %esp_func_var_0, %esp_func_var_1) /* ty=Tensor[(1, 48, 48, 8), int8] */
}

def @tvmgen_default_esp_main_1(%esp_1_i0: Tensor[(1, 48, 48, 8), int8] /* ty=Tensor[(1, 48, 48, 8), int8] */, %esp_func_var_2: Tensor[(8, 1, 1, 8), int8] /* ty=Tensor[(8, 1, 1, 8), int8] */, %esp_func_var_3: Tensor[(1, 1, 1, 8), int8] /* ty=Tensor[(1, 1, 1, 8), int8] */, Compiler="esp", Primitive=1, Inline=1, global_symbol="tvmgen_default_esp_main_1") -> Tensor[(1, 48, 48, 8), int8] {
  %223 = fn (%FunctionVar_49_0: Tensor[(1, 48, 48, 8), int8] /* ty=Tensor[(1, 48, 48, 8), int8] */, %tvm_var_extract_const_2: Tensor[(8, 1, 1, 8), int8] /* ty=Tensor[(8, 1, 1, 8), int8] */, %tvm_var_extract_const_3: Tensor[(1, 1, 1, 8), int8] /* ty=Tensor[(1, 1, 1, 8), int8] */, PartitionedFromPattern="qnn.conv2d_qnn.requantize_add_", Composite="esp.qnn_conv2d_onnx") -> Tensor[(1, 48, 48, 8), int8] {
    %221 = qnn.conv2d(%FunctionVar_49_0, %tvm_var_extract_const_2, 0 /* ty=int32 span=QLinearConv_3:0:0 */, 0 /* ty=int32 span=QLinearConv_3:0:0 */, 0f /* ty=float32 */, -7f /* ty=float32 */, padding=[0, 0, 0, 0], channels=8, kernel_size=[1, 1], data_layout="NHWC", kernel_layout="OHWI", out_dtype="int32") /* ty=Tensor[(1, 48, 48, 8), int32] */;
    %222 = qnn.requantize(%221, 0.0078125f /* ty=float32 span=QLinearConv_3:0:0 */, 0 /* ty=int32 span=QLinearConv_3:0:0 */, 0f /* ty=float32 */, 0 /* ty=int32 span=QLinearConv_3:0:0 */, axis=3, out_dtype="int8") /* ty=Tensor[(1, 48, 48, 8), int8] */;
    add(%222, %tvm_var_extract_const_3) /* ty=Tensor[(1, 48, 48, 8), int8] */
  } /* ty=fn (Tensor[(1, 48, 48, 8), int8], Tensor[(8, 1, 1, 8), int8], Tensor[(1, 1, 1, 8), int8]) -> Tensor[(1, 48, 48, 8), int8] */;
  %223(%esp_1_i0, %esp_func_var_2, %esp_func_var_3) /* ty=Tensor[(1, 48, 48, 8), int8] */
}

def @tvmgen_default_esp_main_10(%esp_10_i0: Tensor[(1, 12, 12, 48), int8] /* ty=Tensor[(1, 12, 12, 48), int8] */, %esp_func_var_20: Tensor[(8, 1, 1, 48), int8] /* ty=Tensor[(8, 1, 1, 48), int8] */, %esp_func_var_21: Tensor[(1, 1, 1, 8), int8] /* ty=Tensor[(1, 1, 1, 8), int8] */, Compiler="esp", Primitive=1, Inline=1, global_symbol="tvmgen_default_esp_main_10") -> Tensor[(1, 12, 12, 8), int8] {
  %226 = fn (%FunctionVar_40_0: Tensor[(1, 12, 12, 48), int8] /* ty=Tensor[(1, 12, 12, 48), int8] */, %tvm_var_extract_const_20: Tensor[(8, 1, 1, 48), int8] /* ty=Tensor[(8, 1, 1, 48), int8] */, %tvm_var_extract_const_21: Tensor[(1, 1, 1, 8), int8] /* ty=Tensor[(1, 1, 1, 8), int8] */, PartitionedFromPattern="qnn.conv2d_qnn.requantize_add_", Composite="esp.qnn_conv2d_onnx") -> Tensor[(1, 12, 12, 8), int8] {
    %224 = qnn.conv2d(%FunctionVar_40_0, %tvm_var_extract_const_20, 0 /* ty=int32 span=QLinearConv_12:0:0 */, 0 /* ty=int32 span=QLinearConv_12:0:0 */, 0f /* ty=float32 */, -8f /* ty=float32 */, padding=[0, 0, 0, 0], channels=8, kernel_size=[1, 1], data_layout="NHWC", kernel_layout="OHWI", out_dtype="int32") /* ty=Tensor[(1, 12, 12, 8), int32] */;
    %225 = qnn.requantize(%224, 0.00390625f /* ty=float32 span=QLinearConv_12:0:0 */, 0 /* ty=int32 span=QLinearConv_12:0:0 */, 0f /* ty=float32 */, 0 /* ty=int32 span=QLinearConv_12:0:0 */, axis=3, out_dtype="int8") /* ty=Tensor[(1, 12, 12, 8), int8] */;
    add(%225, %tvm_var_extract_const_21) /* ty=Tensor[(1, 12, 12, 8), int8] */
  } /* ty=fn (Tensor[(1, 12, 12, 48), int8], Tensor[(8, 1, 1, 48), int8], Tensor[(1, 1, 1, 8), int8]) -> Tensor[(1, 12, 12, 8), int8] */;
  %226(%esp_10_i0, %esp_func_var_20, %esp_func_var_21) /* ty=Tensor[(1, 12, 12, 8), int8] */
}

def @tvmgen_default_esp_main_11(%esp_11_i0: Tensor[(1, 12, 12, 8), int8] /* ty=Tensor[(1, 12, 12, 8), int8] */, %esp_func_var_22: Tensor[(48, 1, 1, 8), int8] /* ty=Tensor[(48, 1, 1, 8), int8] */, %esp_func_var_23: Tensor[(1, 1, 1, 48), int8] /* ty=Tensor[(1, 1, 1, 48), int8] */, Compiler="esp", Primitive=1, Inline=1, global_symbol="tvmgen_default_esp_main_11") -> Tensor[(1, 12, 12, 48), int8] {
  %229 = fn (%FunctionVar_39_0: Tensor[(1, 12, 12, 8), int8] /* ty=Tensor[(1, 12, 12, 8), int8] */, %tvm_var_extract_const_22: Tensor[(48, 1, 1, 8), int8] /* ty=Tensor[(48, 1, 1, 8), int8] */, %tvm_var_extract_const_23: Tensor[(1, 1, 1, 48), int8] /* ty=Tensor[(1, 1, 1, 48), int8] */, PartitionedFromPattern="qnn.conv2d_qnn.requantize_add_", Composite="esp.qnn_conv2d_onnx") -> Tensor[(1, 12, 12, 48), int8] {
