def @main(%input: Tensor[(1, 3, 224, 224), float32] /* ty=Tensor[(1, 3, 224, 224), float32] span=input_Conv_0_QuantizeLinear.input:0:0 */) -> Tensor[(1, 1000), float32] {
  %0 = qnn.quantize(%input, 0.0186584f /* ty=float32 span=input_Conv_0_QuantizeLinear.input_scale:0:0 */, 114 /* ty=int32 span=input_Conv_0_QuantizeLinear:0:0 */, out_dtype="uint8", axis=0) /* ty=Tensor[(1, 3, 224, 224), uint8] span=input_Conv_0_QuantizeLinear:0:0 */;
  %1 = qnn.dequantize(%0, 0.0186584f /* ty=float32 span=input_Conv_0_QuantizeLinear.input_scale:0:0 */, 114 /* ty=int32 span=input_Conv_0_DequantizeLinear:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(1, 3, 224, 224), float32] span=input_Conv_0_DequantizeLinear:0:0 */;
  %2 = qnn.dequantize(meta[relay.Constant][0] /* ty=Tensor[(24, 3, 3, 3), int8] span=ConvBnFusion_W_conv1.0.weight_DequantizeLinear.ConvBnFusion_W_conv1.0.weight_quantized:0:0 */, 0.00824233f /* ty=float32 span=ConvBnFusion_W_conv1.0.weight_DequantizeLinear.ConvBnFusion_W_conv1.0.weight_scale:0:0 */, 0 /* ty=int32 span=ConvBnFusion_W_conv1.0.weight_DequantizeLinear:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(24, 3, 3, 3), float32] span=ConvBnFusion_W_conv1.0.weight_DequantizeLinear:0:0 */;
  %3 = qnn.dequantize(meta[relay.Constant][1] /* ty=Tensor[(24), int32] span=ConvBnFusion_BN_B_conv1.1.bias_DequantizeLinear.ConvBnFusion_BN_B_conv1.1.bias_quantized:0:0 */, meta[relay.Constant][2] /* ty=Tensor[(1), float32] span=ConvBnFusion_BN_B_conv1.1.bias_DequantizeLinear.ConvBnFusion_BN_B_conv1.1.bias_scale:0:0 */, meta[relay.Constant][3] /* ty=Tensor[(1), int32] span=ConvBnFusion_BN_B_conv1.1.bias_DequantizeLinear:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(24), float32] span=ConvBnFusion_BN_B_conv1.1.bias_DequantizeLinear:0:0 */;
  %4 = expand_dims(%3, axis=1, num_newaxis=2) /* ty=Tensor[(24, 1, 1), float32] */;
  %5 = nn.conv2d(%1, %2, strides=[2, 2], padding=[1, 1, 1, 1], channels=24, kernel_size=[3, 3]) /* ty=Tensor[(1, 24, 112, 112), float32] span=Conv_0_quant:0:0 */;
  %6 = expand_dims(%4, axis=0) /* ty=Tensor[(1, 24, 1, 1), float32] */;
  %7 = add(%5, %6) /* ty=Tensor[(1, 24, 112, 112), float32] */;
  %8 = qnn.quantize(%7, 0.0570685f /* ty=float32 span=340_Conv_0_QuantizeLinear.340_scale:0:0 */, 0 /* ty=int32 span=340_Conv_0_QuantizeLinear:0:0 */, out_dtype="uint8", axis=0) /* ty=Tensor[(1, 24, 112, 112), uint8] span=340_Conv_0_QuantizeLinear:0:0 */;
  %9 = qnn.dequantize(%8, 0.0570685f /* ty=float32 span=340_Conv_0_QuantizeLinear.340_scale:0:0 */, 0 /* ty=int32 span=340_MaxPool_3_DequantizeLinear:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(1, 24, 112, 112), float32] span=340_MaxPool_3_DequantizeLinear:0:0 */;
  %10 = nn.max_pool2d(%9, pool_size=[3, 3], strides=[2, 2], padding=[1, 1, 1, 1]) /* ty=Tensor[(1, 24, 56, 56), float32] span=MaxPool_3_quant:0:0 */;
  %11 = qnn.quantize(%10, 0.0570685f /* ty=float32 span=340_Conv_0_QuantizeLinear.340_scale:0:0 */, 0 /* ty=int32 span=342_MaxPool_3_QuantizeLinear:0:0 */, out_dtype="uint8", axis=0) /* ty=Tensor[(1, 24, 56, 56), uint8] span=342_MaxPool_3_QuantizeLinear:0:0 */;
  %12 = qnn.dequantize(%11, 0.0570685f /* ty=float32 span=340_Conv_0_QuantizeLinear.340_scale:0:0 */, 0 /* ty=int32 span=342_Conv_9_DequantizeLinear:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(1, 24, 56, 56), float32] span=342_Conv_9_DequantizeLinear:0:0 */;
  %13 = qnn.dequantize(meta[relay.Constant][4] /* ty=Tensor[(24, 1, 3, 3), int8] span=ConvBnFusion_W_stage2.0.branch1.0.weight_DequantizeLinear.ConvBnFusion_W_stage2.0.branch1.0.weight_quantized:0:0 */, 0.019784f /* ty=float32 span=ConvBnFusion_W_stage2.0.branch1.0.weight_DequantizeLinear.ConvBnFusion_W_stage2.0.branch1.0.weight_scale:0:0 */, 0 /* ty=int32 span=ConvBnFusion_W_stage2.0.branch1.0.weight_DequantizeLinear:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(24, 1, 3, 3), float32] span=ConvBnFusion_W_stage2.0.branch1.0.weight_DequantizeLinear:0:0 */;
  %14 = qnn.dequantize(meta[relay.Constant][5] /* ty=Tensor[(24), int32] span=ConvBnFusion_BN_B_stage2.0.branch1.1.bias_DequantizeLinear.ConvBnFusion_BN_B_stage2.0.branch1.1.bias_quantized:0:0 */, meta[relay.Constant][6] /* ty=Tensor[(1), float32] span=ConvBnFusion_BN_B_stage2.0.branch1.1.bias_DequantizeLinear.ConvBnFusion_BN_B_stage2.0.branch1.1.bias_scale:0:0 */, meta[relay.Constant][7] /* ty=Tensor[(1), int32] span=ConvBnFusion_BN_B_stage2.0.branch1.1.bias_DequantizeLinear:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(24), float32] span=ConvBnFusion_BN_B_stage2.0.branch1.1.bias_DequantizeLinear:0:0 */;
  %15 = expand_dims(%14, axis=1, num_newaxis=2) /* ty=Tensor[(24, 1, 1), float32] */;
  %16 = nn.conv2d(%12, %13, strides=[2, 2], padding=[1, 1, 1, 1], groups=24, channels=24, kernel_size=[3, 3]) /* ty=Tensor[(1, 24, 28, 28), float32] span=Conv_4_quant:0:0 */;
  %17 = expand_dims(%15, axis=0) /* ty=Tensor[(1, 24, 1, 1), float32] */;
  %18 = add(%16, %17) /* ty=Tensor[(1, 24, 28, 28), float32] */;
  %19 = qnn.quantize(%18, 0.0776699f /* ty=float32 span=344_Conv_4_QuantizeLinear.344_scale:0:0 */, 121 /* ty=int32 span=344_Conv_4_QuantizeLinear:0:0 */, out_dtype="uint8", axis=0) /* ty=Tensor[(1, 24, 28, 28), uint8] span=344_Conv_4_QuantizeLinear:0:0 */;
  %20 = qnn.dequantize(%19, 0.0776699f /* ty=float32 span=344_Conv_4_QuantizeLinear.344_scale:0:0 */, 121 /* ty=int32 span=344_Conv_6_DequantizeLinear:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(1, 24, 28, 28), float32] span=344_Conv_6_DequantizeLinear:0:0 */;
  %21 = qnn.dequantize(meta[relay.Constant][8] /* ty=Tensor[(58, 24, 1, 1), int8] span=ConvBnFusion_W_stage2.0.branch1.2.weight_DequantizeLinear.ConvBnFusion_W_stage2.0.branch1.2.weight_quantized:0:0 */, 0.0109672f /* ty=float32 span=ConvBnFusion_W_stage2.0.branch1.2.weight_DequantizeLinear.ConvBnFusion_W_stage2.0.branch1.2.weight_scale:0:0 */, 0 /* ty=int32 span=ConvBnFusion_W_stage2.0.branch1.2.weight_DequantizeLinear:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(58, 24, 1, 1), float32] span=ConvBnFusion_W_stage2.0.branch1.2.weight_DequantizeLinear:0:0 */;
  %22 = qnn.dequantize(meta[relay.Constant][9] /* ty=Tensor[(58), int32] span=ConvBnFusion_BN_B_stage2.0.branch1.3.bias_DequantizeLinear.ConvBnFusion_BN_B_stage2.0.branch1.3.bias_quantized:0:0 */, meta[relay.Constant][10] /* ty=Tensor[(1), float32] span=ConvBnFusion_BN_B_stage2.0.branch1.3.bias_DequantizeLinear.ConvBnFusion_BN_B_stage2.0.branch1.3.bias_scale:0:0 */, meta[relay.Constant][11] /* ty=Tensor[(1), int32] span=ConvBnFusion_BN_B_stage2.0.branch1.3.bias_DequantizeLinear:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(58), float32] span=ConvBnFusion_BN_B_stage2.0.branch1.3.bias_DequantizeLinear:0:0 */;
  %23 = expand_dims(%22, axis=1, num_newaxis=2) /* ty=Tensor[(58, 1, 1), float32] */;
  %24 = nn.conv2d(%20, %21, padding=[0, 0, 0, 0], channels=58, kernel_size=[1, 1]) /* ty=Tensor[(1, 58, 28, 28), float32] span=Conv_6_quant:0:0 */;
  %25 = expand_dims(%23, axis=0) /* ty=Tensor[(1, 58, 1, 1), float32] */;
  %26 = add(%24, %25) /* ty=Tensor[(1, 58, 28, 28), float32] */;
  %27 = qnn.quantize(%26, 0.0385724f /* ty=float32 span=346_Conv_6_QuantizeLinear.346_scale:0:0 */, 0 /* ty=int32 span=346_Conv_6_QuantizeLinear:0:0 */, out_dtype="uint8", axis=0) /* ty=Tensor[(1, 58, 28, 28), uint8] span=346_Conv_6_QuantizeLinear:0:0 */;
  %28 = qnn.dequantize(meta[relay.Constant][12] /* ty=Tensor[(58, 24, 1, 1), int8] span=ConvBnFusion_W_stage2.0.branch2.0.weight_DequantizeLinear.ConvBnFusion_W_stage2.0.branch2.0.weight_quantized:0:0 */, 0.0111158f /* ty=float32 span=ConvBnFusion_W_stage2.0.branch2.0.weight_DequantizeLinear.ConvBnFusion_W_stage2.0.branch2.0.weight_scale:0:0 */, 0 /* ty=int32 span=ConvBnFusion_W_stage2.0.branch2.0.weight_DequantizeLinear:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(58, 24, 1, 1), float32] span=ConvBnFusion_W_stage2.0.branch2.0.weight_DequantizeLinear:0:0 */;
  %29 = qnn.dequantize(meta[relay.Constant][13] /* ty=Tensor[(58), int32] span=ConvBnFusion_BN_B_stage2.0.branch2.1.bias_DequantizeLinear.ConvBnFusion_BN_B_stage2.0.branch2.1.bias_quantized:0:0 */, meta[relay.Constant][14] /* ty=Tensor[(1), float32] span=ConvBnFusion_BN_B_stage2.0.branch2.1.bias_DequantizeLinear.ConvBnFusion_BN_B_stage2.0.branch2.1.bias_scale:0:0 */, meta[relay.Constant][15] /* ty=Tensor[(1), int32] span=ConvBnFusion_BN_B_stage2.0.branch2.1.bias_DequantizeLinear:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(58), float32] span=ConvBnFusion_BN_B_stage2.0.branch2.1.bias_DequantizeLinear:0:0 */;
  %30 = expand_dims(%29, axis=1, num_newaxis=2) /* ty=Tensor[(58, 1, 1), float32] */;
  %31 = nn.conv2d(%12, %28, padding=[0, 0, 0, 0], channels=58, kernel_size=[1, 1]) /* ty=Tensor[(1, 58, 56, 56), float32] span=Conv_9_quant:0:0 */;
  %32 = expand_dims(%30, axis=0) /* ty=Tensor[(1, 58, 1, 1), float32] */;
  %33 = add(%31, %32) /* ty=Tensor[(1, 58, 56, 56), float32] */;
  %34 = qnn.quantize(%33, 0.0185046f /* ty=float32 span=349_Conv_9_QuantizeLinear.349_scale:0:0 */, 0 /* ty=int32 span=349_Conv_9_QuantizeLinear:0:0 */, out_dtype="uint8", axis=0) /* ty=Tensor[(1, 58, 56, 56), uint8] span=349_Conv_9_QuantizeLinear:0:0 */;
  %35 = qnn.dequantize(%34, 0.0185046f /* ty=float32 span=349_Conv_9_QuantizeLinear.349_scale:0:0 */, 0 /* ty=int32 span=349_Conv_12_DequantizeLinear:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(1, 58, 56, 56), float32] span=349_Conv_12_DequantizeLinear:0:0 */;
  %36 = qnn.dequantize(meta[relay.Constant][16] /* ty=Tensor[(58, 1, 3, 3), int8] span=ConvBnFusion_W_stage2.0.branch2.3.weight_DequantizeLinear.ConvBnFusion_W_stage2.0.branch2.3.weight_quantized:0:0 */, 0.0524339f /* ty=float32 span=ConvBnFusion_W_stage2.0.branch2.3.weight_DequantizeLinear.ConvBnFusion_W_stage2.0.branch2.3.weight_scale:0:0 */, 0 /* ty=int32 span=ConvBnFusion_W_stage2.0.branch2.3.weight_DequantizeLinear:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(58, 1, 3, 3), float32] span=ConvBnFusion_W_stage2.0.branch2.3.weight_DequantizeLinear:0:0 */;
  %37 = qnn.dequantize(meta[relay.Constant][17] /* ty=Tensor[(58), int32] span=ConvBnFusion_BN_B_stage2.0.branch2.4.bias_DequantizeLinear.ConvBnFusion_BN_B_stage2.0.branch2.4.bias_quantized:0:0 */, meta[relay.Constant][18] /* ty=Tensor[(1), float32] span=ConvBnFusion_BN_B_stage2.0.branch2.4.bias_DequantizeLinear.ConvBnFusion_BN_B_stage2.0.branch2.4.bias_scale:0:0 */, meta[relay.Constant][19] /* ty=Tensor[(1), int32] span=ConvBnFusion_BN_B_stage2.0.branch2.4.bias_DequantizeLinear:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(58), float32] span=ConvBnFusion_BN_B_stage2.0.branch2.4.bias_DequantizeLinear:0:0 */;
  %38 = expand_dims(%37, axis=1, num_newaxis=2) /* ty=Tensor[(58, 1, 1), float32] */;
  %39 = nn.conv2d(%35, %36, strides=[2, 2], padding=[1, 1, 1, 1], groups=58, channels=58, kernel_size=[3, 3]) /* ty=Tensor[(1, 58, 28, 28), float32] span=Conv_12_quant:0:0 */;
  %40 = expand_dims(%38, axis=0) /* ty=Tensor[(1, 58, 1, 1), float32] */;
  %41 = add(%39, %40) /* ty=Tensor[(1, 58, 28, 28), float32] */;
  %42 = qnn.quantize(%41, 0.0608881f /* ty=float32 span=352_Conv_12_QuantizeLinear.352_scale:0:0 */, 124 /* ty=int32 span=352_Conv_12_QuantizeLinear:0:0 */, out_dtype="uint8", axis=0) /* ty=Tensor[(1, 58, 28, 28), uint8] span=352_Conv_12_QuantizeLinear:0:0 */;
  %43 = qnn.dequantize(%42, 0.0608881f /* ty=float32 span=352_Conv_12_QuantizeLinear.352_scale:0:0 */, 124 /* ty=int32 span=352_Conv_14_DequantizeLinear:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(1, 58, 28, 28), float32] span=352_Conv_14_DequantizeLinear:0:0 */;
  %44 = qnn.dequantize(meta[relay.Constant][20] /* ty=Tensor[(58, 58, 1, 1), int8] span=ConvBnFusion_W_stage2.0.branch2.5.weight_DequantizeLinear.ConvBnFusion_W_stage2.0.branch2.5.weight_quantized:0:0 */, 0.00495452f /* ty=float32 span=ConvBnFusion_W_stage2.0.branch2.5.weight_DequantizeLinear.ConvBnFusion_W_stage2.0.branch2.5.weight_scale:0:0 */, 0 /* ty=int32 span=ConvBnFusion_W_stage2.0.branch2.5.weight_DequantizeLinear:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(58, 58, 1, 1), float32] span=ConvBnFusion_W_stage2.0.branch2.5.weight_DequantizeLinear:0:0 */;
  %45 = qnn.dequantize(meta[relay.Constant][21] /* ty=Tensor[(58), int32] span=ConvBnFusion_BN_B_stage2.0.branch2.6.bias_DequantizeLinear.ConvBnFusion_BN_B_stage2.0.branch2.6.bias_quantized:0:0 */, meta[relay.Constant][22] /* ty=Tensor[(1), float32] span=ConvBnFusion_BN_B_stage2.0.branch2.6.bias_DequantizeLinear.ConvBnFusion_BN_B_stage2.0.branch2.6.bias_scale:0:0 */, meta[relay.Constant][23] /* ty=Tensor[(1), int32] span=ConvBnFusion_BN_B_stage2.0.branch2.6.bias_DequantizeLinear:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(58), float32] span=ConvBnFusion_BN_B_stage2.0.branch2.6.bias_DequantizeLinear:0:0 */;
  %46 = expand_dims(%45, axis=1, num_newaxis=2) /* ty=Tensor[(58, 1, 1), float32] */;
  %47 = nn.conv2d(%43, %44, padding=[0, 0, 0, 0], channels=58, kernel_size=[1, 1]) /* ty=Tensor[(1, 58, 28, 28), float32] span=Conv_14_quant:0:0 */;
  %48 = expand_dims(%46, axis=0) /* ty=Tensor[(1, 58, 1, 1), float32] */;
  %49 = add(%47, %48) /* ty=Tensor[(1, 58, 28, 28), float32] */;
  %50 = qnn.quantize(%49, 0.0246652f /* ty=float32 span=354_Conv_14_QuantizeLinear.354_scale:0:0 */, 0 /* ty=int32 span=354_Conv_14_QuantizeLinear:0:0 */, out_dtype="uint8", axis=0) /* ty=Tensor[(1, 58, 28, 28), uint8] span=354_Conv_14_QuantizeLinear:0:0 */;
  %51 = qnn.dequantize(%27, 0.0385724f /* ty=float32 span=346_Conv_6_QuantizeLinear.346_scale:0:0 */, 0 /* ty=int32 span=346_Concat_17_DequantizeLinear:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(1, 58, 28, 28), float32] span=346_Concat_17_DequantizeLinear:0:0 */;
  %52 = qnn.dequantize(%50, 0.0246652f /* ty=float32 span=354_Conv_14_QuantizeLinear.354_scale:0:0 */, 0 /* ty=int32 span=354_Concat_17_DequantizeLinear:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(1, 58, 28, 28), float32] span=354_Concat_17_DequantizeLinear:0:0 */;
  %53 = (%51, %52) /* ty=(Tensor[(1, 58, 28, 28), float32], Tensor[(1, 58, 28, 28), float32]) span=Concat_17_quant:0:0 */;
  %54 = concatenate(%53, axis=1) /* ty=Tensor[(1, 116, 28, 28), float32] span=Concat_17_quant:0:0 */;
  %55 = qnn.quantize(%54, 0.0385724f /* ty=float32 span=356_Concat_17_QuantizeLinear.356_scale:0:0 */, 0 /* ty=int32 span=356_Concat_17_QuantizeLinear:0:0 */, out_dtype="uint8", axis=0) /* ty=Tensor[(1, 116, 28, 28), uint8] span=356_Concat_17_QuantizeLinear:0:0 */;
  %56 = qnn.dequantize(%55, 0.0385724f /* ty=float32 span=356_Concat_17_QuantizeLinear.356_scale:0:0 */, 0 /* ty=int32 span=356_Reshape_19_DequantizeLinear:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(1, 116, 28, 28), float32] span=356_Reshape_19_DequantizeLinear:0:0 */;
  %57 = reshape(%56, newshape=[1, 2, 58, 28, 28]) /* ty=Tensor[(1, 2, 58, 28, 28), float32] span=Reshape_19_quant:0:0 */;
  %58 = qnn.quantize(%57, 0.0385724f /* ty=float32 span=356_Concat_17_QuantizeLinear.356_scale:0:0 */, 0 /* ty=int32 span=358_Reshape_19_QuantizeLinear:0:0 */, out_dtype="uint8", axis=0) /* ty=Tensor[(1, 2, 58, 28, 28), uint8] span=358_Reshape_19_QuantizeLinear:0:0 */;
  %59 = qnn.dequantize(%58, 0.0385724f /* ty=float32 span=356_Concat_17_QuantizeLinear.356_scale:0:0 */, 0 /* ty=int32 span=358_Transpose_20_DequantizeLinear:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(1, 2, 58, 28, 28), float32] span=358_Transpose_20_DequantizeLinear:0:0 */;
  %60 = transpose(%59, axes=[0, 2, 1, 3, 4]) /* ty=Tensor[(1, 58, 2, 28, 28), float32] span=Transpose_20_quant:0:0 */;
  %61 = qnn.quantize(%60, 0.0385724f /* ty=float32 span=356_Concat_17_QuantizeLinear.356_scale:0:0 */, 0 /* ty=int32 span=359_Transpose_20_QuantizeLinear:0:0 */, out_dtype="uint8", axis=0) /* ty=Tensor[(1, 58, 2, 28, 28), uint8] span=359_Transpose_20_QuantizeLinear:0:0 */;
  %62 = qnn.dequantize(%61, 0.0385724f /* ty=float32 span=356_Concat_17_QuantizeLinear.356_scale:0:0 */, 0 /* ty=int32 span=359_Reshape_22_DequantizeLinear:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(1, 58, 2, 28, 28), float32] span=359_Reshape_22_DequantizeLinear:0:0 */;
  %63 = reshape(%62, newshape=[1, -1, 28, 28]) /* ty=Tensor[(1, 116, 28, 28), float32] span=Reshape_22_quant:0:0 */;
  %64 = qnn.quantize(%63, 0.0385724f /* ty=float32 span=356_Concat_17_QuantizeLinear.356_scale:0:0 */, 0 /* ty=int32 span=361_Reshape_22_QuantizeLinear:0:0 */, out_dtype="uint8", axis=0) /* ty=Tensor[(1, 116, 28, 28), uint8] span=361_Reshape_22_QuantizeLinear:0:0 */;
  %65 = qnn.dequantize(%64, 0.0385724f /* ty=float32 span=356_Concat_17_QuantizeLinear.356_scale:0:0 */, 0 /* ty=int32 span=361_Split_23_DequantizeLinear:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(1, 116, 28, 28), float32] span=361_Split_23_DequantizeLinear:0:0 */;
  %66 = split(%65, indices_or_sections=[58], axis=1) /* ty=(Tensor[(1, 58, 28, 28), float32], Tensor[(1, 58, 28, 28), float32]) span=Split_23_quant:0:0 */;
  %67 = %66.0 /* ty=Tensor[(1, 58, 28, 28), float32] */;
  %68 = qnn.quantize(%67, 0.0385724f /* ty=float32 span=356_Concat_17_QuantizeLinear.356_scale:0:0 */, 0 /* ty=int32 span=362_Split_23_QuantizeLinear:0:0 */, out_dtype="uint8", axis=0) /* ty=Tensor[(1, 58, 28, 28), uint8] span=362_Split_23_QuantizeLinear:0:0 */;
  %69 = %66.1 /* ty=Tensor[(1, 58, 28, 28), float32] */;
  %70 = qnn.quantize(%69, 0.0385724f /* ty=float32 span=356_Concat_17_QuantizeLinear.356_scale:0:0 */, 0 /* ty=int32 span=363_Split_23_QuantizeLinear:0:0 */, out_dtype="uint8", axis=0) /* ty=Tensor[(1, 58, 28, 28), uint8] span=363_Split_23_QuantizeLinear:0:0 */;
  %71 = qnn.dequantize(%70, 0.0385724f /* ty=float32 span=356_Concat_17_QuantizeLinear.356_scale:0:0 */, 0 /* ty=int32 span=363_Conv_24_DequantizeLinear:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(1, 58, 28, 28), float32] span=363_Conv_24_DequantizeLinear:0:0 */;
  %72 = qnn.dequantize(meta[relay.Constant][24] /* ty=Tensor[(58, 58, 1, 1), int8] span=ConvBnFusion_W_stage2.1.branch2.0.weight_DequantizeLinear.ConvBnFusion_W_stage2.1.branch2.0.weight_quantized:0:0 */, 0.00625523f /* ty=float32 span=ConvBnFusion_W_stage2.1.branch2.0.weight_DequantizeLinear.ConvBnFusion_W_stage2.1.branch2.0.weight_scale:0:0 */, 0 /* ty=int32 span=ConvBnFusion_W_stage2.1.branch2.0.weight_DequantizeLinear:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(58, 58, 1, 1), float32] span=ConvBnFusion_W_stage2.1.branch2.0.weight_DequantizeLinear:0:0 */;
  %73 = qnn.dequantize(meta[relay.Constant][25] /* ty=Tensor[(58), int32] span=ConvBnFusion_BN_B_stage2.1.branch2.1.bias_DequantizeLinear.ConvBnFusion_BN_B_stage2.1.branch2.1.bias_quantized:0:0 */, meta[relay.Constant][26] /* ty=Tensor[(1), float32] span=ConvBnFusion_BN_B_stage2.1.branch2.1.bias_DequantizeLinear.ConvBnFusion_BN_B_stage2.1.branch2.1.bias_scale:0:0 */, meta[relay.Constant][27] /* ty=Tensor[(1), int32] span=ConvBnFusion_BN_B_stage2.1.branch2.1.bias_DequantizeLinear:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(58), float32] span=ConvBnFusion_BN_B_stage2.1.branch2.1.bias_DequantizeLinear:0:0 */;
  %74 = expand_dims(%73, axis=1, num_newaxis=2) /* ty=Tensor[(58, 1, 1), float32] */;
  %75 = nn.conv2d(%71, %72, padding=[0, 0, 0, 0], channels=58, kernel_size=[1, 1]) /* ty=Tensor[(1, 58, 28, 28), float32] span=Conv_24_quant:0:0 */;
  %76 = expand_dims(%74, axis=0) /* ty=Tensor[(1, 58, 1, 1), float32] */;
  %77 = add(%75, %76) /* ty=Tensor[(1, 58, 28, 28), float32] */;
  %78 = qnn.quantize(%77, 0.0111231f /* ty=float32 span=365_Conv_24_QuantizeLinear.365_scale:0:0 */, 0 /* ty=int32 span=365_Conv_24_QuantizeLinear:0:0 */, out_dtype="uint8", axis=0) /* ty=Tensor[(1, 58, 28, 28), uint8] span=365_Conv_24_QuantizeLinear:0:0 */;
  %79 = qnn.dequantize(%78, 0.0111231f /* ty=float32 span=365_Conv_24_QuantizeLinear.365_scale:0:0 */, 0 /* ty=int32 span=365_Conv_27_DequantizeLinear:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(1, 58, 28, 28), float32] span=365_Conv_27_DequantizeLinear:0:0 */;
  %80 = qnn.dequantize(meta[relay.Constant][28] /* ty=Tensor[(58, 1, 3, 3), int8] span=ConvBnFusion_W_stage2.1.branch2.3.weight_DequantizeLinear.ConvBnFusion_W_stage2.1.branch2.3.weight_quantized:0:0 */, 0.0559938f /* ty=float32 span=ConvBnFusion_W_stage2.1.branch2.3.weight_DequantizeLinear.ConvBnFusion_W_stage2.1.branch2.3.weight_scale:0:0 */, 0 /* ty=int32 span=ConvBnFusion_W_stage2.1.branch2.3.weight_DequantizeLinear:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(58, 1, 3, 3), float32] span=ConvBnFusion_W_stage2.1.branch2.3.weight_DequantizeLinear:0:0 */;
  %81 = qnn.dequantize(meta[relay.Constant][29] /* ty=Tensor[(58), int32] span=ConvBnFusion_BN_B_stage2.1.branch2.4.bias_DequantizeLinear.ConvBnFusion_BN_B_stage2.1.branch2.4.bias_quantized:0:0 */, meta[relay.Constant][30] /* ty=Tensor[(1), float32] span=ConvBnFusion_BN_B_stage2.1.branch2.4.bias_DequantizeLinear.ConvBnFusion_BN_B_stage2.1.branch2.4.bias_scale:0:0 */, meta[relay.Constant][31] /* ty=Tensor[(1), int32] span=ConvBnFusion_BN_B_stage2.1.branch2.4.bias_DequantizeLinear:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(58), float32] span=ConvBnFusion_BN_B_stage2.1.branch2.4.bias_DequantizeLinear:0:0 */;
  %82 = expand_dims(%81, axis=1, num_newaxis=2) /* ty=Tensor[(58, 1, 1), float32] */;
  %83 = nn.conv2d(%79, %80, padding=[1, 1, 1, 1], groups=58, channels=58, kernel_size=[3, 3]) /* ty=Tensor[(1, 58, 28, 28), float32] span=Conv_27_quant:0:0 */;
  %84 = expand_dims(%82, axis=0) /* ty=Tensor[(1, 58, 1, 1), float32] */;
  %85 = add(%83, %84) /* ty=Tensor[(1, 58, 28, 28), float32] */;
  %86 = qnn.quantize(%85, 0.0376525f /* ty=float32 span=368_Conv_27_QuantizeLinear.368_scale:0:0 */, 126 /* ty=int32 span=368_Conv_27_QuantizeLinear:0:0 */, out_dtype="uint8", axis=0) /* ty=Tensor[(1, 58, 28, 28), uint8] span=368_Conv_27_QuantizeLinear:0:0 */;
  %87 = qnn.dequantize(%86, 0.0376525f /* ty=float32 span=368_Conv_27_QuantizeLinear.368_scale:0:0 */, 126 /* ty=int32 span=368_Conv_29_DequantizeLinear:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(1, 58, 28, 28), float32] span=368_Conv_29_DequantizeLinear:0:0 */;
  %88 = qnn.dequantize(meta[relay.Constant][32] /* ty=Tensor[(58, 58, 1, 1), int8] span=ConvBnFusion_W_stage2.1.branch2.5.weight_DequantizeLinear.ConvBnFusion_W_stage2.1.branch2.5.weight_quantized:0:0 */, 0.00476717f /* ty=float32 span=ConvBnFusion_W_stage2.1.branch2.5.weight_DequantizeLinear.ConvBnFusion_W_stage2.1.branch2.5.weight_scale:0:0 */, 0 /* ty=int32 span=ConvBnFusion_W_stage2.1.branch2.5.weight_DequantizeLinear:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(58, 58, 1, 1), float32] span=ConvBnFusion_W_stage2.1.branch2.5.weight_DequantizeLinear:0:0 */;
  %89 = qnn.dequantize(meta[relay.Constant][33] /* ty=Tensor[(58), int32] span=ConvBnFusion_BN_B_stage2.1.branch2.6.bias_DequantizeLinear.ConvBnFusion_BN_B_stage2.1.branch2.6.bias_quantized:0:0 */, meta[relay.Constant][34] /* ty=Tensor[(1), float32] span=ConvBnFusion_BN_B_stage2.1.branch2.6.bias_DequantizeLinear.ConvBnFusion_BN_B_stage2.1.branch2.6.bias_scale:0:0 */, meta[relay.Constant][35] /* ty=Tensor[(1), int32] span=ConvBnFusion_BN_B_stage2.1.branch2.6.bias_DequantizeLinear:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(58), float32] span=ConvBnFusion_BN_B_stage2.1.branch2.6.bias_DequantizeLinear:0:0 */;
  %90 = expand_dims(%89, axis=1, num_newaxis=2) /* ty=Tensor[(58, 1, 1), float32] */;
  %91 = nn.conv2d(%87, %88, padding=[0, 0, 0, 0], channels=58, kernel_size=[1, 1]) /* ty=Tensor[(1, 58, 28, 28), float32] span=Conv_29_quant:0:0 */;
  %92 = expand_dims(%90, axis=0) /* ty=Tensor[(1, 58, 1, 1), float32] */;
  %93 = add(%91, %92) /* ty=Tensor[(1, 58, 28, 28), float32] */;
  %94 = qnn.quantize(%93, 0.0175771f /* ty=float32 span=370_Conv_29_QuantizeLinear.370_scale:0:0 */, 0 /* ty=int32 span=370_Conv_29_QuantizeLinear:0:0 */, out_dtype="uint8", axis=0) /* ty=Tensor[(1, 58, 28, 28), uint8] span=370_Conv_29_QuantizeLinear:0:0 */;
  %95 = qnn.dequantize(%68, 0.0385724f /* ty=float32 span=356_Concat_17_QuantizeLinear.356_scale:0:0 */, 0 /* ty=int32 span=362_Concat_32_DequantizeLinear:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(1, 58, 28, 28), float32] span=362_Concat_32_DequantizeLinear:0:0 */;
  %96 = qnn.dequantize(%94, 0.0175771f /* ty=float32 span=370_Conv_29_QuantizeLinear.370_scale:0:0 */, 0 /* ty=int32 span=370_Concat_32_DequantizeLinear:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(1, 58, 28, 28), float32] span=370_Concat_32_DequantizeLinear:0:0 */;
  %97 = (%95, %96) /* ty=(Tensor[(1, 58, 28, 28), float32], Tensor[(1, 58, 28, 28), float32]) span=Concat_32_quant:0:0 */;
  %98 = concatenate(%97, axis=1) /* ty=Tensor[(1, 116, 28, 28), float32] span=Concat_32_quant:0:0 */;
  %99 = qnn.quantize(%98, 0.0385724f /* ty=float32 span=372_Concat_32_QuantizeLinear.372_scale:0:0 */, 0 /* ty=int32 span=372_Concat_32_QuantizeLinear:0:0 */, out_dtype="uint8", axis=0) /* ty=Tensor[(1, 116, 28, 28), uint8] span=372_Concat_32_QuantizeLinear:0:0 */;
  %100 = qnn.dequantize(%99, 0.0385724f /* ty=float32 span=372_Concat_32_QuantizeLinear.372_scale:0:0 */, 0 /* ty=int32 span=372_Reshape_34_DequantizeLinear:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(1, 116, 28, 28), float32] span=372_Reshape_34_DequantizeLinear:0:0 */;
  %101 = reshape(%100, newshape=[1, 2, 58, 28, 28]) /* ty=Tensor[(1, 2, 58, 28, 28), float32] span=Reshape_34_quant:0:0 */;
  %102 = qnn.quantize(%101, 0.0385724f /* ty=float32 span=372_Concat_32_QuantizeLinear.372_scale:0:0 */, 0 /* ty=int32 span=374_Reshape_34_QuantizeLinear:0:0 */, out_dtype="uint8", axis=0) /* ty=Tensor[(1, 2, 58, 28, 28), uint8] span=374_Reshape_34_QuantizeLinear:0:0 */;
  %103 = qnn.dequantize(%102, 0.0385724f /* ty=float32 span=372_Concat_32_QuantizeLinear.372_scale:0:0 */, 0 /* ty=int32 span=374_Transpose_35_DequantizeLinear:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(1, 2, 58, 28, 28), float32] span=374_Transpose_35_DequantizeLinear:0:0 */;
  %104 = transpose(%103, axes=[0, 2, 1, 3, 4]) /* ty=Tensor[(1, 58, 2, 28, 28), float32] span=Transpose_35_quant:0:0 */;
  %105 = qnn.quantize(%104, 0.0385724f /* ty=float32 span=372_Concat_32_QuantizeLinear.372_scale:0:0 */, 0 /* ty=int32 span=375_Transpose_35_QuantizeLinear:0:0 */, out_dtype="uint8", axis=0) /* ty=Tensor[(1, 58, 2, 28, 28), uint8] span=375_Transpose_35_QuantizeLinear:0:0 */;
  %106 = qnn.dequantize(%105, 0.0385724f /* ty=float32 span=372_Concat_32_QuantizeLinear.372_scale:0:0 */, 0 /* ty=int32 span=375_Reshape_37_DequantizeLinear:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(1, 58, 2, 28, 28), float32] span=375_Reshape_37_DequantizeLinear:0:0 */;
  %107 = reshape(%106, newshape=[1, -1, 28, 28]) /* ty=Tensor[(1, 116, 28, 28), float32] span=Reshape_37_quant:0:0 */;
  %108 = qnn.quantize(%107, 0.0385724f /* ty=float32 span=372_Concat_32_QuantizeLinear.372_scale:0:0 */, 0 /* ty=int32 span=377_Reshape_37_QuantizeLinear:0:0 */, out_dtype="uint8", axis=0) /* ty=Tensor[(1, 116, 28, 28), uint8] span=377_Reshape_37_QuantizeLinear:0:0 */;
  %109 = qnn.dequantize(%108, 0.0385724f /* ty=float32 span=372_Concat_32_QuantizeLinear.372_scale:0:0 */, 0 /* ty=int32 span=377_Split_38_DequantizeLinear:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(1, 116, 28, 28), float32] span=377_Split_38_DequantizeLinear:0:0 */;
  %110 = split(%109, indices_or_sections=[58], axis=1) /* ty=(Tensor[(1, 58, 28, 28), float32], Tensor[(1, 58, 28, 28), float32]) span=Split_38_quant:0:0 */;
  %111 = %110.0 /* ty=Tensor[(1, 58, 28, 28), float32] */;
  %112 = qnn.quantize(%111, 0.0385724f /* ty=float32 span=372_Concat_32_QuantizeLinear.372_scale:0:0 */, 0 /* ty=int32 span=378_Split_38_QuantizeLinear:0:0 */, out_dtype="uint8", axis=0) /* ty=Tensor[(1, 58, 28, 28), uint8] span=378_Split_38_QuantizeLinear:0:0 */;
  %113 = %110.1 /* ty=Tensor[(1, 58, 28, 28), float32] */;
  %114 = qnn.quantize(%113, 0.0385724f /* ty=float32 span=372_Concat_32_QuantizeLinear.372_scale:0:0 */, 0 /* ty=int32 span=379_Split_38_QuantizeLinear:0:0 */, out_dtype="uint8", axis=0) /* ty=Tensor[(1, 58, 28, 28), uint8] span=379_Split_38_QuantizeLinear:0:0 */;
  %115 = qnn.dequantize(%114, 0.0385724f /* ty=float32 span=372_Concat_32_QuantizeLinear.372_scale:0:0 */, 0 /* ty=int32 span=379_Conv_39_DequantizeLinear:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(1, 58, 28, 28), float32] span=379_Conv_39_DequantizeLinear:0:0 */;
  %116 = qnn.dequantize(meta[relay.Constant][36] /* ty=Tensor[(58, 58, 1, 1), int8] span=ConvBnFusion_W_stage2.2.branch2.0.weight_DequantizeLinear.ConvBnFusion_W_stage2.2.branch2.0.weight_quantized:0:0 */, 0.00672964f /* ty=float32 span=ConvBnFusion_W_stage2.2.branch2.0.weight_DequantizeLinear.ConvBnFusion_W_stage2.2.branch2.0.weight_scale:0:0 */, 0 /* ty=int32 span=ConvBnFusion_W_stage2.2.branch2.0.weight_DequantizeLinear:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(58, 58, 1, 1), float32] span=ConvBnFusion_W_stage2.2.branch2.0.weight_DequantizeLinear:0:0 */;
  %117 = qnn.dequantize(meta[relay.Constant][37] /* ty=Tensor[(58), int32] span=ConvBnFusion_BN_B_stage2.2.branch2.1.bias_DequantizeLinear.ConvBnFusion_BN_B_stage2.2.branch2.1.bias_quantized:0:0 */, meta[relay.Constant][38] /* ty=Tensor[(1), float32] span=ConvBnFusion_BN_B_stage2.2.branch2.1.bias_DequantizeLinear.ConvBnFusion_BN_B_stage2.2.branch2.1.bias_scale:0:0 */, meta[relay.Constant][39] /* ty=Tensor[(1), int32] span=ConvBnFusion_BN_B_stage2.2.branch2.1.bias_DequantizeLinear:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(58), float32] span=ConvBnFusion_BN_B_stage2.2.branch2.1.bias_DequantizeLinear:0:0 */;
  %118 = expand_dims(%117, axis=1, num_newaxis=2) /* ty=Tensor[(58, 1, 1), float32] */;
  %119 = nn.conv2d(%115, %116, padding=[0, 0, 0, 0], channels=58, kernel_size=[1, 1]) /* ty=Tensor[(1, 58, 28, 28), float32] span=Conv_39_quant:0:0 */;
  %120 = expand_dims(%118, axis=0) /* ty=Tensor[(1, 58, 1, 1), float32] */;
  %121 = add(%119, %120) /* ty=Tensor[(1, 58, 28, 28), float32] */;
  %122 = qnn.quantize(%121, 0.0130238f /* ty=float32 span=381_Conv_39_QuantizeLinear.381_scale:0:0 */, 0 /* ty=int32 span=381_Conv_39_QuantizeLinear:0:0 */, out_dtype="uint8", axis=0) /* ty=Tensor[(1, 58, 28, 28), uint8] span=381_Conv_39_QuantizeLinear:0:0 */;
  %123 = qnn.dequantize(%122, 0.0130238f /* ty=float32 span=381_Conv_39_QuantizeLinear.381_scale:0:0 */, 0 /* ty=int32 span=381_Conv_42_DequantizeLinear:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(1, 58, 28, 28), float32] span=381_Conv_42_DequantizeLinear:0:0 */;
  %124 = qnn.dequantize(meta[relay.Constant][40] /* ty=Tensor[(58, 1, 3, 3), int8] span=ConvBnFusion_W_stage2.2.branch2.3.weight_DequantizeLinear.ConvBnFusion_W_stage2.2.branch2.3.weight_quantized:0:0 */, 0.0288551f /* ty=float32 span=ConvBnFusion_W_stage2.2.branch2.3.weight_DequantizeLinear.ConvBnFusion_W_stage2.2.branch2.3.weight_scale:0:0 */, 0 /* ty=int32 span=ConvBnFusion_W_stage2.2.branch2.3.weight_DequantizeLinear:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(58, 1, 3, 3), float32] span=ConvBnFusion_W_stage2.2.branch2.3.weight_DequantizeLinear:0:0 */;
  %125 = qnn.dequantize(meta[relay.Constant][41] /* ty=Tensor[(58), int32] span=ConvBnFusion_BN_B_stage2.2.branch2.4.bias_DequantizeLinear.ConvBnFusion_BN_B_stage2.2.branch2.4.bias_quantized:0:0 */, meta[relay.Constant][42] /* ty=Tensor[(1), float32] span=ConvBnFusion_BN_B_stage2.2.branch2.4.bias_DequantizeLinear.ConvBnFusion_BN_B_stage2.2.branch2.4.bias_scale:0:0 */, meta[relay.Constant][43] /* ty=Tensor[(1), int32] span=ConvBnFusion_BN_B_stage2.2.branch2.4.bias_DequantizeLinear:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(58), float32] span=ConvBnFusion_BN_B_stage2.2.branch2.4.bias_DequantizeLinear:0:0 */;
  %126 = expand_dims(%125, axis=1, num_newaxis=2) /* ty=Tensor[(58, 1, 1), float32] */;
  %127 = nn.conv2d(%123, %124, padding=[1, 1, 1, 1], groups=58, channels=58, kernel_size=[3, 3]) /* ty=Tensor[(1, 58, 28, 28), float32] span=Conv_42_quant:0:0 */;
  %128 = expand_dims(%126, axis=0) /* ty=Tensor[(1, 58, 1, 1), float32] */;
  %129 = add(%127, %128) /* ty=Tensor[(1, 58, 28, 28), float32] */;
  %130 = qnn.quantize(%129, 0.0422832f /* ty=float32 span=384_Conv_42_QuantizeLinear.384_scale:0:0 */, 127 /* ty=int32 span=384_Conv_42_QuantizeLinear:0:0 */, out_dtype="uint8", axis=0) /* ty=Tensor[(1, 58, 28, 28), uint8] span=384_Conv_42_QuantizeLinear:0:0 */;
  %131 = qnn.dequantize(%130, 0.0422832f /* ty=float32 span=384_Conv_42_QuantizeLinear.384_scale:0:0 */, 127 /* ty=int32 span=384_Conv_44_DequantizeLinear:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(1, 58, 28, 28), float32] span=384_Conv_44_DequantizeLinear:0:0 */;
  %132 = qnn.dequantize(meta[relay.Constant][44] /* ty=Tensor[(58, 58, 1, 1), int8] span=ConvBnFusion_W_stage2.2.branch2.5.weight_DequantizeLinear.ConvBnFusion_W_stage2.2.branch2.5.weight_quantized:0:0 */, 0.00632175f /* ty=float32 span=ConvBnFusion_W_stage2.2.branch2.5.weight_DequantizeLinear.ConvBnFusion_W_stage2.2.branch2.5.weight_scale:0:0 */, 0 /* ty=int32 span=ConvBnFusion_W_stage2.2.branch2.5.weight_DequantizeLinear:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(58, 58, 1, 1), float32] span=ConvBnFusion_W_stage2.2.branch2.5.weight_DequantizeLinear:0:0 */;
  %133 = qnn.dequantize(meta[relay.Constant][45] /* ty=Tensor[(58), int32] span=ConvBnFusion_BN_B_stage2.2.branch2.6.bias_DequantizeLinear.ConvBnFusion_BN_B_stage2.2.branch2.6.bias_quantized:0:0 */, meta[relay.Constant][46] /* ty=Tensor[(1), float32] span=ConvBnFusion_BN_B_stage2.2.branch2.6.bias_DequantizeLinear.ConvBnFusion_BN_B_stage2.2.branch2.6.bias_scale:0:0 */, meta[relay.Constant][47] /* ty=Tensor[(1), int32] span=ConvBnFusion_BN_B_stage2.2.branch2.6.bias_DequantizeLinear:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(58), float32] span=ConvBnFusion_BN_B_stage2.2.branch2.6.bias_DequantizeLinear:0:0 */;
  %134 = expand_dims(%133, axis=1, num_newaxis=2) /* ty=Tensor[(58, 1, 1), float32] */;
  %135 = nn.conv2d(%131, %132, padding=[0, 0, 0, 0], channels=58, kernel_size=[1, 1]) /* ty=Tensor[(1, 58, 28, 28), float32] span=Conv_44_quant:0:0 */;
  %136 = expand_dims(%134, axis=0) /* ty=Tensor[(1, 58, 1, 1), float32] */;
  %137 = add(%135, %136) /* ty=Tensor[(1, 58, 28, 28), float32] */;
  %138 = qnn.quantize(%137, 0.0171351f /* ty=float32 span=386_Conv_44_QuantizeLinear.386_scale:0:0 */, 0 /* ty=int32 span=386_Conv_44_QuantizeLinear:0:0 */, out_dtype="uint8", axis=0) /* ty=Tensor[(1, 58, 28, 28), uint8] span=386_Conv_44_QuantizeLinear:0:0 */;
  %139 = qnn.dequantize(%112, 0.0385724f /* ty=float32 span=372_Concat_32_QuantizeLinear.372_scale:0:0 */, 0 /* ty=int32 span=378_Concat_47_DequantizeLinear:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(1, 58, 28, 28), float32] span=378_Concat_47_DequantizeLinear:0:0 */;
  %140 = qnn.dequantize(%138, 0.0171351f /* ty=float32 span=386_Conv_44_QuantizeLinear.386_scale:0:0 */, 0 /* ty=int32 span=386_Concat_47_DequantizeLinear:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(1, 58, 28, 28), float32] span=386_Concat_47_DequantizeLinear:0:0 */;
  %141 = (%139, %140) /* ty=(Tensor[(1, 58, 28, 28), float32], Tensor[(1, 58, 28, 28), float32]) span=Concat_47_quant:0:0 */;
  %142 = concatenate(%141, axis=1) /* ty=Tensor[(1, 116, 28, 28), float32] span=Concat_47_quant:0:0 */;
  %143 = qnn.quantize(%142, 0.0385724f /* ty=float32 span=388_Concat_47_QuantizeLinear.388_scale:0:0 */, 0 /* ty=int32 span=388_Concat_47_QuantizeLinear:0:0 */, out_dtype="uint8", axis=0) /* ty=Tensor[(1, 116, 28, 28), uint8] span=388_Concat_47_QuantizeLinear:0:0 */;
  %144 = qnn.dequantize(%143, 0.0385724f /* ty=float32 span=388_Concat_47_QuantizeLinear.388_scale:0:0 */, 0 /* ty=int32 span=388_Reshape_49_DequantizeLinear:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(1, 116, 28, 28), float32] span=388_Reshape_49_DequantizeLinear:0:0 */;
  %145 = reshape(%144, newshape=[1, 2, 58, 28, 28]) /* ty=Tensor[(1, 2, 58, 28, 28), float32] span=Reshape_49_quant:0:0 */;
  %146 = qnn.quantize(%145, 0.0385724f /* ty=float32 span=388_Concat_47_QuantizeLinear.388_scale:0:0 */, 0 /* ty=int32 span=390_Reshape_49_QuantizeLinear:0:0 */, out_dtype="uint8", axis=0) /* ty=Tensor[(1, 2, 58, 28, 28), uint8] span=390_Reshape_49_QuantizeLinear:0:0 */;
  %147 = qnn.dequantize(%146, 0.0385724f /* ty=float32 span=388_Concat_47_QuantizeLinear.388_scale:0:0 */, 0 /* ty=int32 span=390_Transpose_50_DequantizeLinear:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(1, 2, 58, 28, 28), float32] span=390_Transpose_50_DequantizeLinear:0:0 */;
  %148 = transpose(%147, axes=[0, 2, 1, 3, 4]) /* ty=Tensor[(1, 58, 2, 28, 28), float32] span=Transpose_50_quant:0:0 */;
  %149 = qnn.quantize(%148, 0.0385724f /* ty=float32 span=388_Concat_47_QuantizeLinear.388_scale:0:0 */, 0 /* ty=int32 span=391_Transpose_50_QuantizeLinear:0:0 */, out_dtype="uint8", axis=0) /* ty=Tensor[(1, 58, 2, 28, 28), uint8] span=391_Transpose_50_QuantizeLinear:0:0 */;
  %150 = qnn.dequantize(%149, 0.0385724f /* ty=float32 span=388_Concat_47_QuantizeLinear.388_scale:0:0 */, 0 /* ty=int32 span=391_Reshape_52_DequantizeLinear:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(1, 58, 2, 28, 28), float32] span=391_Reshape_52_DequantizeLinear:0:0 */;
  %151 = reshape(%150, newshape=[1, -1, 28, 28]) /* ty=Tensor[(1, 116, 28, 28), float32] span=Reshape_52_quant:0:0 */;
  %152 = qnn.quantize(%151, 0.0385724f /* ty=float32 span=388_Concat_47_QuantizeLinear.388_scale:0:0 */, 0 /* ty=int32 span=393_Reshape_52_QuantizeLinear:0:0 */, out_dtype="uint8", axis=0) /* ty=Tensor[(1, 116, 28, 28), uint8] span=393_Reshape_52_QuantizeLinear:0:0 */;
  %153 = qnn.dequantize(%152, 0.0385724f /* ty=float32 span=388_Concat_47_QuantizeLinear.388_scale:0:0 */, 0 /* ty=int32 span=393_Split_53_DequantizeLinear:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(1, 116, 28, 28), float32] span=393_Split_53_DequantizeLinear:0:0 */;
  %154 = split(%153, indices_or_sections=[58], axis=1) /* ty=(Tensor[(1, 58, 28, 28), float32], Tensor[(1, 58, 28, 28), float32]) span=Split_53_quant:0:0 */;
  %155 = %154.0 /* ty=Tensor[(1, 58, 28, 28), float32] */;
  %156 = qnn.quantize(%155, 0.0385724f /* ty=float32 span=388_Concat_47_QuantizeLinear.388_scale:0:0 */, 0 /* ty=int32 span=394_Split_53_QuantizeLinear:0:0 */, out_dtype="uint8", axis=0) /* ty=Tensor[(1, 58, 28, 28), uint8] span=394_Split_53_QuantizeLinear:0:0 */;
  %157 = %154.1 /* ty=Tensor[(1, 58, 28, 28), float32] */;
  %158 = qnn.quantize(%157, 0.0385724f /* ty=float32 span=388_Concat_47_QuantizeLinear.388_scale:0:0 */, 0 /* ty=int32 span=395_Split_53_QuantizeLinear:0:0 */, out_dtype="uint8", axis=0) /* ty=Tensor[(1, 58, 28, 28), uint8] span=395_Split_53_QuantizeLinear:0:0 */;
  %159 = qnn.dequantize(%158, 0.0385724f /* ty=float32 span=388_Concat_47_QuantizeLinear.388_scale:0:0 */, 0 /* ty=int32 span=395_Conv_54_DequantizeLinear:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(1, 58, 28, 28), float32] span=395_Conv_54_DequantizeLinear:0:0 */;
  %160 = qnn.dequantize(meta[relay.Constant][48] /* ty=Tensor[(58, 58, 1, 1), int8] span=ConvBnFusion_W_stage2.3.branch2.0.weight_DequantizeLinear.ConvBnFusion_W_stage2.3.branch2.0.weight_quantized:0:0 */, 0.00784321f /* ty=float32 span=ConvBnFusion_W_stage2.3.branch2.0.weight_DequantizeLinear.ConvBnFusion_W_stage2.3.branch2.0.weight_scale:0:0 */, 0 /* ty=int32 span=ConvBnFusion_W_stage2.3.branch2.0.weight_DequantizeLinear:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(58, 58, 1, 1), float32] span=ConvBnFusion_W_stage2.3.branch2.0.weight_DequantizeLinear:0:0 */;
  %161 = qnn.dequantize(meta[relay.Constant][49] /* ty=Tensor[(58), int32] span=ConvBnFusion_BN_B_stage2.3.branch2.1.bias_DequantizeLinear.ConvBnFusion_BN_B_stage2.3.branch2.1.bias_quantized:0:0 */, meta[relay.Constant][50] /* ty=Tensor[(1), float32] span=ConvBnFusion_BN_B_stage2.3.branch2.1.bias_DequantizeLinear.ConvBnFusion_BN_B_stage2.3.branch2.1.bias_scale:0:0 */, meta[relay.Constant][51] /* ty=Tensor[(1), int32] span=ConvBnFusion_BN_B_stage2.3.branch2.1.bias_DequantizeLinear:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(58), float32] span=ConvBnFusion_BN_B_stage2.3.branch2.1.bias_DequantizeLinear:0:0 */;
  %162 = expand_dims(%161, axis=1, num_newaxis=2) /* ty=Tensor[(58, 1, 1), float32] */;
  %163 = nn.conv2d(%159, %160, padding=[0, 0, 0, 0], channels=58, kernel_size=[1, 1]) /* ty=Tensor[(1, 58, 28, 28), float32] span=Conv_54_quant:0:0 */;
  %164 = expand_dims(%162, axis=0) /* ty=Tensor[(1, 58, 1, 1), float32] */;
  %165 = add(%163, %164) /* ty=Tensor[(1, 58, 28, 28), float32] */;
  %166 = qnn.quantize(%165, 0.0176652f /* ty=float32 span=397_Conv_54_QuantizeLinear.397_scale:0:0 */, 0 /* ty=int32 span=397_Conv_54_QuantizeLinear:0:0 */, out_dtype="uint8", axis=0) /* ty=Tensor[(1, 58, 28, 28), uint8] span=397_Conv_54_QuantizeLinear:0:0 */;
  %167 = qnn.dequantize(%166, 0.0176652f /* ty=float32 span=397_Conv_54_QuantizeLinear.397_scale:0:0 */, 0 /* ty=int32 span=397_Conv_57_DequantizeLinear:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(1, 58, 28, 28), float32] span=397_Conv_57_DequantizeLinear:0:0 */;
  %168 = qnn.dequantize(meta[relay.Constant][52] /* ty=Tensor[(58, 1, 3, 3), int8] span=ConvBnFusion_W_stage2.3.branch2.3.weight_DequantizeLinear.ConvBnFusion_W_stage2.3.branch2.3.weight_quantized:0:0 */, 0.0410683f /* ty=float32 span=ConvBnFusion_W_stage2.3.branch2.3.weight_DequantizeLinear.ConvBnFusion_W_stage2.3.branch2.3.weight_scale:0:0 */, 0 /* ty=int32 span=ConvBnFusion_W_stage2.3.branch2.3.weight_DequantizeLinear:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(58, 1, 3, 3), float32] span=ConvBnFusion_W_stage2.3.branch2.3.weight_DequantizeLinear:0:0 */;
  %169 = qnn.dequantize(meta[relay.Constant][53] /* ty=Tensor[(58), int32] span=ConvBnFusion_BN_B_stage2.3.branch2.4.bias_DequantizeLinear.ConvBnFusion_BN_B_stage2.3.branch2.4.bias_quantized:0:0 */, meta[relay.Constant][54] /* ty=Tensor[(1), float32] span=ConvBnFusion_BN_B_stage2.3.branch2.4.bias_DequantizeLinear.ConvBnFusion_BN_B_stage2.3.branch2.4.bias_scale:0:0 */, meta[relay.Constant][55] /* ty=Tensor[(1), int32] span=ConvBnFusion_BN_B_stage2.3.branch2.4.bias_DequantizeLinear:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(58), float32] span=ConvBnFusion_BN_B_stage2.3.branch2.4.bias_DequantizeLinear:0:0 */;
  %170 = expand_dims(%169, axis=1, num_newaxis=2) /* ty=Tensor[(58, 1, 1), float32] */;
  %171 = nn.conv2d(%167, %168, padding=[1, 1, 1, 1], groups=58, channels=58, kernel_size=[3, 3]) /* ty=Tensor[(1, 58, 28, 28), float32] span=Conv_57_quant:0:0 */;
  %172 = expand_dims(%170, axis=0) /* ty=Tensor[(1, 58, 1, 1), float32] */;
  %173 = add(%171, %172) /* ty=Tensor[(1, 58, 28, 28), float32] */;
  %174 = qnn.quantize(%173, 0.0560246f /* ty=float32 span=400_Conv_57_QuantizeLinear.400_scale:0:0 */, 131 /* ty=int32 span=400_Conv_57_QuantizeLinear:0:0 */, out_dtype="uint8", axis=0) /* ty=Tensor[(1, 58, 28, 28), uint8] span=400_Conv_57_QuantizeLinear:0:0 */;
  %175 = qnn.dequantize(%174, 0.0560246f /* ty=float32 span=400_Conv_57_QuantizeLinear.400_scale:0:0 */, 131 /* ty=int32 span=400_Conv_59_DequantizeLinear:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(1, 58, 28, 28), float32] span=400_Conv_59_DequantizeLinear:0:0 */;
  %176 = qnn.dequantize(meta[relay.Constant][56] /* ty=Tensor[(58, 58, 1, 1), int8] span=ConvBnFusion_W_stage2.3.branch2.5.weight_DequantizeLinear.ConvBnFusion_W_stage2.3.branch2.5.weight_quantized:0:0 */, 0.00603677f /* ty=float32 span=ConvBnFusion_W_stage2.3.branch2.5.weight_DequantizeLinear.ConvBnFusion_W_stage2.3.branch2.5.weight_scale:0:0 */, 0 /* ty=int32 span=ConvBnFusion_W_stage2.3.branch2.5.weight_DequantizeLinear:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(58, 58, 1, 1), float32] span=ConvBnFusion_W_stage2.3.branch2.5.weight_DequantizeLinear:0:0 */;
  %177 = qnn.dequantize(meta[relay.Constant][57] /* ty=Tensor[(58), int32] span=ConvBnFusion_BN_B_stage2.3.branch2.6.bias_DequantizeLinear.ConvBnFusion_BN_B_stage2.3.branch2.6.bias_quantized:0:0 */, meta[relay.Constant][58] /* ty=Tensor[(1), float32] span=ConvBnFusion_BN_B_stage2.3.branch2.6.bias_DequantizeLinear.ConvBnFusion_BN_B_stage2.3.branch2.6.bias_scale:0:0 */, meta[relay.Constant][59] /* ty=Tensor[(1), int32] span=ConvBnFusion_BN_B_stage2.3.branch2.6.bias_DequantizeLinear:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(58), float32] span=ConvBnFusion_BN_B_stage2.3.branch2.6.bias_DequantizeLinear:0:0 */;
  %178 = expand_dims(%177, axis=1, num_newaxis=2) /* ty=Tensor[(58, 1, 1), float32] */;
  %179 = nn.conv2d(%175, %176, padding=[0, 0, 0, 0], channels=58, kernel_size=[1, 1]) /* ty=Tensor[(1, 58, 28, 28), float32] span=Conv_59_quant:0:0 */;
  %180 = expand_dims(%178, axis=0) /* ty=Tensor[(1, 58, 1, 1), float32] */;
  %181 = add(%179, %180) /* ty=Tensor[(1, 58, 28, 28), float32] */;
  %182 = qnn.quantize(%181, 0.0155579f /* ty=float32 span=402_Conv_59_QuantizeLinear.402_scale:0:0 */, 0 /* ty=int32 span=402_Conv_59_QuantizeLinear:0:0 */, out_dtype="uint8", axis=0) /* ty=Tensor[(1, 58, 28, 28), uint8] span=402_Conv_59_QuantizeLinear:0:0 */;
  %183 = qnn.dequantize(%156, 0.0385724f /* ty=float32 span=388_Concat_47_QuantizeLinear.388_scale:0:0 */, 0 /* ty=int32 span=394_Concat_62_DequantizeLinear:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(1, 58, 28, 28), float32] span=394_Concat_62_DequantizeLinear:0:0 */;
  %184 = qnn.dequantize(%182, 0.0155579f /* ty=float32 span=402_Conv_59_QuantizeLinear.402_scale:0:0 */, 0 /* ty=int32 span=402_Concat_62_DequantizeLinear:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(1, 58, 28, 28), float32] span=402_Concat_62_DequantizeLinear:0:0 */;
  %185 = (%183, %184) /* ty=(Tensor[(1, 58, 28, 28), float32], Tensor[(1, 58, 28, 28), float32]) span=Concat_62_quant:0:0 */;
  %186 = concatenate(%185, axis=1) /* ty=Tensor[(1, 116, 28, 28), float32] span=Concat_62_quant:0:0 */;
  %187 = qnn.quantize(%186, 0.0246652f /* ty=float32 span=404_Concat_62_QuantizeLinear.404_scale:0:0 */, 0 /* ty=int32 span=404_Concat_62_QuantizeLinear:0:0 */, out_dtype="uint8", axis=0) /* ty=Tensor[(1, 116, 28, 28), uint8] span=404_Concat_62_QuantizeLinear:0:0 */;
  %188 = qnn.dequantize(%187, 0.0246652f /* ty=float32 span=404_Concat_62_QuantizeLinear.404_scale:0:0 */, 0 /* ty=int32 span=404_Reshape_64_DequantizeLinear:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(1, 116, 28, 28), float32] span=404_Reshape_64_DequantizeLinear:0:0 */;
  %189 = reshape(%188, newshape=[1, 2, 58, 28, 28]) /* ty=Tensor[(1, 2, 58, 28, 28), float32] span=Reshape_64_quant:0:0 */;
  %190 = qnn.quantize(%189, 0.0246652f /* ty=float32 span=404_Concat_62_QuantizeLinear.404_scale:0:0 */, 0 /* ty=int32 span=406_Reshape_64_QuantizeLinear:0:0 */, out_dtype="uint8", axis=0) /* ty=Tensor[(1, 2, 58, 28, 28), uint8] span=406_Reshape_64_QuantizeLinear:0:0 */;
  %191 = qnn.dequantize(%190, 0.0246652f /* ty=float32 span=404_Concat_62_QuantizeLinear.404_scale:0:0 */, 0 /* ty=int32 span=406_Transpose_65_DequantizeLinear:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(1, 2, 58, 28, 28), float32] span=406_Transpose_65_DequantizeLinear:0:0 */;
  %192 = transpose(%191, axes=[0, 2, 1, 3, 4]) /* ty=Tensor[(1, 58, 2, 28, 28), float32] span=Transpose_65_quant:0:0 */;
  %193 = qnn.quantize(%192, 0.0246652f /* ty=float32 span=404_Concat_62_QuantizeLinear.404_scale:0:0 */, 0 /* ty=int32 span=407_Transpose_65_QuantizeLinear:0:0 */, out_dtype="uint8", axis=0) /* ty=Tensor[(1, 58, 2, 28, 28), uint8] span=407_Transpose_65_QuantizeLinear:0:0 */;
  %194 = qnn.dequantize(%193, 0.0246652f /* ty=float32 span=404_Concat_62_QuantizeLinear.404_scale:0:0 */, 0 /* ty=int32 span=407_Reshape_67_DequantizeLinear:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(1, 58, 2, 28, 28), float32] span=407_Reshape_67_DequantizeLinear:0:0 */;
  %195 = reshape(%194, newshape=[1, -1, 28, 28]) /* ty=Tensor[(1, 116, 28, 28), float32] span=Reshape_67_quant:0:0 */;
  %196 = qnn.quantize(%195, 0.0246652f /* ty=float32 span=404_Concat_62_QuantizeLinear.404_scale:0:0 */, 0 /* ty=int32 span=409_Reshape_67_QuantizeLinear:0:0 */, out_dtype="uint8", axis=0) /* ty=Tensor[(1, 116, 28, 28), uint8] span=409_Reshape_67_QuantizeLinear:0:0 */;
  %197 = qnn.dequantize(%196, 0.0246652f /* ty=float32 span=404_Concat_62_QuantizeLinear.404_scale:0:0 */, 0 /* ty=int32 span=409_Conv_73_DequantizeLinear:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(1, 116, 28, 28), float32] span=409_Conv_73_DequantizeLinear:0:0 */;
  %198 = qnn.dequantize(meta[relay.Constant][60] /* ty=Tensor[(116, 1, 3, 3), int8] span=ConvBnFusion_W_stage3.0.branch1.0.weight_DequantizeLinear.ConvBnFusion_W_stage3.0.branch1.0.weight_quantized:0:0 */, 0.00931095f /* ty=float32 span=ConvBnFusion_W_stage3.0.branch1.0.weight_DequantizeLinear.ConvBnFusion_W_stage3.0.branch1.0.weight_scale:0:0 */, 0 /* ty=int32 span=ConvBnFusion_W_stage3.0.branch1.0.weight_DequantizeLinear:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(116, 1, 3, 3), float32] span=ConvBnFusion_W_stage3.0.branch1.0.weight_DequantizeLinear:0:0 */;
  %199 = qnn.dequantize(meta[relay.Constant][61] /* ty=Tensor[(116), int32] span=ConvBnFusion_BN_B_stage3.0.branch1.1.bias_DequantizeLinear.ConvBnFusion_BN_B_stage3.0.branch1.1.bias_quantized:0:0 */, meta[relay.Constant][62] /* ty=Tensor[(1), float32] span=ConvBnFusion_BN_B_stage3.0.branch1.1.bias_DequantizeLinear.ConvBnFusion_BN_B_stage3.0.branch1.1.bias_scale:0:0 */, meta[relay.Constant][63] /* ty=Tensor[(1), int32] span=ConvBnFusion_BN_B_stage3.0.branch1.1.bias_DequantizeLinear:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(116), float32] span=ConvBnFusion_BN_B_stage3.0.branch1.1.bias_DequantizeLinear:0:0 */;
  %200 = expand_dims(%199, axis=1, num_newaxis=2) /* ty=Tensor[(116, 1, 1), float32] */;
  %201 = nn.conv2d(%197, %198, strides=[2, 2], padding=[1, 1, 1, 1], groups=116, channels=116, kernel_size=[3, 3]) /* ty=Tensor[(1, 116, 14, 14), float32] span=Conv_68_quant:0:0 */;
  %202 = expand_dims(%200, axis=0) /* ty=Tensor[(1, 116, 1, 1), float32] */;
  %203 = add(%201, %202) /* ty=Tensor[(1, 116, 14, 14), float32] */;
  %204 = qnn.quantize(%203, 0.0525923f /* ty=float32 span=411_Conv_68_QuantizeLinear.411_scale:0:0 */, 112 /* ty=int32 span=411_Conv_68_QuantizeLinear:0:0 */, out_dtype="uint8", axis=0) /* ty=Tensor[(1, 116, 14, 14), uint8] span=411_Conv_68_QuantizeLinear:0:0 */;
