def @main(%sub_7: Tensor[(1, 513, 513, 3), float32] /* ty=Tensor[(1, 513, 513, 3), float32] span=sub_7_int8.sub_7:0:0 */) -> Tensor[(1, 513, 513, 21), float32] {
  %0 = qnn.quantize(%sub_7, 0.00784313f /* ty=float32 span=sub_7_int8.scale__99:0:0 */, 0 /* ty=int32 span=sub_7_int8:0:0 */, out_dtype="int8", axis=1) /* ty=Tensor[(1, 513, 513, 3), int8] span=sub_7_int8:0:0 */;
  %1 = transpose(%0, axes=[0, 3, 1, 2]) /* ty=Tensor[(1, 3, 513, 513), int8] span=tfl.conv_2d_prequant__265:0:0 */;
  %2 = qnn.dequantize(%1, 0.00784313f /* ty=float32 span=sub_7_int8.scale__99:0:0 */, 0 /* ty=int32 span=tfl.conv_2d_prequant__265_DequantizeLinear__1324:0:0 */, out_dtype="float32", axis=1) /* ty=Tensor[(1, 3, 513, 513), float32] span=tfl.conv_2d_prequant__265_DequantizeLinear__1324:0:0 */;
  %3 = qnn.dequantize(meta[relay.Constant][0] /* ty=Tensor[(16, 3, 3, 3), int8] span=std.constant_dequant.std.constant:0:0 */, meta[relay.Constant][1] /* ty=Tensor[(16), float32] span=std.constant_dequant.scale__263:0:0 */, meta[relay.Constant][2] /* ty=Tensor[(16), int32] span=std.constant_dequant:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(16, 3, 3, 3), float32] span=std.constant_dequant:0:0 */;
  %4 = qnn.dequantize(meta[relay.Constant][3] /* ty=Tensor[(16), int32] span=std.constant37_dequant.std.constant37:0:0 */, meta[relay.Constant][4] /* ty=Tensor[(16), float32] span=std.constant37_dequant.scale__201:0:0 */, meta[relay.Constant][5] /* ty=Tensor[(16), int32] span=std.constant37_dequant:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(16), float32] span=std.constant37_dequant:0:0 */;
  %5 = expand_dims(%4, axis=1, num_newaxis=2) /* ty=Tensor[(16, 1, 1), float32] */;
  %6 = nn.conv2d(%2, %3, strides=[2, 2], padding=[1, 1, 1, 1], channels=16, kernel_size=[3, 3]) /* ty=Tensor[(1, 16, 257, 257), float32] span=tfl.conv_2d_prequant:0:0 */;
  %7 = expand_dims(%5, axis=0) /* ty=Tensor[(1, 16, 1, 1), float32] */;
  %8 = add(%6, %7) /* ty=Tensor[(1, 16, 257, 257), float32] */;
  %9 = clip(%8, a_min=0f, a_max=6f) /* ty=Tensor[(1, 16, 257, 257), float32] span=Relu6__5:0:0 */;
  %10 = qnn.quantize(%9, 0.0235294f /* ty=float32 span=tfl.conv_2d_quantize.scale__553:0:0 */, -128 /* ty=int32 span=tfl.conv_2d_quantize:0:0 */, out_dtype="int8", axis=1) /* ty=Tensor[(1, 16, 257, 257), int8] span=tfl.conv_2d_quantize:0:0 */;
  %11 = qnn.dequantize(%10, 0.0235294f /* ty=float32 span=tfl.conv_2d_quantize.scale__553:0:0 */, -128 /* ty=int32 span=tfl.depthwise_conv_2d_prequant__356_DequantizeLinear__1417:0:0 */, out_dtype="float32", axis=1) /* ty=Tensor[(1, 16, 257, 257), float32] span=tfl.depthwise_conv_2d_prequant__356_DequantizeLinear__1417:0:0 */;
  %12 = qnn.dequantize(meta[relay.Constant][6] /* ty=Tensor[(16, 1, 3, 3), int8] span=std.constant38_dequant.std.constant38:0:0 */, meta[relay.Constant][7] /* ty=Tensor[(16), float32] span=std.constant38_dequant.scale__199:0:0 */, meta[relay.Constant][8] /* ty=Tensor[(16), int32] span=std.constant38_dequant:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(16, 1, 3, 3), float32] span=std.constant38_dequant:0:0 */;
  %13 = qnn.dequantize(meta[relay.Constant][9] /* ty=Tensor[(16), int32] span=MobilenetV2/expanded_conv/depthwise/BatchNorm/FusedBatchNorm_dequant.MobilenetV2/expanded_conv/depthwise/BatchNorm/FusedBatchNorm:0:0 */, meta[relay.Constant][10] /* ty=Tensor[(16), float32] span=MobilenetV2/expanded_conv/depthwise/BatchNorm/FusedBatchNorm_dequant.scale__354:0:0 */, meta[relay.Constant][11] /* ty=Tensor[(16), int32] span=MobilenetV2/expanded_conv/depthwise/BatchNorm/FusedBatchNorm_dequant:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(16), float32] span=MobilenetV2/expanded_conv/depthwise/BatchNorm/FusedBatchNorm_dequant:0:0 */;
  %14 = expand_dims(%13, axis=1, num_newaxis=2) /* ty=Tensor[(16, 1, 1), float32] */;
  %15 = nn.conv2d(%11, %12, padding=[1, 1, 1, 1], groups=16, channels=16, kernel_size=[3, 3]) /* ty=Tensor[(1, 16, 257, 257), float32] span=tfl.depthwise_conv_2d_prequant:0:0 */;
  %16 = expand_dims(%14, axis=0) /* ty=Tensor[(1, 16, 1, 1), float32] */;
  %17 = add(%15, %16) /* ty=Tensor[(1, 16, 257, 257), float32] */;
  %18 = clip(%17, a_min=0f, a_max=6f) /* ty=Tensor[(1, 16, 257, 257), float32] span=Relu6__7:0:0 */;
  %19 = qnn.quantize(%18, 0.0235294f /* ty=float32 span=tfl.conv_2d_quantize.scale__553:0:0 */, -128 /* ty=int32 span=tfl.depthwise_conv_2d_quantize:0:0 */, out_dtype="int8", axis=1) /* ty=Tensor[(1, 16, 257, 257), int8] span=tfl.depthwise_conv_2d_quantize:0:0 */;
  %20 = qnn.dequantize(%19, 0.0235294f /* ty=float32 span=tfl.conv_2d_quantize.scale__553:0:0 */, -128 /* ty=int32 span=tfl.conv_2d1_prequant__367_DequantizeLinear__1470:0:0 */, out_dtype="float32", axis=1) /* ty=Tensor[(1, 16, 257, 257), float32] span=tfl.conv_2d1_prequant__367_DequantizeLinear__1470:0:0 */;
  %21 = qnn.dequantize(meta[relay.Constant][12] /* ty=Tensor[(8, 16, 1, 1), int8] span=std.constant1_dequant.std.constant1:0:0 */, meta[relay.Constant][13] /* ty=Tensor[(8), float32] span=std.constant1_dequant.scale__261:0:0 */, meta[relay.Constant][14] /* ty=Tensor[(8), int32] span=std.constant1_dequant:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(8, 16, 1, 1), float32] span=std.constant1_dequant:0:0 */;
  %22 = qnn.dequantize(meta[relay.Constant][15] /* ty=Tensor[(8), int32] span=std.constant39_dequant.std.constant39:0:0 */, meta[relay.Constant][16] /* ty=Tensor[(8), float32] span=std.constant39_dequant.scale__197:0:0 */, meta[relay.Constant][17] /* ty=Tensor[(8), int32] span=std.constant39_dequant:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(8), float32] span=std.constant39_dequant:0:0 */;
  %23 = expand_dims(%22, axis=1, num_newaxis=2) /* ty=Tensor[(8, 1, 1), float32] */;
  %24 = nn.conv2d(%20, %21, padding=[0, 0, 0, 0], channels=8, kernel_size=[1, 1]) /* ty=Tensor[(1, 8, 257, 257), float32] span=tfl.conv_2d1_prequant:0:0 */;
  %25 = expand_dims(%23, axis=0) /* ty=Tensor[(1, 8, 1, 1), float32] */;
  %26 = add(%24, %25) /* ty=Tensor[(1, 8, 257, 257), float32] */;
  %27 = qnn.quantize(%26, 0.389598f /* ty=float32 span=tfl.conv_2d1_quantize.scale__370:0:0 */, 2 /* ty=int32 span=tfl.conv_2d1_quantize:0:0 */, out_dtype="int8", axis=1) /* ty=Tensor[(1, 8, 257, 257), int8] span=tfl.conv_2d1_quantize:0:0 */;
  %28 = qnn.dequantize(%27, 0.389598f /* ty=float32 span=tfl.conv_2d1_quantize.scale__370:0:0 */, 2 /* ty=int32 span=tfl.conv_2d2_prequant__374_DequantizeLinear__1438:0:0 */, out_dtype="float32", axis=1) /* ty=Tensor[(1, 8, 257, 257), float32] span=tfl.conv_2d2_prequant__374_DequantizeLinear__1438:0:0 */;
  %29 = qnn.dequantize(meta[relay.Constant][18] /* ty=Tensor[(48, 8, 1, 1), int8] span=std.constant2_dequant.std.constant2:0:0 */, meta[relay.Constant][19] /* ty=Tensor[(48), float32] span=std.constant2_dequant.scale__239:0:0 */, meta[relay.Constant][20] /* ty=Tensor[(48), int32] span=std.constant2_dequant:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(48, 8, 1, 1), float32] span=std.constant2_dequant:0:0 */;
  %30 = qnn.dequantize(meta[relay.Constant][21] /* ty=Tensor[(48), int32] span=std.constant40_dequant.std.constant40:0:0 */, meta[relay.Constant][22] /* ty=Tensor[(48), float32] span=std.constant40_dequant.scale__193:0:0 */, meta[relay.Constant][23] /* ty=Tensor[(48), int32] span=std.constant40_dequant:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(48), float32] span=std.constant40_dequant:0:0 */;
  %31 = expand_dims(%30, axis=1, num_newaxis=2) /* ty=Tensor[(48, 1, 1), float32] */;
  %32 = nn.conv2d(%28, %29, padding=[0, 0, 0, 0], channels=48, kernel_size=[1, 1]) /* ty=Tensor[(1, 48, 257, 257), float32] span=tfl.conv_2d2_prequant:0:0 */;
  %33 = expand_dims(%31, axis=0) /* ty=Tensor[(1, 48, 1, 1), float32] */;
  %34 = add(%32, %33) /* ty=Tensor[(1, 48, 257, 257), float32] */;
  %35 = clip(%34, a_min=0f, a_max=6f) /* ty=Tensor[(1, 48, 257, 257), float32] span=Relu6__10:0:0 */;
  %36 = qnn.quantize(%35, 0.0235294f /* ty=float32 span=tfl.conv_2d_quantize.scale__553:0:0 */, -128 /* ty=int32 span=tfl.conv_2d2_quantize:0:0 */, out_dtype="int8", axis=1) /* ty=Tensor[(1, 48, 257, 257), int8] span=tfl.conv_2d2_quantize:0:0 */;
  %37 = qnn.dequantize(%36, 0.0235294f /* ty=float32 span=tfl.conv_2d_quantize.scale__553:0:0 */, -128 /* ty=int32 span=tfl.depthwise_conv_2d1_prequant__383_DequantizeLinear__1410:0:0 */, out_dtype="float32", axis=1) /* ty=Tensor[(1, 48, 257, 257), float32] span=tfl.depthwise_conv_2d1_prequant__383_DequantizeLinear__1410:0:0 */;
  %38 = qnn.dequantize(meta[relay.Constant][24] /* ty=Tensor[(48, 1, 3, 3), int8] span=std.constant41_dequant.std.constant41:0:0 */, meta[relay.Constant][25] /* ty=Tensor[(48), float32] span=std.constant41_dequant.scale__191:0:0 */, meta[relay.Constant][26] /* ty=Tensor[(48), int32] span=std.constant41_dequant:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(48, 1, 3, 3), float32] span=std.constant41_dequant:0:0 */;
  %39 = qnn.dequantize(meta[relay.Constant][27] /* ty=Tensor[(48), int32] span=MobilenetV2/expanded_conv_1/depthwise/BatchNorm/FusedBatchNorm_dequant.MobilenetV2/expanded_conv_1/depthwise/BatchNorm/FusedBatchNorm:0:0 */, meta[relay.Constant][28] /* ty=Tensor[(48), float32] span=MobilenetV2/expanded_conv_1/depthwise/BatchNorm/FusedBatchNorm_dequant.scale__352:0:0 */, meta[relay.Constant][29] /* ty=Tensor[(48), int32] span=MobilenetV2/expanded_conv_1/depthwise/BatchNorm/FusedBatchNorm_dequant:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(48), float32] span=MobilenetV2/expanded_conv_1/depthwise/BatchNorm/FusedBatchNorm_dequant:0:0 */;
  %40 = expand_dims(%39, axis=1, num_newaxis=2) /* ty=Tensor[(48, 1, 1), float32] */;
  %41 = nn.conv2d(%37, %38, strides=[2, 2], padding=[1, 1, 1, 1], groups=48, channels=48, kernel_size=[3, 3]) /* ty=Tensor[(1, 48, 129, 129), float32] span=tfl.depthwise_conv_2d1_prequant:0:0 */;
  %42 = expand_dims(%40, axis=0) /* ty=Tensor[(1, 48, 1, 1), float32] */;
  %43 = add(%41, %42) /* ty=Tensor[(1, 48, 129, 129), float32] */;
  %44 = clip(%43, a_min=0f, a_max=6f) /* ty=Tensor[(1, 48, 129, 129), float32] span=Relu6__12:0:0 */;
  %45 = qnn.quantize(%44, 0.0235294f /* ty=float32 span=tfl.conv_2d_quantize.scale__553:0:0 */, -128 /* ty=int32 span=tfl.depthwise_conv_2d1_quantize:0:0 */, out_dtype="int8", axis=1) /* ty=Tensor[(1, 48, 129, 129), int8] span=tfl.depthwise_conv_2d1_quantize:0:0 */;
  %46 = qnn.dequantize(%45, 0.0235294f /* ty=float32 span=tfl.conv_2d_quantize.scale__553:0:0 */, -128 /* ty=int32 span=tfl.conv_2d3_prequant__394_DequantizeLinear__1445:0:0 */, out_dtype="float32", axis=1) /* ty=Tensor[(1, 48, 129, 129), float32] span=tfl.conv_2d3_prequant__394_DequantizeLinear__1445:0:0 */;
  %47 = qnn.dequantize(meta[relay.Constant][30] /* ty=Tensor[(12, 48, 1, 1), int8] span=std.constant3_dequant.std.constant3:0:0 */, meta[relay.Constant][31] /* ty=Tensor[(12), float32] span=std.constant3_dequant.scale__217:0:0 */, meta[relay.Constant][32] /* ty=Tensor[(12), int32] span=std.constant3_dequant:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(12, 48, 1, 1), float32] span=std.constant3_dequant:0:0 */;
  %48 = qnn.dequantize(meta[relay.Constant][33] /* ty=Tensor[(12), int32] span=std.constant42_dequant.std.constant42:0:0 */, meta[relay.Constant][34] /* ty=Tensor[(12), float32] span=std.constant42_dequant.scale__189:0:0 */, meta[relay.Constant][35] /* ty=Tensor[(12), int32] span=std.constant42_dequant:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(12), float32] span=std.constant42_dequant:0:0 */;
  %49 = expand_dims(%48, axis=1, num_newaxis=2) /* ty=Tensor[(12, 1, 1), float32] */;
  %50 = nn.conv2d(%46, %47, padding=[0, 0, 0, 0], channels=12, kernel_size=[1, 1]) /* ty=Tensor[(1, 12, 129, 129), float32] span=tfl.conv_2d3_prequant:0:0 */;
  %51 = expand_dims(%49, axis=0) /* ty=Tensor[(1, 12, 1, 1), float32] */;
  %52 = add(%50, %51) /* ty=Tensor[(1, 12, 129, 129), float32] */;
  %53 = qnn.quantize(%52, 0.335761f /* ty=float32 span=tfl.conv_2d3_quantize.scale__399:0:0 */, -7 /* ty=int32 span=tfl.conv_2d3_quantize:0:0 */, out_dtype="int8", axis=1) /* ty=Tensor[(1, 12, 129, 129), int8] span=tfl.conv_2d3_quantize:0:0 */;
  %54 = qnn.dequantize(%53, 0.335761f /* ty=float32 span=tfl.conv_2d3_quantize.scale__399:0:0 */, -7 /* ty=int32 span=tfl.conv_2d3_dequant:0:0 */, out_dtype="float32", axis=1) /* ty=Tensor[(1, 12, 129, 129), float32] span=tfl.conv_2d3_dequant:0:0 */;
  %55 = qnn.dequantize(meta[relay.Constant][36] /* ty=Tensor[(72, 12, 1, 1), int8] span=std.constant4_dequant.std.constant4:0:0 */, meta[relay.Constant][37] /* ty=Tensor[(72), float32] span=std.constant4_dequant.scale__195:0:0 */, meta[relay.Constant][38] /* ty=Tensor[(72), int32] span=std.constant4_dequant:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(72, 12, 1, 1), float32] span=std.constant4_dequant:0:0 */;
  %56 = qnn.dequantize(meta[relay.Constant][39] /* ty=Tensor[(72), int32] span=std.constant43_dequant.std.constant43:0:0 */, meta[relay.Constant][40] /* ty=Tensor[(72), float32] span=std.constant43_dequant.scale__187:0:0 */, meta[relay.Constant][41] /* ty=Tensor[(72), int32] span=std.constant43_dequant:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(72), float32] span=std.constant43_dequant:0:0 */;
  %57 = expand_dims(%56, axis=1, num_newaxis=2) /* ty=Tensor[(72, 1, 1), float32] */;
  %58 = nn.conv2d(%54, %55, padding=[0, 0, 0, 0], channels=72, kernel_size=[1, 1]) /* ty=Tensor[(1, 72, 129, 129), float32] span=tfl.conv_2d4_prequant:0:0 */;
  %59 = expand_dims(%57, axis=0) /* ty=Tensor[(1, 72, 1, 1), float32] */;
  %60 = add(%58, %59) /* ty=Tensor[(1, 72, 129, 129), float32] */;
  %61 = clip(%60, a_min=0f, a_max=6f) /* ty=Tensor[(1, 72, 129, 129), float32] span=Relu6__15:0:0 */;
  %62 = qnn.quantize(%61, 0.0235294f /* ty=float32 span=tfl.conv_2d_quantize.scale__553:0:0 */, -128 /* ty=int32 span=tfl.conv_2d4_quantize:0:0 */, out_dtype="int8", axis=1) /* ty=Tensor[(1, 72, 129, 129), int8] span=tfl.conv_2d4_quantize:0:0 */;
  %63 = qnn.dequantize(%62, 0.0235294f /* ty=float32 span=tfl.conv_2d_quantize.scale__553:0:0 */, -128 /* ty=int32 span=tfl.depthwise_conv_2d2_prequant__410_DequantizeLinear__1455:0:0 */, out_dtype="float32", axis=1) /* ty=Tensor[(1, 72, 129, 129), float32] span=tfl.depthwise_conv_2d2_prequant__410_DequantizeLinear__1455:0:0 */;
  %64 = qnn.dequantize(meta[relay.Constant][42] /* ty=Tensor[(72, 1, 3, 3), int8] span=std.constant44_dequant.std.constant44:0:0 */, meta[relay.Constant][43] /* ty=Tensor[(72), float32] span=std.constant44_dequant.scale__185:0:0 */, meta[relay.Constant][44] /* ty=Tensor[(72), int32] span=std.constant44_dequant:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(72, 1, 3, 3), float32] span=std.constant44_dequant:0:0 */;
  %65 = qnn.dequantize(meta[relay.Constant][45] /* ty=Tensor[(72), int32] span=MobilenetV2/expanded_conv_2/depthwise/BatchNorm/FusedBatchNorm_dequant.MobilenetV2/expanded_conv_2/depthwise/BatchNorm/FusedBatchNorm:0:0 */, meta[relay.Constant][46] /* ty=Tensor[(72), float32] span=MobilenetV2/expanded_conv_2/depthwise/BatchNorm/FusedBatchNorm_dequant.scale__302:0:0 */, meta[relay.Constant][47] /* ty=Tensor[(72), int32] span=MobilenetV2/expanded_conv_2/depthwise/BatchNorm/FusedBatchNorm_dequant:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(72), float32] span=MobilenetV2/expanded_conv_2/depthwise/BatchNorm/FusedBatchNorm_dequant:0:0 */;
  %66 = expand_dims(%65, axis=1, num_newaxis=2) /* ty=Tensor[(72, 1, 1), float32] */;
  %67 = nn.conv2d(%63, %64, padding=[1, 1, 1, 1], groups=72, channels=72, kernel_size=[3, 3]) /* ty=Tensor[(1, 72, 129, 129), float32] span=tfl.depthwise_conv_2d2_prequant:0:0 */;
  %68 = expand_dims(%66, axis=0) /* ty=Tensor[(1, 72, 1, 1), float32] */;
  %69 = add(%67, %68) /* ty=Tensor[(1, 72, 129, 129), float32] */;
  %70 = clip(%69, a_min=0f, a_max=6f) /* ty=Tensor[(1, 72, 129, 129), float32] span=Relu6__17:0:0 */;
  %71 = qnn.quantize(%70, 0.0235294f /* ty=float32 span=tfl.conv_2d_quantize.scale__553:0:0 */, -128 /* ty=int32 span=tfl.depthwise_conv_2d2_quantize:0:0 */, out_dtype="int8", axis=1) /* ty=Tensor[(1, 72, 129, 129), int8] span=tfl.depthwise_conv_2d2_quantize:0:0 */;
  %72 = qnn.dequantize(%71, 0.0235294f /* ty=float32 span=tfl.conv_2d_quantize.scale__553:0:0 */, -128 /* ty=int32 span=tfl.conv_2d5_prequant__421_DequantizeLinear__1429:0:0 */, out_dtype="float32", axis=1) /* ty=Tensor[(1, 72, 129, 129), float32] span=tfl.conv_2d5_prequant__421_DequantizeLinear__1429:0:0 */;
  %73 = qnn.dequantize(meta[relay.Constant][48] /* ty=Tensor[(12, 72, 1, 1), int8] span=std.constant5_dequant.std.constant5:0:0 */, meta[relay.Constant][49] /* ty=Tensor[(12), float32] span=std.constant5_dequant.scale__173:0:0 */, meta[relay.Constant][50] /* ty=Tensor[(12), int32] span=std.constant5_dequant:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(12, 72, 1, 1), float32] span=std.constant5_dequant:0:0 */;
  %74 = qnn.dequantize(meta[relay.Constant][51] /* ty=Tensor[(12), int32] span=std.constant45_dequant.std.constant45:0:0 */, meta[relay.Constant][52] /* ty=Tensor[(12), float32] span=std.constant45_dequant.scale__183:0:0 */, meta[relay.Constant][53] /* ty=Tensor[(12), int32] span=std.constant45_dequant:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(12), float32] span=std.constant45_dequant:0:0 */;
  %75 = expand_dims(%74, axis=1, num_newaxis=2) /* ty=Tensor[(12, 1, 1), float32] */;
  %76 = nn.conv2d(%72, %73, padding=[0, 0, 0, 0], channels=12, kernel_size=[1, 1]) /* ty=Tensor[(1, 12, 129, 129), float32] span=tfl.conv_2d5_prequant:0:0 */;
  %77 = expand_dims(%75, axis=0) /* ty=Tensor[(1, 12, 1, 1), float32] */;
  %78 = add(%76, %77) /* ty=Tensor[(1, 12, 129, 129), float32] */;
  %79 = qnn.quantize(%78, 0.514195f /* ty=float32 span=tfl.conv_2d5_quantize.scale__424:0:0 */, -16 /* ty=int32 span=tfl.conv_2d5_quantize:0:0 */, out_dtype="int8", axis=1) /* ty=Tensor[(1, 12, 129, 129), int8] span=tfl.conv_2d5_quantize:0:0 */;
  %80 = qnn.dequantize(%79, 0.514195f /* ty=float32 span=tfl.conv_2d5_quantize.scale__424:0:0 */, -16 /* ty=int32 span=tfl.conv_2d5_dequant:0:0 */, out_dtype="float32", axis=1) /* ty=Tensor[(1, 12, 129, 129), float32] span=tfl.conv_2d5_dequant:0:0 */;
  %81 = add(%80, %54) /* ty=Tensor[(1, 12, 129, 129), float32] span=MobilenetV2/expanded_conv_2/add_prequant:0:0 */;
  %82 = qnn.quantize(%81, 0.44064f /* ty=float32 span=MobilenetV2/expanded_conv_2/add_quantize.scale__430:0:0 */, -5 /* ty=int32 span=MobilenetV2/expanded_conv_2/add_quantize:0:0 */, out_dtype="int8", axis=1) /* ty=Tensor[(1, 12, 129, 129), int8] span=MobilenetV2/expanded_conv_2/add_quantize:0:0 */;
  %83 = qnn.dequantize(%82, 0.44064f /* ty=float32 span=MobilenetV2/expanded_conv_2/add_quantize.scale__430:0:0 */, -5 /* ty=int32 span=tfl.conv_2d6_prequant__432_DequantizeLinear__1463:0:0 */, out_dtype="float32", axis=1) /* ty=Tensor[(1, 12, 129, 129), float32] span=tfl.conv_2d6_prequant__432_DequantizeLinear__1463:0:0 */;
  %84 = qnn.dequantize(meta[relay.Constant][54] /* ty=Tensor[(72, 12, 1, 1), int8] span=std.constant6_dequant.std.constant6:0:0 */, meta[relay.Constant][55] /* ty=Tensor[(72), float32] span=std.constant6_dequant.scale__151:0:0 */, meta[relay.Constant][56] /* ty=Tensor[(72), int32] span=std.constant6_dequant:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(72, 12, 1, 1), float32] span=std.constant6_dequant:0:0 */;
  %85 = qnn.dequantize(meta[relay.Constant][57] /* ty=Tensor[(72), int32] span=std.constant46_dequant.std.constant46:0:0 */, meta[relay.Constant][58] /* ty=Tensor[(72), float32] span=std.constant46_dequant.scale__181:0:0 */, meta[relay.Constant][59] /* ty=Tensor[(72), int32] span=std.constant46_dequant:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(72), float32] span=std.constant46_dequant:0:0 */;
  %86 = expand_dims(%85, axis=1, num_newaxis=2) /* ty=Tensor[(72, 1, 1), float32] */;
  %87 = nn.conv2d(%83, %84, padding=[0, 0, 0, 0], channels=72, kernel_size=[1, 1]) /* ty=Tensor[(1, 72, 129, 129), float32] span=tfl.conv_2d6_prequant:0:0 */;
  %88 = expand_dims(%86, axis=0) /* ty=Tensor[(1, 72, 1, 1), float32] */;
  %89 = add(%87, %88) /* ty=Tensor[(1, 72, 129, 129), float32] */;
  %90 = clip(%89, a_min=0f, a_max=6f) /* ty=Tensor[(1, 72, 129, 129), float32] span=Relu6__20:0:0 */;
  %91 = qnn.quantize(%90, 0.0235294f /* ty=float32 span=tfl.conv_2d_quantize.scale__553:0:0 */, -128 /* ty=int32 span=tfl.conv_2d6_quantize:0:0 */, out_dtype="int8", axis=1) /* ty=Tensor[(1, 72, 129, 129), int8] span=tfl.conv_2d6_quantize:0:0 */;
  %92 = qnn.dequantize(%91, 0.0235294f /* ty=float32 span=tfl.conv_2d_quantize.scale__553:0:0 */, -128 /* ty=int32 span=tfl.depthwise_conv_2d3_prequant__441_DequantizeLinear__1412:0:0 */, out_dtype="float32", axis=1) /* ty=Tensor[(1, 72, 129, 129), float32] span=tfl.depthwise_conv_2d3_prequant__441_DequantizeLinear__1412:0:0 */;
  %93 = qnn.dequantize(meta[relay.Constant][60] /* ty=Tensor[(72, 1, 3, 3), int8] span=std.constant47_dequant.std.constant47:0:0 */, meta[relay.Constant][61] /* ty=Tensor[(72), float32] span=std.constant47_dequant.scale__179:0:0 */, meta[relay.Constant][62] /* ty=Tensor[(72), int32] span=std.constant47_dequant:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(72, 1, 3, 3), float32] span=std.constant47_dequant:0:0 */;
  %94 = qnn.dequantize(meta[relay.Constant][63] /* ty=Tensor[(72), int32] span=MobilenetV2/expanded_conv_3/depthwise/BatchNorm/FusedBatchNorm_dequant.MobilenetV2/expanded_conv_3/depthwise/BatchNorm/FusedBatchNorm:0:0 */, meta[relay.Constant][64] /* ty=Tensor[(72), float32] span=MobilenetV2/expanded_conv_3/depthwise/BatchNorm/FusedBatchNorm_dequant.scale__300:0:0 */, meta[relay.Constant][65] /* ty=Tensor[(72), int32] span=MobilenetV2/expanded_conv_3/depthwise/BatchNorm/FusedBatchNorm_dequant:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(72), float32] span=MobilenetV2/expanded_conv_3/depthwise/BatchNorm/FusedBatchNorm_dequant:0:0 */;
  %95 = expand_dims(%94, axis=1, num_newaxis=2) /* ty=Tensor[(72, 1, 1), float32] */;
  %96 = nn.conv2d(%92, %93, strides=[2, 2], padding=[1, 1, 1, 1], groups=72, channels=72, kernel_size=[3, 3]) /* ty=Tensor[(1, 72, 65, 65), float32] span=tfl.depthwise_conv_2d3_prequant:0:0 */;
  %97 = expand_dims(%95, axis=0) /* ty=Tensor[(1, 72, 1, 1), float32] */;
  %98 = add(%96, %97) /* ty=Tensor[(1, 72, 65, 65), float32] */;
  %99 = clip(%98, a_min=0f, a_max=6f) /* ty=Tensor[(1, 72, 65, 65), float32] span=Relu6__22:0:0 */;
  %100 = qnn.quantize(%99, 0.0235294f /* ty=float32 span=tfl.conv_2d_quantize.scale__553:0:0 */, -128 /* ty=int32 span=tfl.depthwise_conv_2d3_quantize:0:0 */, out_dtype="int8", axis=1) /* ty=Tensor[(1, 72, 65, 65), int8] span=tfl.depthwise_conv_2d3_quantize:0:0 */;
  %101 = qnn.dequantize(%100, 0.0235294f /* ty=float32 span=tfl.conv_2d_quantize.scale__553:0:0 */, -128 /* ty=int32 span=tfl.conv_2d7_prequant__452_DequantizeLinear__1425:0:0 */, out_dtype="float32", axis=1) /* ty=Tensor[(1, 72, 65, 65), float32] span=tfl.conv_2d7_prequant__452_DequantizeLinear__1425:0:0 */;
  %102 = qnn.dequantize(meta[relay.Constant][66] /* ty=Tensor[(16, 72, 1, 1), int8] span=std.constant7_dequant.std.constant7:0:0 */, meta[relay.Constant][67] /* ty=Tensor[(16), float32] span=std.constant7_dequant.scale__129:0:0 */, meta[relay.Constant][68] /* ty=Tensor[(16), int32] span=std.constant7_dequant:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(16, 72, 1, 1), float32] span=std.constant7_dequant:0:0 */;
  %103 = qnn.dequantize(meta[relay.Constant][69] /* ty=Tensor[(16), int32] span=std.constant48_dequant.std.constant48:0:0 */, meta[relay.Constant][70] /* ty=Tensor[(16), float32] span=std.constant48_dequant.scale__177:0:0 */, meta[relay.Constant][71] /* ty=Tensor[(16), int32] span=std.constant48_dequant:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(16), float32] span=std.constant48_dequant:0:0 */;
  %104 = expand_dims(%103, axis=1, num_newaxis=2) /* ty=Tensor[(16, 1, 1), float32] */;
  %105 = nn.conv2d(%101, %102, padding=[0, 0, 0, 0], channels=16, kernel_size=[1, 1]) /* ty=Tensor[(1, 16, 65, 65), float32] span=tfl.conv_2d7_prequant:0:0 */;
  %106 = expand_dims(%104, axis=0) /* ty=Tensor[(1, 16, 1, 1), float32] */;
  %107 = add(%105, %106) /* ty=Tensor[(1, 16, 65, 65), float32] */;
  %108 = qnn.quantize(%107, 0.210557f /* ty=float32 span=tfl.conv_2d7_quantize.scale__457:0:0 */, 8 /* ty=int32 span=tfl.conv_2d7_quantize:0:0 */, out_dtype="int8", axis=1) /* ty=Tensor[(1, 16, 65, 65), int8] span=tfl.conv_2d7_quantize:0:0 */;
  %109 = qnn.dequantize(%108, 0.210557f /* ty=float32 span=tfl.conv_2d7_quantize.scale__457:0:0 */, 8 /* ty=int32 span=tfl.conv_2d7_dequant:0:0 */, out_dtype="float32", axis=1) /* ty=Tensor[(1, 16, 65, 65), float32] span=tfl.conv_2d7_dequant:0:0 */;
  %110 = qnn.dequantize(meta[relay.Constant][72] /* ty=Tensor[(96, 16, 1, 1), int8] span=std.constant8_dequant.std.constant8:0:0 */, meta[relay.Constant][73] /* ty=Tensor[(96), float32] span=std.constant8_dequant.scale__107:0:0 */, meta[relay.Constant][74] /* ty=Tensor[(96), int32] span=std.constant8_dequant:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(96, 16, 1, 1), float32] span=std.constant8_dequant:0:0 */;
  %111 = qnn.dequantize(meta[relay.Constant][75] /* ty=Tensor[(96), int32] span=std.constant49_dequant.std.constant49:0:0 */, meta[relay.Constant][76] /* ty=Tensor[(96), float32] span=std.constant49_dequant.scale__175:0:0 */, meta[relay.Constant][77] /* ty=Tensor[(96), int32] span=std.constant49_dequant:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(96), float32] span=std.constant49_dequant:0:0 */;
  %112 = expand_dims(%111, axis=1, num_newaxis=2) /* ty=Tensor[(96, 1, 1), float32] */;
  %113 = nn.conv2d(%109, %110, padding=[0, 0, 0, 0], channels=96, kernel_size=[1, 1]) /* ty=Tensor[(1, 96, 65, 65), float32] span=tfl.conv_2d8_prequant:0:0 */;
  %114 = expand_dims(%112, axis=0) /* ty=Tensor[(1, 96, 1, 1), float32] */;
  %115 = add(%113, %114) /* ty=Tensor[(1, 96, 65, 65), float32] */;
  %116 = clip(%115, a_min=0f, a_max=6f) /* ty=Tensor[(1, 96, 65, 65), float32] span=Relu6__25:0:0 */;
  %117 = qnn.quantize(%116, 0.0235294f /* ty=float32 span=tfl.conv_2d_quantize.scale__553:0:0 */, -128 /* ty=int32 span=tfl.conv_2d8_quantize:0:0 */, out_dtype="int8", axis=1) /* ty=Tensor[(1, 96, 65, 65), int8] span=tfl.conv_2d8_quantize:0:0 */;
  %118 = qnn.dequantize(%117, 0.0235294f /* ty=float32 span=tfl.conv_2d_quantize.scale__553:0:0 */, -128 /* ty=int32 span=tfl.depthwise_conv_2d4_prequant__468_DequantizeLinear__1421:0:0 */, out_dtype="float32", axis=1) /* ty=Tensor[(1, 96, 65, 65), float32] span=tfl.depthwise_conv_2d4_prequant__468_DequantizeLinear__1421:0:0 */;
  %119 = qnn.dequantize(meta[relay.Constant][78] /* ty=Tensor[(96, 1, 3, 3), int8] span=std.constant50_dequant.std.constant50:0:0 */, meta[relay.Constant][79] /* ty=Tensor[(96), float32] span=std.constant50_dequant.scale__171:0:0 */, meta[relay.Constant][80] /* ty=Tensor[(96), int32] span=std.constant50_dequant:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(96, 1, 3, 3), float32] span=std.constant50_dequant:0:0 */;
  %120 = qnn.dequantize(meta[relay.Constant][81] /* ty=Tensor[(96), int32] span=MobilenetV2/expanded_conv_4/depthwise/BatchNorm/FusedBatchNorm_dequant.MobilenetV2/expanded_conv_4/depthwise/BatchNorm/FusedBatchNorm:0:0 */, meta[relay.Constant][82] /* ty=Tensor[(96), float32] span=MobilenetV2/expanded_conv_4/depthwise/BatchNorm/FusedBatchNorm_dequant.scale__298:0:0 */, meta[relay.Constant][83] /* ty=Tensor[(96), int32] span=MobilenetV2/expanded_conv_4/depthwise/BatchNorm/FusedBatchNorm_dequant:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(96), float32] span=MobilenetV2/expanded_conv_4/depthwise/BatchNorm/FusedBatchNorm_dequant:0:0 */;
  %121 = expand_dims(%120, axis=1, num_newaxis=2) /* ty=Tensor[(96, 1, 1), float32] */;
  %122 = nn.conv2d(%118, %119, padding=[1, 1, 1, 1], groups=96, channels=96, kernel_size=[3, 3]) /* ty=Tensor[(1, 96, 65, 65), float32] span=tfl.depthwise_conv_2d4_prequant:0:0 */;
  %123 = expand_dims(%121, axis=0) /* ty=Tensor[(1, 96, 1, 1), float32] */;
  %124 = add(%122, %123) /* ty=Tensor[(1, 96, 65, 65), float32] */;
  %125 = clip(%124, a_min=0f, a_max=6f) /* ty=Tensor[(1, 96, 65, 65), float32] span=Relu6__27:0:0 */;
  %126 = qnn.quantize(%125, 0.0235294f /* ty=float32 span=tfl.conv_2d_quantize.scale__553:0:0 */, -128 /* ty=int32 span=tfl.depthwise_conv_2d4_quantize:0:0 */, out_dtype="int8", axis=1) /* ty=Tensor[(1, 96, 65, 65), int8] span=tfl.depthwise_conv_2d4_quantize:0:0 */;
  %127 = qnn.dequantize(%126, 0.0235294f /* ty=float32 span=tfl.conv_2d_quantize.scale__553:0:0 */, -128 /* ty=int32 span=tfl.conv_2d9_prequant__479_DequantizeLinear__1413:0:0 */, out_dtype="float32", axis=1) /* ty=Tensor[(1, 96, 65, 65), float32] span=tfl.conv_2d9_prequant__479_DequantizeLinear__1413:0:0 */;
  %128 = qnn.dequantize(meta[relay.Constant][84] /* ty=Tensor[(16, 96, 1, 1), int8] span=std.constant9_dequant.std.constant9:0:0 */, meta[relay.Constant][85] /* ty=Tensor[(16), float32] span=std.constant9_dequant.scale__101:0:0 */, meta[relay.Constant][86] /* ty=Tensor[(16), int32] span=std.constant9_dequant:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(16, 96, 1, 1), float32] span=std.constant9_dequant:0:0 */;
  %129 = qnn.dequantize(meta[relay.Constant][87] /* ty=Tensor[(16), int32] span=std.constant51_dequant.std.constant51:0:0 */, meta[relay.Constant][88] /* ty=Tensor[(16), float32] span=std.constant51_dequant.scale__169:0:0 */, meta[relay.Constant][89] /* ty=Tensor[(16), int32] span=std.constant51_dequant:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(16), float32] span=std.constant51_dequant:0:0 */;
  %130 = expand_dims(%129, axis=1, num_newaxis=2) /* ty=Tensor[(16, 1, 1), float32] */;
  %131 = nn.conv2d(%127, %128, padding=[0, 0, 0, 0], channels=16, kernel_size=[1, 1]) /* ty=Tensor[(1, 16, 65, 65), float32] span=tfl.conv_2d9_prequant:0:0 */;
  %132 = expand_dims(%130, axis=0) /* ty=Tensor[(1, 16, 1, 1), float32] */;
  %133 = add(%131, %132) /* ty=Tensor[(1, 16, 65, 65), float32] */;
  %134 = qnn.quantize(%133, 0.143239f /* ty=float32 span=tfl.conv_2d9_quantize.scale__482:0:0 */, -2 /* ty=int32 span=tfl.conv_2d9_quantize:0:0 */, out_dtype="int8", axis=1) /* ty=Tensor[(1, 16, 65, 65), int8] span=tfl.conv_2d9_quantize:0:0 */;
  %135 = qnn.dequantize(%134, 0.143239f /* ty=float32 span=tfl.conv_2d9_quantize.scale__482:0:0 */, -2 /* ty=int32 span=tfl.conv_2d9_dequant:0:0 */, out_dtype="float32", axis=1) /* ty=Tensor[(1, 16, 65, 65), float32] span=tfl.conv_2d9_dequant:0:0 */;
  %136 = add(%135, %109) /* ty=Tensor[(1, 16, 65, 65), float32] span=MobilenetV2/expanded_conv_4/add_prequant:0:0 */;
  %137 = qnn.quantize(%136, 0.243543f /* ty=float32 span=MobilenetV2/expanded_conv_4/add_quantize.scale__488:0:0 */, -2 /* ty=int32 span=MobilenetV2/expanded_conv_4/add_quantize:0:0 */, out_dtype="int8", axis=1) /* ty=Tensor[(1, 16, 65, 65), int8] span=MobilenetV2/expanded_conv_4/add_quantize:0:0 */;
  %138 = qnn.dequantize(%137, 0.243543f /* ty=float32 span=MobilenetV2/expanded_conv_4/add_quantize.scale__488:0:0 */, -2 /* ty=int32 span=tfl.conv_2d10_prequant__490_DequantizeLinear__1474:0:0 */, out_dtype="float32", axis=1) /* ty=Tensor[(1, 16, 65, 65), float32] span=tfl.conv_2d10_prequant__490_DequantizeLinear__1474:0:0 */;
  %139 = qnn.dequantize(meta[relay.Constant][90] /* ty=Tensor[(96, 16, 1, 1), int8] span=std.constant10_dequant.std.constant10:0:0 */, meta[relay.Constant][91] /* ty=Tensor[(96), float32] span=std.constant10_dequant.scale__259:0:0 */, meta[relay.Constant][92] /* ty=Tensor[(96), int32] span=std.constant10_dequant:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(96, 16, 1, 1), float32] span=std.constant10_dequant:0:0 */;
  %140 = qnn.dequantize(meta[relay.Constant][93] /* ty=Tensor[(96), int32] span=std.constant52_dequant.std.constant52:0:0 */, meta[relay.Constant][94] /* ty=Tensor[(96), float32] span=std.constant52_dequant.scale__167:0:0 */, meta[relay.Constant][95] /* ty=Tensor[(96), int32] span=std.constant52_dequant:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(96), float32] span=std.constant52_dequant:0:0 */;
  %141 = expand_dims(%140, axis=1, num_newaxis=2) /* ty=Tensor[(96, 1, 1), float32] */;
  %142 = nn.conv2d(%138, %139, padding=[0, 0, 0, 0], channels=96, kernel_size=[1, 1]) /* ty=Tensor[(1, 96, 65, 65), float32] span=tfl.conv_2d10_prequant:0:0 */;
  %143 = expand_dims(%141, axis=0) /* ty=Tensor[(1, 96, 1, 1), float32] */;
  %144 = add(%142, %143) /* ty=Tensor[(1, 96, 65, 65), float32] */;
  %145 = clip(%144, a_min=0f, a_max=6f) /* ty=Tensor[(1, 96, 65, 65), float32] span=Relu6__30:0:0 */;
  %146 = qnn.quantize(%145, 0.0235294f /* ty=float32 span=tfl.conv_2d_quantize.scale__553:0:0 */, -128 /* ty=int32 span=tfl.conv_2d10_quantize:0:0 */, out_dtype="int8", axis=1) /* ty=Tensor[(1, 96, 65, 65), int8] span=tfl.conv_2d10_quantize:0:0 */;
  %147 = qnn.dequantize(%146, 0.0235294f /* ty=float32 span=tfl.conv_2d_quantize.scale__553:0:0 */, -128 /* ty=int32 span=tfl.depthwise_conv_2d5_prequant__499_DequantizeLinear__1462:0:0 */, out_dtype="float32", axis=1) /* ty=Tensor[(1, 96, 65, 65), float32] span=tfl.depthwise_conv_2d5_prequant__499_DequantizeLinear__1462:0:0 */;
  %148 = qnn.dequantize(meta[relay.Constant][96] /* ty=Tensor[(96, 1, 3, 3), int8] span=std.constant53_dequant.std.constant53:0:0 */, meta[relay.Constant][97] /* ty=Tensor[(96), float32] span=std.constant53_dequant.scale__165:0:0 */, meta[relay.Constant][98] /* ty=Tensor[(96), int32] span=std.constant53_dequant:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(96, 1, 3, 3), float32] span=std.constant53_dequant:0:0 */;
  %149 = qnn.dequantize(meta[relay.Constant][99] /* ty=Tensor[(96), int32] span=MobilenetV2/expanded_conv_5/depthwise/BatchNorm/FusedBatchNorm_dequant.MobilenetV2/expanded_conv_5/depthwise/BatchNorm/FusedBatchNorm:0:0 */, meta[relay.Constant][100] /* ty=Tensor[(96), float32] span=MobilenetV2/expanded_conv_5/depthwise/BatchNorm/FusedBatchNorm_dequant.scale__296:0:0 */, meta[relay.Constant][101] /* ty=Tensor[(96), int32] span=MobilenetV2/expanded_conv_5/depthwise/BatchNorm/FusedBatchNorm_dequant:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(96), float32] span=MobilenetV2/expanded_conv_5/depthwise/BatchNorm/FusedBatchNorm_dequant:0:0 */;
  %150 = expand_dims(%149, axis=1, num_newaxis=2) /* ty=Tensor[(96, 1, 1), float32] */;
  %151 = nn.conv2d(%147, %148, padding=[1, 1, 1, 1], groups=96, channels=96, kernel_size=[3, 3]) /* ty=Tensor[(1, 96, 65, 65), float32] span=tfl.depthwise_conv_2d5_prequant:0:0 */;
  %152 = expand_dims(%150, axis=0) /* ty=Tensor[(1, 96, 1, 1), float32] */;
  %153 = add(%151, %152) /* ty=Tensor[(1, 96, 65, 65), float32] */;
  %154 = clip(%153, a_min=0f, a_max=6f) /* ty=Tensor[(1, 96, 65, 65), float32] span=Relu6__32:0:0 */;
  %155 = qnn.quantize(%154, 0.0235294f /* ty=float32 span=tfl.conv_2d_quantize.scale__553:0:0 */, -128 /* ty=int32 span=tfl.depthwise_conv_2d5_quantize:0:0 */, out_dtype="int8", axis=1) /* ty=Tensor[(1, 96, 65, 65), int8] span=tfl.depthwise_conv_2d5_quantize:0:0 */;
  %156 = qnn.dequantize(%155, 0.0235294f /* ty=float32 span=tfl.conv_2d_quantize.scale__553:0:0 */, -128 /* ty=int32 span=tfl.conv_2d11_prequant__510_DequantizeLinear__1476:0:0 */, out_dtype="float32", axis=1) /* ty=Tensor[(1, 96, 65, 65), float32] span=tfl.conv_2d11_prequant__510_DequantizeLinear__1476:0:0 */;
  %157 = qnn.dequantize(meta[relay.Constant][102] /* ty=Tensor[(16, 96, 1, 1), int8] span=std.constant11_dequant.std.constant11:0:0 */, meta[relay.Constant][103] /* ty=Tensor[(16), float32] span=std.constant11_dequant.scale__257:0:0 */, meta[relay.Constant][104] /* ty=Tensor[(16), int32] span=std.constant11_dequant:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(16, 96, 1, 1), float32] span=std.constant11_dequant:0:0 */;
  %158 = qnn.dequantize(meta[relay.Constant][105] /* ty=Tensor[(16), int32] span=std.constant54_dequant.std.constant54:0:0 */, meta[relay.Constant][106] /* ty=Tensor[(16), float32] span=std.constant54_dequant.scale__163:0:0 */, meta[relay.Constant][107] /* ty=Tensor[(16), int32] span=std.constant54_dequant:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(16), float32] span=std.constant54_dequant:0:0 */;
  %159 = expand_dims(%158, axis=1, num_newaxis=2) /* ty=Tensor[(16, 1, 1), float32] */;
  %160 = nn.conv2d(%156, %157, padding=[0, 0, 0, 0], channels=16, kernel_size=[1, 1]) /* ty=Tensor[(1, 16, 65, 65), float32] span=tfl.conv_2d11_prequant:0:0 */;
  %161 = expand_dims(%159, axis=0) /* ty=Tensor[(1, 16, 1, 1), float32] */;
  %162 = add(%160, %161) /* ty=Tensor[(1, 16, 65, 65), float32] */;
  %163 = qnn.quantize(%162, 0.14688f /* ty=float32 span=tfl.conv_2d11_quantize.scale__513:0:0 */, -2 /* ty=int32 span=tfl.conv_2d11_quantize:0:0 */, out_dtype="int8", axis=1) /* ty=Tensor[(1, 16, 65, 65), int8] span=tfl.conv_2d11_quantize:0:0 */;
  %164 = qnn.dequantize(%163, 0.14688f /* ty=float32 span=tfl.conv_2d11_quantize.scale__513:0:0 */, -2 /* ty=int32 span=tfl.conv_2d11_dequant:0:0 */, out_dtype="float32", axis=1) /* ty=Tensor[(1, 16, 65, 65), float32] span=tfl.conv_2d11_dequant:0:0 */;
  %165 = add(%164, %138) /* ty=Tensor[(1, 16, 65, 65), float32] span=MobilenetV2/expanded_conv_5/add_prequant:0:0 */;
  %166 = qnn.quantize(%165, 0.243438f /* ty=float32 span=MobilenetV2/expanded_conv_5/add_quantize.scale__519:0:0 */, 6 /* ty=int32 span=MobilenetV2/expanded_conv_5/add_quantize:0:0 */, out_dtype="int8", axis=1) /* ty=Tensor[(1, 16, 65, 65), int8] span=MobilenetV2/expanded_conv_5/add_quantize:0:0 */;
  %167 = qnn.dequantize(%166, 0.243438f /* ty=float32 span=MobilenetV2/expanded_conv_5/add_quantize.scale__519:0:0 */, 6 /* ty=int32 span=tfl.conv_2d12_prequant__521_DequantizeLinear__1475:0:0 */, out_dtype="float32", axis=1) /* ty=Tensor[(1, 16, 65, 65), float32] span=tfl.conv_2d12_prequant__521_DequantizeLinear__1475:0:0 */;
  %168 = qnn.dequantize(meta[relay.Constant][108] /* ty=Tensor[(96, 16, 1, 1), int8] span=std.constant12_dequant.std.constant12:0:0 */, meta[relay.Constant][109] /* ty=Tensor[(96), float32] span=std.constant12_dequant.scale__255:0:0 */, meta[relay.Constant][110] /* ty=Tensor[(96), int32] span=std.constant12_dequant:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(96, 16, 1, 1), float32] span=std.constant12_dequant:0:0 */;
  %169 = qnn.dequantize(meta[relay.Constant][111] /* ty=Tensor[(96), int32] span=std.constant55_dequant.std.constant55:0:0 */, meta[relay.Constant][112] /* ty=Tensor[(96), float32] span=std.constant55_dequant.scale__161:0:0 */, meta[relay.Constant][113] /* ty=Tensor[(96), int32] span=std.constant55_dequant:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(96), float32] span=std.constant55_dequant:0:0 */;
  %170 = expand_dims(%169, axis=1, num_newaxis=2) /* ty=Tensor[(96, 1, 1), float32] */;
  %171 = nn.conv2d(%167, %168, padding=[0, 0, 0, 0], channels=96, kernel_size=[1, 1]) /* ty=Tensor[(1, 96, 65, 65), float32] span=tfl.conv_2d12_prequant:0:0 */;
  %172 = expand_dims(%170, axis=0) /* ty=Tensor[(1, 96, 1, 1), float32] */;
  %173 = add(%171, %172) /* ty=Tensor[(1, 96, 65, 65), float32] */;
  %174 = clip(%173, a_min=0f, a_max=6f) /* ty=Tensor[(1, 96, 65, 65), float32] span=Relu6__35:0:0 */;
  %175 = qnn.quantize(%174, 0.0235294f /* ty=float32 span=tfl.conv_2d_quantize.scale__553:0:0 */, -128 /* ty=int32 span=tfl.conv_2d12_quantize:0:0 */, out_dtype="int8", axis=1) /* ty=Tensor[(1, 96, 65, 65), int8] span=tfl.conv_2d12_quantize:0:0 */;
  %176 = qnn.dequantize(%175, 0.0235294f /* ty=float32 span=tfl.conv_2d_quantize.scale__553:0:0 */, -128 /* ty=int32 span=tfl.depthwise_conv_2d6_prequant__530_DequantizeLinear__1434:0:0 */, out_dtype="float32", axis=1) /* ty=Tensor[(1, 96, 65, 65), float32] span=tfl.depthwise_conv_2d6_prequant__530_DequantizeLinear__1434:0:0 */;
  %177 = qnn.dequantize(meta[relay.Constant][114] /* ty=Tensor[(96, 1, 3, 3), int8] span=std.constant56_dequant.std.constant56:0:0 */, meta[relay.Constant][115] /* ty=Tensor[(96), float32] span=std.constant56_dequant.scale__159:0:0 */, meta[relay.Constant][116] /* ty=Tensor[(96), int32] span=std.constant56_dequant:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(96, 1, 3, 3), float32] span=std.constant56_dequant:0:0 */;
  %178 = qnn.dequantize(meta[relay.Constant][117] /* ty=Tensor[(96), int32] span=MobilenetV2/expanded_conv_6/depthwise/BatchNorm/FusedBatchNorm_dequant.MobilenetV2/expanded_conv_6/depthwise/BatchNorm/FusedBatchNorm:0:0 */, meta[relay.Constant][118] /* ty=Tensor[(96), float32] span=MobilenetV2/expanded_conv_6/depthwise/BatchNorm/FusedBatchNorm_dequant.scale__294:0:0 */, meta[relay.Constant][119] /* ty=Tensor[(96), int32] span=MobilenetV2/expanded_conv_6/depthwise/BatchNorm/FusedBatchNorm_dequant:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(96), float32] span=MobilenetV2/expanded_conv_6/depthwise/BatchNorm/FusedBatchNorm_dequant:0:0 */;
  %179 = expand_dims(%178, axis=1, num_newaxis=2) /* ty=Tensor[(96, 1, 1), float32] */;
  %180 = nn.conv2d(%176, %177, padding=[1, 1, 1, 1], groups=96, channels=96, kernel_size=[3, 3]) /* ty=Tensor[(1, 96, 65, 65), float32] span=tfl.depthwise_conv_2d6_prequant:0:0 */;
  %181 = expand_dims(%179, axis=0) /* ty=Tensor[(1, 96, 1, 1), float32] */;
  %182 = add(%180, %181) /* ty=Tensor[(1, 96, 65, 65), float32] */;
  %183 = clip(%182, a_min=0f, a_max=6f) /* ty=Tensor[(1, 96, 65, 65), float32] span=Relu6__37:0:0 */;
  %184 = qnn.quantize(%183, 0.0235294f /* ty=float32 span=tfl.conv_2d_quantize.scale__553:0:0 */, -128 /* ty=int32 span=tfl.depthwise_conv_2d6_quantize:0:0 */, out_dtype="int8", axis=1) /* ty=Tensor[(1, 96, 65, 65), int8] span=tfl.depthwise_conv_2d6_quantize:0:0 */;
  %185 = qnn.dequantize(%184, 0.0235294f /* ty=float32 span=tfl.conv_2d_quantize.scale__553:0:0 */, -128 /* ty=int32 span=tfl.conv_2d13_prequant__541_DequantizeLinear__1442:0:0 */, out_dtype="float32", axis=1) /* ty=Tensor[(1, 96, 65, 65), float32] span=tfl.conv_2d13_prequant__541_DequantizeLinear__1442:0:0 */;
  %186 = qnn.dequantize(meta[relay.Constant][120] /* ty=Tensor[(32, 96, 1, 1), int8] span=std.constant13_dequant.std.constant13:0:0 */, meta[relay.Constant][121] /* ty=Tensor[(32), float32] span=std.constant13_dequant.scale__253:0:0 */, meta[relay.Constant][122] /* ty=Tensor[(32), int32] span=std.constant13_dequant:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(32, 96, 1, 1), float32] span=std.constant13_dequant:0:0 */;
  %187 = qnn.dequantize(meta[relay.Constant][123] /* ty=Tensor[(32), int32] span=std.constant57_dequant.std.constant57:0:0 */, meta[relay.Constant][124] /* ty=Tensor[(32), float32] span=std.constant57_dequant.scale__157:0:0 */, meta[relay.Constant][125] /* ty=Tensor[(32), int32] span=std.constant57_dequant:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(32), float32] span=std.constant57_dequant:0:0 */;
  %188 = expand_dims(%187, axis=1, num_newaxis=2) /* ty=Tensor[(32, 1, 1), float32] */;
  %189 = nn.conv2d(%185, %186, padding=[0, 0, 0, 0], channels=32, kernel_size=[1, 1]) /* ty=Tensor[(1, 32, 65, 65), float32] span=tfl.conv_2d13_prequant:0:0 */;
  %190 = expand_dims(%188, axis=0) /* ty=Tensor[(1, 32, 1, 1), float32] */;
  %191 = add(%189, %190) /* ty=Tensor[(1, 32, 65, 65), float32] */;
  %192 = qnn.quantize(%191, 0.186671f /* ty=float32 span=tfl.conv_2d13_quantize.scale__546:0:0 */, -14 /* ty=int32 span=tfl.conv_2d13_quantize:0:0 */, out_dtype="int8", axis=1) /* ty=Tensor[(1, 32, 65, 65), int8] span=tfl.conv_2d13_quantize:0:0 */;
  %193 = qnn.dequantize(%192, 0.186671f /* ty=float32 span=tfl.conv_2d13_quantize.scale__546:0:0 */, -14 /* ty=int32 span=tfl.conv_2d14_prequant__548_DequantizeLinear__1406:0:0 */, out_dtype="float32", axis=1) /* ty=Tensor[(1, 32, 65, 65), float32] span=tfl.conv_2d14_prequant__548_DequantizeLinear__1406:0:0 */;
  %194 = qnn.dequantize(meta[relay.Constant][126] /* ty=Tensor[(192, 32, 1, 1), int8] span=std.constant14_dequant.std.constant14:0:0 */, meta[relay.Constant][127] /* ty=Tensor[(192), float32] span=std.constant14_dequant.scale__251:0:0 */, meta[relay.Constant][128] /* ty=Tensor[(192), int32] span=std.constant14_dequant:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(192, 32, 1, 1), float32] span=std.constant14_dequant:0:0 */;
  %195 = qnn.dequantize(meta[relay.Constant][129] /* ty=Tensor[(192), int32] span=std.constant58_dequant.std.constant58:0:0 */, meta[relay.Constant][130] /* ty=Tensor[(192), float32] span=std.constant58_dequant.scale__155:0:0 */, meta[relay.Constant][131] /* ty=Tensor[(192), int32] span=std.constant58_dequant:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(192), float32] span=std.constant58_dequant:0:0 */;
  %196 = expand_dims(%195, axis=1, num_newaxis=2) /* ty=Tensor[(192, 1, 1), float32] */;
  %197 = nn.conv2d(%193, %194, padding=[0, 0, 0, 0], channels=192, kernel_size=[1, 1]) /* ty=Tensor[(1, 192, 65, 65), float32] span=tfl.conv_2d14_prequant:0:0 */;
  %198 = expand_dims(%196, axis=0) /* ty=Tensor[(1, 192, 1, 1), float32] */;
  %199 = add(%197, %198) /* ty=Tensor[(1, 192, 65, 65), float32] */;
  %200 = clip(%199, a_min=0f, a_max=6f) /* ty=Tensor[(1, 192, 65, 65), float32] span=Relu6__40:0:0 */;
  %201 = qnn.quantize(%200, 0.0235294f /* ty=float32 span=tfl.conv_2d_quantize.scale__553:0:0 */, -128 /* ty=int32 span=tfl.conv_2d14_quantize:0:0 */, out_dtype="int8", axis=1) /* ty=Tensor[(1, 192, 65, 65), int8] span=tfl.conv_2d14_quantize:0:0 */;
  %202 = qnn.dequantize(%201, 0.0235294f /* ty=float32 span=tfl.conv_2d_quantize.scale__553:0:0 */, -128 /* ty=int32 span=tfl.conv_2d14_dequant:0:0 */, out_dtype="float32", axis=1) /* ty=Tensor[(1, 192, 65, 65), float32] span=tfl.conv_2d14_dequant:0:0 */;
  %203 = nn.pad(%202, 0f /* ty=float32 span=Pad__560:0:0 */, pad_width=[[0i64, 0i64], [0i64, 0i64], [2i64, 3i64], [2i64, 3i64]]) /* ty=Tensor[(1, 192, 70, 70), float32] span=Pad__560:0:0 */;
  %204 = reshape(%203, newshape=[192, 1, 70, 70]) /* ty=Tensor[(192, 1, 70, 70), float32] span=Transpose__558:0:0 */;
  %205 = nn.space_to_depth(%204, block_size=2, mode="") /* ty=Tensor[(192, 4, 35, 35), float32] span=SpaceToDepth__561:0:0 */;
  %206 = qnn.quantize(%205, 0.0235294f /* ty=float32 span=tfl.conv_2d_quantize.scale__553:0:0 */, -128 /* ty=int32 span=MobilenetV2/expanded_conv_7/depthwise/depthwise/SpaceToBatchND_quantize:0:0 */, out_dtype="int8", axis=1) /* ty=Tensor[(192, 4, 35, 35), int8] span=MobilenetV2/expanded_conv_7/depthwise/depthwise/SpaceToBatchND_quantize:0:0 */;
  %207 = transpose(%206, axes=[1, 0, 2, 3]) /* ty=Tensor[(4, 192, 35, 35), int8] span=MobilenetV2/expanded_conv_7/depthwise/depthwise1_prequant__567:0:0 */;
  %208 = qnn.dequantize(%207, 0.0235294f /* ty=float32 span=tfl.conv_2d_quantize.scale__553:0:0 */, -128 /* ty=int32 span=MobilenetV2/expanded_conv_7/depthwise/depthwise1_prequant__567_DequantizeLinear__1482:0:0 */, out_dtype="float32", axis=1) /* ty=Tensor[(4, 192, 35, 35), float32] span=MobilenetV2/expanded_conv_7/depthwise/depthwise1_prequant__567_DequantizeLinear__1482:0:0 */;
  %209 = qnn.dequantize(meta[relay.Constant][132] /* ty=Tensor[(192, 1, 3, 3), int8] span=MobilenetV2/expanded_conv_7/depthwise/depthwise_dequant.MobilenetV2/expanded_conv_7/depthwise/depthwise:0:0 */, meta[relay.Constant][133] /* ty=Tensor[(192), float32] span=MobilenetV2/expanded_conv_7/depthwise/depthwise_dequant.scale__288:0:0 */, meta[relay.Constant][134] /* ty=Tensor[(192), int32] span=MobilenetV2/expanded_conv_7/depthwise/depthwise_dequant:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(192, 1, 3, 3), float32] span=MobilenetV2/expanded_conv_7/depthwise/depthwise_dequant:0:0 */;
  %210 = qnn.dequantize(meta[relay.Constant][135] /* ty=Tensor[(192), int32] span=std.constant58_dequant.zero_point__156:0:0 */, meta[relay.Constant][136] /* ty=Tensor[(192), float32] span=MobilenetV2/expanded_conv_10/depthwise/depthwise_dequant.scale__346:0:0 */, meta[relay.Constant][137] /* ty=Tensor[(192), int32] span=MobilenetV2/expanded_conv_10/depthwise/depthwise_dequant:0:0 */, out_dtype="float32", axis=0) /* ty=Tensor[(192), float32] span=MobilenetV2/expanded_conv_10/depthwise/depthwise_dequant:0:0 */;
  %211 = expand_dims(%210, axis=1, num_newaxis=2) /* ty=Tensor[(192, 1, 1), float32] */;
  %212 = nn.conv2d(%208, %209, padding=[0, 0, 0, 0], groups=192, channels=192, kernel_size=[3, 3]) /* ty=Tensor[(4, 192, 33, 33), float32] span=MobilenetV2/expanded_conv_7/depthwise/depthwise1_prequant:0:0 */;
  %213 = expand_dims(%211, axis=0) /* ty=Tensor[(1, 192, 1, 1), float32] */;
  %214 = add(%212, %213) /* ty=Tensor[(4, 192, 33, 33), float32] */;
  %215 = qnn.quantize(%214, 0.19932f /* ty=float32 span=MobilenetV2/expanded_conv_7/depthwise/depthwise1_quantize.scale__586:0:0 */, 2 /* ty=int32 span=MobilenetV2/expanded_conv_7/depthwise/depthwise1_quantize:0:0 */, out_dtype="int8", axis=1) /* ty=Tensor[(4, 192, 33, 33), int8] span=MobilenetV2/expanded_conv_7/depthwise/depthwise1_quantize:0:0 */;
  %216 = transpose(%215, axes=[1, 0, 2, 3]) /* ty=Tensor[(192, 4, 33, 33), int8] span=Transpose__577:0:0 */;
  %217 = nn.depth_to_space(%216, block_size=2) /* ty=Tensor[(192, 1, 66, 66), int8] span=DepthToSpace__578:0:0 */;
  %218 = strided_slice(%217, begin=[0i64, 0i64], end=[-1i64, -1i64], strides=[1i64, 1i64], axes=[2i64, 3i64]) /* ty=Tensor[(192, 1, 65, 65), int8] span=Slice__582:0:0 */;
  %219 = reshape(%218, newshape=[1, 192, 65, 65]) /* ty=Tensor[(1, 192, 65, 65), int8] span=Transpose__583:0:0 */;
  %220 = transpose(%219, axes=[0, 2, 3, 1]) /* ty=Tensor[(1, 65, 65, 192), int8] span=MobilenetV2/expanded_conv_7/depthwise/depthwise/BatchToSpaceND_prequant:0:0 */;
  %221 = qnn.dequantize(%220, 0.19932f /* ty=float32 span=MobilenetV2/expanded_conv_7/depthwise/depthwise1_quantize.scale__586:0:0 */, 2 /* ty=int32 span=MobilenetV2/expanded_conv_7/depthwise/depthwise/BatchToSpaceND_prequant_DequantizeLinear__1513:0:0 */, out_dtype="float32", axis=1) /* ty=Tensor[(1, 65, 65, 192), float32] span=MobilenetV2/expanded_conv_7/depthwise/depthwise/BatchToSpaceND_prequant_DequantizeLinear__1513:0:0 */;
